{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 5, "citationCountPatent": 0, "totalDownloads": 617},"doi": "10.1109/TCSVT.2011.2158339","title": "Particle Filtering Based Estimation of Consistent Motion and Disparity With Reduced Search Points","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "A particle filtering based block-wise estimation method for estimation of motion in a video sequence and joint estimation of disparity and motion in a stereo video sequence is proposed. Parameters of motion and disparity of a block in a sequence are defined as a state, and evolution of the state with respect to the block index is tracked with particle filtering. The state is assumed to be dependent on the states of neighboring blocks. Estimated motion and disparity fields are consistent and suitable for intermediate frame or view generation. The particle filter provides a method to effectively sample the search space. The particles are concentrated in regions where the probability density function for the state has large values. Hence, the locations of the particles are good candidates for search points of a fast search method. The proposed method can estimate motion and disparity with a fraction of search points necessary for conventional estimation methods.","authors": [{"name": "Seungjoon Yang", "affiliation": "School of Electrical and Computer Engineering, Ulsan National Institute of Science and Technology, Ulsan, Korea", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6121964/5783337/5783337-photo-1-small.gif", "p": ["Seungjoon Yang (S'99–M'00) received the B.S. degree from Seoul National University, Seoul, Korea, in 1990, and the M.S. and Ph.D. degrees from the University of Wisconsin, Madison, in 1993 and 2000, respectively, all in electrical engineering.", "He was with the Digital Media Research and Development Center, Samsung Electronics Company, Ltd., Seoul, from September 2000 to August 2008. He is currently with the School of Electrical and Computer Engineering, Ulsan National Institute of Science and Technology, Ulsan, Korea. His current research interests include image processing, estimation theory, and multi-rate systems.", "Dr. Yang received the Samsung Award for the Best Technology Achievement of the Year in 2008 for his work on the premium digital television platform project."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Estimation", "Indexes", "Tracking", "Video sequences", "Search methods", "Noise", "Current measurement"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video signal processing", "image sequences", "motion estimation", "particle filtering (numerical methods)", "probability", "search problems"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["estimation methods", "particle filtering based estimation", "consistent motion", "reduced search points", "block-wise estimation method", "motion estimation", "joint estimation", "stereo video sequence", "block index", "disparity fields", "search space", "probability density function"]}, {"type": "Author Keywords ", "kwd": ["particle filtering", "3-D recursive search", "Bayesian tracking", "joint estimation of disparity and motion", "motion estimation"]}],"citations":[{"ieee-citations":[{"authors":["Wei Li","Hui Li"],"article name":"Target tracking by multiple cues based on genetic particle filter","Journal Name":"Intelligent Computer Communication and Processing (ICCP) 2013 IEEE International Conference on","vol":"none","pp.": "153-156","Year": "2013","ISSN":"none","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Lixin Liu","Shin-ichi Yagi","Hongyu Bian"],"article name":"Motion-compensated speckle tracking via particle filtering","Journal Name":"Japanese Journal of Applied Physics","vol.": "54","pp.": "07HF17","Year": "2015","ISSN": "0021-4922","ISBN":"none"},{"authors":["Songxiao Cao","Xuanyin Wang","Ke Xiang"],"article name":"Visual object tracking based on Motion-Adaptive Particle Filter under complex dynamics","Journal Name":"EURASIP Journal on Image and Video Processing","vol.": "2017","pp.":"none","Year": "2017","ISSN": "1687-5281","ISBN":"none"},{"authors":["S. Ploumpis","A. Amanatiadis","A. Gasteratos"],"article name":"A stereo matching approach based on particle filters and scattered control landmarks","Journal Name":"Image and Vision Computing","vol":"none","pp.":"none","Year": "2015","ISSN": "02628856","ISBN":"none"},{"authors":["Mithilesh Kumar Jha","Ravi Chaudhary","Sumantra Dutta Roy","Mona Mathur","Brejesh Lall"],"article name":"Restricted affine motion compensation and estimation in video coding with particle filtering and importance sampling: a multi-resolution approach","Journal Name":"Multimedia Systems","vol":"none","pp.":"none","Year": "2017","ISSN": "0942-4962","ISBN":"none"}]}]}