{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 5, "citationCountPatent": 0, "totalDownloads": 788},"doi": "10.1109/TCSVT.2011.2168150","title": "A Universal Rate Control Scheme for Video Transcoding","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "Video transcoding is proposed for the bitrate adaption, spatial and/or temporal resolutions adaption, and video format conversion. In video streaming application, it converts videos at server to the compatible versions demanded by networks or clients' devices, so that the videos can be delivered over networks and displayed in the clients' devices successfully. This paper provides a universal rate control scheme for various video transcoding purposes. First, a new rate-distortion (R-D) model is established theoretically for better representing the real R-D feature of transcoding. Second, a window-level rate control algorithm is proposed for providing smooth visual quality with compliant buffer constraint by utilizing the two-pass R-D model and a new proposed sliding window buffer control strategy. Finally, a universal rate control scheme for transcoding is developed based on the established R-D model and the proposed window-level rate control algorithm. The extensive experimental results demonstrate that as compared to other state-of-the-art rate control algorithms for transcoding, the proposed scheme can achieve more bit control accuracy with the average mismatch below 0.2%, and much more consistent visual quality with 0.1 dB-0.3 dB peak-to-signal noise ratio improvement in average, while with low computational complexity.","authors": [{"name": "Long Xu", "affiliation": "Department of Computer Science, City University of Hong Kong, Kowloon, Hong Kong", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6019031/6019031-photo-1-small.gif", "p": ["Long Xu received the M.S. degree in applied mathematics from Xidian University, Shaanxi, China, in 2002, and the Ph.D. degree from the Institute of Computing Technology, Chinese Academy of Sciences, Beijing, China.", "He was a Post-Doctoral Researcher with the Department of Computer Science, City University of Hong Kong, Kowloon, Hong Kong, from August 2009 to July 2011. Currently, he is with the Department of Electronic Engineering, Chinese University of Hong Kong, as a Post-Doctoral Researcher. His current research interests include image/video coding, wavelet-based image/video coding, and computer vision."]}}, {"name": "Sam Kwong", "affiliation": "Department of Computer Science, City University of Hong Kong, Kowloon, Hong Kong", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6019031/6019031-photo-2-small.gif", "p": ["Sam Kwong (M'93–SM'04) received the B.S. and M.S. degrees in electrical engineering from the State University of New York at Buffalo, Buffalo, in 1983, the University of Waterloo, Waterloo, ON, Canada, in 1985, and the Ph.D. degree from the University of Hagen, Hagen, Germany, in 1996.", "From 1985 to 1987, he was a Diagnostic Engineer with Control Data Canada, Ottawa, ON, Canada. He joined Bell Northern Research, Ottawa, as a Scientific Staff Member. In 1990, he became a Lecturer with the Department of Electronic Engineering, City University of Hong Kong, Kowloon, Hong Kong, where he is currently a Professor with the Department of Computer Science. His current research interests include video and image coding and evolutionary algorithms."]}}, {"name": "Hanli Wang", "affiliation": "Department of Computer Science and Technology and Key Laboratory of Embedded System and Service Computing, Ministry of Education, Tongji University, Shanghai, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6019031/6019031-photo-3-small.gif", "p": ["Hanli Wang (M'08) received the B.S. and M.S. degrees in electrical engineering from Zhejiang University, Hangzhou, China, in 2001 and 2004, respectively, and the Ph.D. degree in computer science from the City University of Hong Kong, Kowloon, Hong Kong, in 2007.", "From 2007 to 2008, he was a Research Fellow with the Department of Computer Science, City University of Hong Kong, and also a Visiting Scholar with Stanford University, Palo Alto, CA, invited by Prof. C. K. Chui. From 2008 to 2009, he was a Research Engineer with Precoad, Inc., Menlo Park, CA. From 2009 to 2010, he was an Alexander von Humboldt Research Fellow with the University of Hagen, Hagen, Germany. In 2010, he joined the Department of Computer Science and Technology, Tongji University, Shanghai, China, as a Professor. His current research interests include digital video coding, image processing, pattern recognition, and video content analysis."]}}, {"name": "Yun Zhang", "affiliation": "Shenzhen Institute of Advanced Technology, CAS, Shenzhen, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6019031/6019031-photo-4-small.gif", "p": ["Yun Zhang received the B.S. and M.S. degrees in electrical engineering from Ningbo University, Ningbo, China, in 2004 and 2007, respectively, and the Ph.D. degree in computer science from the Institute of Computing Technology, Chinese Academy of Sciences (CAS), Beijing, China, in 2010.", "From 2009 to 2010, he was a Visiting Scholar with the Department of Computer Science, City University of Hong Kong, Kowloon, Hong Kong. In 2010, he joined the Shenzhen Institute of Advanced Technology, CAS, as an Assistant Professor. His current research interests include multiview video coding, video object segmentation, and content-based video processing."]}}, {"name": "Debin Zhao", "affiliation": "Department of Computer Science, Harbin Institute of Technology, Harbin, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6019031/6019031-photo-5-small.gif", "p": ["Debin Zhao received the B.S., M.S., and Ph.D. degrees in computer science from the Harbin Institute of Technology, Harbin, China, in 1985, 1988, and 1998, respectively.", "From 1989 to 1993, he was a Research Fellow with the Department of Computer Science, City University of Hong Kong, Kowloon, Hong Kong. Currently, he is a Professor with the Department of Computer Science, Harbin Institute of Technology. He has published two books and over 60 scientific papers. His current research interests include data compression, image processing, and human–machine interface."]}}, {"name": "Wen Gao", "affiliation": "School of Electronics Engineering and Computer Science, Peking University, Beijing, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6019031/6019031-photo-6-small.gif", "p": ["Wen Gao (F'08) received the M.S. degree in computer science from the Harbin Institute of Technology, Harbin, China, in 1985, and the Ph.D. degree in electronics engineering from the University of Tokyo, Tokyo, Japan, in 1991.", "He was a Professor of computer science with the Harbin Institute of Technology from 1991 to 1995 and with the Institute of Computing Technology, Chinese Academy of Sciences, Beijing, China, from 1996 to 2005. He is currently a Professor with the School of Electronics Engineering and Computer Science, Peking University, Beijing, China. His current research interests include developing systems and technologies for video coding, face recognition, sign language recognition and synthesis, and multimedia retrieval. He has published four books and over 500 technical articles in refereed journals and proceedings in the areas of signal processing, image and video communication, computer vision, multimodal interface, pattern recognition, and bioinformatics.", "Dr. Gao received several awards including five national awards for his research achievements and activities. He was the General Co-Chair of the IEEE ICME07, and the Head of the Chinese Delegation to the Moving Picture Expert Group of International Standard Organization. Since 1997, he has been the Chairman of the working group responsible for setting a national Audio Video Coding Standard for China."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Transcoding", "Bit rate", "Streaming media", "Quantization", "Visualization", "Algorithm design and analysis"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video coding", "computational complexity", "transcoding"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["computational complexity", "universal rate control scheme", "video transcoding", "bitrate adaption", "video format conversion", "video streaming application", "rate-distortion model", "smooth visual quality", "compliant buffer constraint", "two-pass R-D model", "sliding window buffer control strategy"]}, {"type": "Author Keywords ", "kwd": ["window-level rate control", "Bitrate adaption", "rate control", "video transcoding"]}],"citations":[{"ieee-citations":[{"authors":["Xu Wang","Sam Kwong","Long Xu","Yun Zhang"],"article name":"Generalized Nash Bargaining Solution to Rate Control Optimization for Spatial Scalable Video Coding","Journal Name":"Image Processing IEEE Transactions on","vol.": "23","pp.": "4010-4021","Year": "2014","ISSN": "1057-7149","ISBN":"none"},{"authors":["Yichao Jin","Yonggang Wen","Cedric Westphal"],"article name":"Optimal Transcoding and Caching for Adaptive Streaming in Media Cloud: an Analytical Approach","Journal Name":"Circuits and Systems for Video Technology IEEE Transactions on","vol.": "25","pp.": "1914-1925","Year": "2015","ISSN": "1051-8215","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Mohammad H. Hajiesmaili","Ahmad Khonsari","Ali Sehati","Mohammad Sadegh Talebi"],"article name":"Content-aware rate allocation for efficient video streaming via dynamic network utility maximization","Journal Name":"Journal of Network and Computer Applications","vol.": "35","pp.": "2016","Year": "2012","ISSN": "10848045","ISBN":"none"},{"authors":["Maria Pantoja","Nam Ling","Hari Kalva","Jae-Beom Lee"],"article name":"An efficient VC-1 to H.264 IPB-picture transcoder with pixel domain processing","Journal Name":"Multidimensional Systems and Signal Processing","vol.": "26","pp.": "555","Year": "2015","ISSN": "0923-6082","ISBN":"none"},{"authors":["Bo-Hao Chen","Shih-Chia Huang"],"article name":"Probabilistic neural networks based moving vehicles extraction algorithm for intelligent traffic surveillance systems","Journal Name":"Information Sciences","vol.": "299","pp.": "283","Year": "2015","ISSN": "00200255","ISBN":"none"}]}]}