{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 7, "citationCountPatent": 0, "totalDownloads": 578},"doi": "10.1109/TCSVT.2012.2190471","title": "Matching of Tracked Pedestrians Across Disjoint Camera Views Using CI-DLBP","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "Matching pedestrians across disjoint camera views is a challenging task, since their observations are separated in time and space and their appearances may vary considerably. Recently, some approaches of matching pedestrians have been proposed. However, these approaches either used too complex representations or only considered the color information and discarded the spatial structural information of the pedestrian. In order to describe the spatial structural information in color space, we propose a distance-based local binary pattern (DLBP) descriptor. Besides the spatial structural information, the color itself namely its intensity value is also an important feature in matching pedestrians across disjoint camera views. In order to effectively combine these two kinds of information, we further propose a novel CI_DLBP descriptor, which unifies the color intensity and DLBP by learning the joint distributions (2-D histograms) of the DLBP and color intensity at each channel. In addition, different from the previous approaches in which the pedestrians matching is based on their whole bodies, we develop a part-based pedestrian representation because the color density and spatial structural information between the upper outer garment and the lower garment worn by the pedestrian is usually different. Experimental results on challenging realistic scenarios and VIPeR dataset validate the proposed DLBP operator, the CI_DLBP descriptor, and the part-based pedestrian representation for pedestrian matching across disjoint camera views. Compared with existing methods based on color information, this new CI_DLBP approach performs better.","authors": [{"name": "Guoyun Lian", "affiliation": "School of Information Science and Technology, Sun Yat-sen University, Guangzhou, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6166869/6166869-photo-1-small.gif", "p": ["Guoyun Lian (S'10) received the M.Sc. degree in computer science from the Kunming University of Science and Technology, Kunming, China, in 2008, and the Ph.D. degree in information science and technology from Sun Yat-sen University, Guangzhou, China, in 2011.", "He is currently with the School of Information Science and Technology, Sun Yat-sen University. His current research interests include computer vision, pattern recognition, digital image processing and analysis, visual surveillance."]}}, {"name": "Jian-Huang Lai", "affiliation": "School of Information Science and Technology, Sun Yat-sen University, Guangzhou, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6166869/6166869-photo-2-small.gif", "p": ["Jian-Huang Lai (M'10) received the M.Sc. degree in applied mathematics in 1989 and the Ph.D. degree in mathematics in 1999, both from Sun Yat-sen University, Guangzhou, China.", "He joined Sun Yat-sen University as an Assistant Professor in 1989, where he is currently a Professor with the Department of Automation, School of Information Science and Technology, and the Vice Dean of the School of Information Science and Technology. He has published over 80 scientific papers in international journals and conferences on image processing and pattern recognition, e.g., IEEE Transactions on Neural Networks, IEEE Transactions on Image Processing, IEEE Transactions on Systems, Man, and Cybernetics Part B, Pattern Recognition, ICCV, CVPR, and ICDM. His current research interests include digital image processing, pattern recognition, multimedia communications, wavelet and its applications.", "Dr. Lai serves as a Standing Member of the Image and Graphics Association of China and as the Standing Director of the Image and Graphics Association of Guangdong."]}}, {"name": "Ching Y. Suen", "affiliation": "Center for Pattern Recognition and Machine Intelligence, Concordia University, Montreal, Canada", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6166869/6166869-photo-3-small.gif", "p": ["Ching Y. Suen (M'66–SM'78–F'86–LF'08) received the M.Sc. degree in engineering from the University of Hong Kong, Pokfulam, Hong Kong, and the Ph.D. degree from the University of British Columbia, Vancouver, BC, Canada.", "He is currently the Director of the Center for Pattern Recognition and Machine Intelligence, Concordia University, Montreal, QC, Canada, and the Concordia Chair on artificial intelligence and pattern recognition. He has guided and hosted 80 visiting scientists and professors, and has supervised 82 doctoral and masters graduates. His publications include four conference proceedings, 12 books, and more than 480 papers of which many have been widely cited.", "Dr. Suen is a Fellow of the IAPR and the Academy of Sciences of the Royal Society of Canada. Currently, he is the Editor-in-Chief of the journal Pattern Recognition and an Advisory or Associate Editor of four other journals. He has founded and organized numerous international conferences on pattern recognition, handwriting recognition, and document analysis. He has also founded the IAPR ICDAR Awards. He has served numerous professional societies as the President, Vice-President, Governor, and Director. He has given 180 invited talks at various industries and academic institutions worldwide, and has been the Principal Investigator or Consultant of 30 industrial projects."]}}, {"name": "Pei Chen", "affiliation": "School of Information Science and Technology, Sun Yat-sen University, Guangzhou, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6166869/6166869-photo-4-small.gif", "p": ["Pei Chen received two Ph.D. degrees in wavelets and computer vision from Shanghai Jiaotong University, Shanghai, China, and Monash University, Melbourne, Australia, in 2001 and 2004, respectively.", "He is currently a Professor with the School of Information Science and Technology, Sun Yat-sen University, Guangzhou, China. He was a Post-Doctoral Researcher with Monash University, a Senior Research Engineer with Motorola Labs, Shanghai, and a Research Professor with SIAT/CAS, Shenzhen, China. His current research interests include topics in computer vision and machine learning."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Image color analysis", "Histograms", "Cameras", "Color", "Brightness", "Pattern recognition", "Pedestrian matching"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["pedestrians", "cameras", "image colour analysis", "image matching", "image representation", "object tracking"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["part-based pedestrian representation", "tracked pedestrian matching", "disjoint camera views", "CI-DLBP", "color information", "spatial structural information", "color space", "distance-based local binary pattern descriptor", "CI-DLBP descriptor", "color intensity", "2D histograms", "joint distributions", "upper outer garment", "lower garment", "VIPeR dataset"]}, {"type": "Author Keywords ", "kwd": ["pedestrian matching", "CI_DLBP descriptor", "disjoint camera views", "distance-based local binary pattern (DLBP) operator", "part-based pedestrian representation"]}],"citations":[{"ieee-citations":[{"authors":["Syed Fahad Tahir","Andrea Cavallaro"],"article name":"Cost-Effective Features for Reidentification in Camera Networks","Journal Name":"Circuits and Systems for Video Technology IEEE Transactions on","vol.": "24","pp.": "1362-1374","Year": "2014","ISSN": "1051-8215","ISBN":"none"},{"authors":["Yimin Wang","Ruimin Hu","Chao Liang","Chunjie Zhang","Qingming Leng"],"article name":"Camera Compensation Using a Feature Projection Matrix for Person Reidentification","Journal Name":"Circuits and Systems for Video Technology IEEE Transactions on","vol.": "24","pp.": "1350-1361","Year": "2014","ISSN": "1051-8215","ISBN":"none"},{"authors":["Syed Fahad Tahir","Andrea Cavallaro","Bernhard Rinner"],"article name":"Re-identification with multiple source-cameras","Journal Name":"Intelligent Sensors Sensor Networks and Information Processing (ISSNIP) 2015 IEEE Tenth International Conference on","vol":"none","pp.": "1-6","Year": "2015","ISSN":"none","ISBN":"none"},{"authors":["Hua-Tsung Chen","Ming-Chu Chu","Chien-Li Chou","Suh-Yin Lee","Bao-Shuh Lin"],"article name":"Multi-camera vehicle identification in tunnel surveillance system","Journal Name":"Multimedia & Expo Workshops (ICMEW) 2015 IEEE International Conference on","vol":"none","pp.": "1-6","Year": "2015","ISSN":"none","ISBN":"none"},{"authors":["Jun-Wei Hsieh","Li-Chih Chen","Sin-Yu Chen","Duan-Yu Chen","Salah Alghyaline","Hui-Fen Chiang"],"article name":"Vehicle Color Classification Under Different Lighting Conditions Through Color Correction","Journal Name":"Sensors Journal IEEE","vol.": "15","pp.": "971-983","Year": "2015","ISSN": "1530-437X","ISBN":"none"},{"authors":["Di-Kai Yang","Pau-Choo Chung","Chun-Rong Huang"],"article name":"Unsupervised path modeling across multiple cameras with disjoint views for foreground object tracking","Journal Name":"Information Science Electronics and Electrical Engineering (ISEEE) 2014 International Conference on","vol.": "2","pp.": "1161-1165","Year": "2014","ISSN":"none","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Shi-Chang Shi","Chun-Chao Guo","Jian-Huang Lai","Shi-Zhe Chen","Xiao-Jun Hu"],"article name":"Person re-identification with multi-level adaptive correspondence models","Journal Name":"Neurocomputing","vol.": "168","pp.": "550","Year": "2015","ISSN": "09252312","ISBN":"none"}]}]}