{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 16, "citationCountPatent": 0, "totalDownloads": 1249},"doi": "10.1109/TCSVT.2012.2190476","title": "Object Detection From Videos Captured by Moving Camera by Fuzzy Edge Incorporated Markov Random Field and Local Histogram Matching","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "In this paper, we put forward a novel region matching-based motion estimation scheme to detect objects with accurate boundaries from videos captured by moving camera. Here, a fuzzy edge incorporated Markov random field (MRF) model is considered for spatial segmentation. The algorithm is able to identify even the blurred boundaries of objects in a scene. Expectation Maximization algorithm is used to estimate the MRF model parameters. To reduce the complexity of searching, a new scheme is proposed to get a rough idea of maximum possible shift of objects from one frame to another by finding the amount of shift in positions of the centroid. We propose a &#x03C7;<sup>2</sup>-test-based local histogram matching scheme for detecting moving objects from complex scenes from low illumination environment and objects that change size from one frame to another. The proposed scheme is successfully applied for detecting moving objects from video sequences captured in both real-life and controlled environments. It is also noticed that the proposed scheme provides better results with less object background misclassification as compared to existing techniques.","authors": [{"name": "Ashish Ghosh", "affiliation": "Machine Intelligence Unit, Indian Statistical Institute, Kolkata, India", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6255841/6166868/6166868-photo-1-small.gif", "p": ["Ashish Ghosh (M'09) is currently a Professor with the Machine Intelligence Unit, Indian Statistical Institute, Kolkata, India. He has published more than 150 research papers in internationally reputed journals and refereed conferences, and has edited eight books. His current research interests include pattern recognition and machine learning, data mining, image analysis, remotely-sensed image analysis, video image analysis, soft computing, fuzzy sets and uncertainty analysis, neural networks, evolutionary computation, and bioinformatics.", "Dr. Ghosh received the prestigious and most coveted Young Scientists Award in Engineering Sciences from the Indian National Science Academy in 1995 and in Computer Science from the Indian Science Congress Association in 1992. He was selected as an Associate of the Indian Academy of Sciences, Bangalore, India, in 1997. He is a member of the Founding Team that established the National Center for Soft Computing Research at the Indian Statistical Institute, in 2004, with funding from the Department of Science and Technology, Government of India, and is currently the In-Charge of the center. He is a member of editorial boards of various international journals."]}}, {"name": "Badri Narayan Subudhi", "affiliation": "Machine Intelligence Unit, Indian Statistical Institute, Kolkata, India", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6255841/6166868/6166868-photo-2-small.gif", "p": ["Badri Narayan Subudhi (S'07) received the B.E. degree in electronics and telecommunications from the Biju Patnaik University of Technology, Bhubaneshwar, India, in 2004, and the M.Tech. degree in electronics and system communications from the National Institute of Technology, Rourkela, India, in 2009.", "He is currently a Research Scholar with the Machine Intelligence Unit, Indian Statistical Institute, Kolkata, India, with financial support from the Council of Scientific and Industrial Research Scheme. He was a Visiting Scientist with the University of Trento, Trento, Italy, from August 2010 to February 2011. His current research interests include video processing, image processing, machine learning, pattern recognition, and remote sensing image analysis."]}}, {"name": "Susmita Ghosh", "affiliation": "Department of Computer Science and Engineering, Jadavpur University, Kolkata, India", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6255841/6166868/6166868-photo-3-small.gif", "p": ["Susmita Ghosh received the B.Sc. (hons.) degree in physics and the B.Tech. degree in computer science and engineering from the University of Calcutta, Kolkata, India, in 1988 and 1991, respectively, the M.Tech. degree in computer science and engineering from the Indian Institute of Technology Bombay, Mumbai, India, in 1993, and the Ph.D. degree in engineering from Jadavpur University, Kolkata, in 2004.", "She has visited various universities and academic institutes for collaborative research and international projects and has delivered lectures in different countries, including Australia, China, Italy, Japan, and the U.S. She has published many research papers in internationally reputed journals and referred conferences, and has edited three books. She has been a Lecturer and a Reader with the Department of Computer Science and Engineering, Jadavpur University, since 1997. She is currently an Associate Professor with the same department. Her current research interests include genetic algorithms, neural networks, image processing, pattern recognition, soft computing, and remotely-sensed image analysis."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Image edge detection", "Image segmentation", "Videos", "Object detection", "Kernel", "Histograms", "Cameras"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video cameras", "expectation-maximisation algorithm", "fuzzy systems", "image matching", "image segmentation", "Markov processes", "motion estimation", "object detection"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["object background misclassification", "moving object detection", "video sequences", "moving camera", "local histogram matching", "region matching", "motion estimation", "fuzzy edge incorporated Markov random field", "spatial segmentation", "blurred boundaries", "expectation maximization", "complex scenes", "low illumination environment", "real-life environment", "controlled environment"]}, {"type": "Author Keywords ", "kwd": ["motion analysis", "Edge analysis", "fuzzy sets", "image segmentation", "maximum a posteriori probability estimation"]}],"citations":[{"ieee-citations":[{"authors":["Ashish Ghosh","Badri Narayan Subudhi","Lorenzo Bruzzone"],"article name":"Integration of Gibbs Markov Random Field and Hopfield-Type Neural Networks for Unsupervised Change Detection in Remotely Sensed Multitemporal Images","Journal Name":"Image Processing IEEE Transactions on","vol.": "22","pp.": "3087-3096","Year": "2013","ISSN": "1057-7149","ISBN":"none"},{"authors":["Yan-Tsung Peng","Bing-Chuan Tsai","Shanq-Jang Ruan"],"article name":"A Sub-Image Edge Preservation method for histogram equalization","Journal Name":"Information Communications and Signal Processing (ICICS) 2013 9th International Conference on","vol":"none","pp.": "1-4","Year": "2013","ISSN":"none","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Badri Narayan Subudhi","Susmita Ghosh","Sung-Bae Cho","Ashish Ghosh"],"article name":"Integration of fuzzy Markov random field and local information for separation of moving objects and shadows","Journal Name":"Information Sciences","vol.": "331","pp.": "15","Year": "2016","ISSN": "00200255","ISBN":"none"},{"authors":["Wu-Chih Hu","Chao-Ho Chen","Yi-Jen Su","Tzu-Hsing Chang"],"article name":"Feature-based real-time video stabilization for vehicle video recorder system","Journal Name":"Multimedia Tools and Applications","vol":"none","pp.":"none","Year": "2017","ISSN": "1380-7501","ISBN":"none"},{"authors":["Wu-Chih Hu","Chao-Ho Chen","Tsong-Yi Chen","Deng-Yuan Huang","Zong-Che Wu"],"article name":"Moving object detection and tracking from video captured by moving camera","Journal Name":"Journal of Visual Communication and Image Representation","vol.": "30","pp.": "164","Year": "2015","ISSN": "10473203","ISBN":"none"},{"authors":["Yong Chen","Rong-Hua Zhang","Lei Shang","Eric Hu"],"article name":"Object detection and tracking with active camera on motion vectors of feature points and particle filter","Journal Name":"Review of Scientific Instruments","vol.": "84","pp.": "065109","Year": "2013","ISSN": "00346748","ISBN":"none"},{"authors":["Yong Chen","Rong hua Zhang","Lei Shang","Jie Tian"],"article name":"A Novel Method of Object Detection from a Moving Camera Based on Image Matching and Frame Coupling","Journal Name":"PLoS ONE","vol.": "9","pp.": "e109809","Year": "2014","ISSN": "1932-6203","ISBN":"none"},{"authors":["Paul Yanne","Jifeng Ning","Shuqin Yang","Wuzhen Shi"],"article name":"Improved appearance updating method in multiple instance learning tracking","Journal Name":"IET Computer Vision","vol.": "8","pp.": "118","Year": "2014","ISSN": "1751-9632","ISBN":"none"},{"authors":["Badri Narayan Subudhi","Susmita Ghosh","Ashish Ghosh"],"article name":"Application of Gibbs–Markov random field and Hopfield-type neural networks for detecting moving objects from video sequences captured by static camera","Journal Name":"Soft Computing","vol":"none","pp.":"none","Year": "2014","ISSN": "1432-7643","ISBN":"none"},{"authors":["Sandeep Singh Sengar","Susanta Mukhopadhyay"],"article name":"Foreground Detection via Background Subtraction and Improved Three-Frame Differencing","Journal Name":"Arabian Journal for Science and Engineering","vol":"none","pp.":"none","Year": "2017","ISSN": "2193-567X","ISBN":"none"},{"authors":["Ming Hao","Wenzhong Shi","Kazhong Deng","Hua Zhang"],"article name":"A contrast-sensitive Potts model custom-designed for change detection","Journal Name":"European Journal of Remote Sensing","vol.": "47","pp.": "643","Year": "2014","ISSN": "2279-7254","ISBN":"none"},{"authors":["Ajoy Mondal","Susmita Ghosh","Ashish Ghosh"],"article name":"Efficient silhouette-based contour tracking using local information","Journal Name":"Soft Computing","vol":"none","pp.":"none","Year": "2014","ISSN": "1432-7643","ISBN":"none"},{"authors":["Allah Bux","Plamen Angelov","Zulfiqar Habib"],"Article Name":"none","Journal Name":"Advances in Intelligent Systems and Computing","vol.": "513","pp.": "341","Year": "2017","ISSN": "2194-5357","ISBN": "978-3-319-46561-6"},{"authors":["K. Kalirajan","M. Sudha"],"article name":"Moving Object Detection for Video Surveillance","Journal Name":"The Scientific World Journal","vol.": "2015","pp.": "1","Year": "2015","ISSN": "2356-6140","ISBN":"none"},{"authors":["Badri Narayan Subudhi","Susmita Ghosh","Simon C.K. Shiu","Ashish Ghosh"],"article name":"Statistical feature bag based background subtraction for local change detection","Journal Name":"Information Sciences","vol.": "366","pp.": "31","Year": "2016","ISSN": "00200255","ISBN":"none"},{"authors":["Wei Gu","Zhihan Lv","Ming Hao"],"article name":"Change detection method for remote sensing images based on an improved Markov random field","Journal Name":"Multimedia Tools and Applications","vol":"none","pp.":"none","Year": "2015","ISSN": "1380-7501","ISBN":"none"}]}]}