{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 2, "citationCountPatent": 0, "totalDownloads": 595},"doi": "10.1109/TCSVT.2012.2190477","title": "Inter Frame Video Compression With Large Dictionaries of Tilings: Algorithms for Tiling Selection and Entropy Coding","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "We propose the use of large tree-structured dictionaries of tilings for video compression. Our first contribution is the construction of a rate-distortion cost function that admits fast search algorithms to select the optimal tiling for the motion compensation stage of a video coder. The computation of the cost is enabled through novel algorithms to approximate the bit rate and the distortion. Our second contribution is an efficient arithmetic coding algorithm to encode the selected tree-structured tiling. We illustrate the effectiveness of our approach by showing that a H.264/AVC-like video coder utilizing one of the proposed tiling selection methods results in up to 16% savings in bit rate for several standard video sequences as compared to H.264/AVC. This is accomplished with only a modest increase in the computation time at the encoder.","authors": [{"name": "Kai-Lung Hua", "affiliation": "National Taiwan University of Science and Technology, Taipei, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6255841/6166871/6166871-photo-1-small.gif", "p": ["Kai-Lung Hua received the B.S. degree in electrical engineering from National Tsing Hua University, Hsinchu, Taiwan, in 2000, the M.S. degree in communication engineering from National Chiao Tung University, Hsinchu, in 2002, and the Ph.D. degree from the School of Electrical and Computer Engineering, Purdue University, West Lafayette, IN, in 2010.", "Since 2009, he has been with the National Taiwan University of Science and Technology, Taipei, Taiwan, where he is currently an Assistant Professor with the Department of Computer Science and Information Engineering. His current research interests include digital image and video processing, computer vision, and multimedia networking.", "Dr. Hua is a member of Eta Kappa Nu and Phi Tau Phi."]}}, {"name": "Rong Zhang", "affiliation": "Qualcomm, Inc., San Diego, CA, USA", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6255841/6166871/6166871-photo-2-small.gif", "p": ["Rong Zhang received the B.E. degree from the University of Science and Technology of China, Hefei, China, in 2003, the M.Eng. degree from the National University of Singapore, Singapore, in 2005, and the Ph.D. degree from the School of Electrical and Computer Engineering, Purdue University, West Lafayette, IN, in 2009.", "Since January 2010, she has been a Senior Engineer with Qualcomm, Inc., San Diego, CA. Her current research interests include image and video compression, video analysis, signal processing, and computer vision."]}}, {"name": "Mary Comer", "affiliation": "Purdue University, West Lafayette, IN, USA", "bio": {"p": ["Mary Comer received the B.S.E.E., M.S., and Ph.D. degrees from Purdue University, West Lafayette, IN.", "From 1995 to 2005, she was with Thomson, Carmel, IN. She is currently an Associate Professor with the School of Electrical and Computer Engineering, Purdue University. Her current research interests include video coding, image segmentation, and analysis of microscope imagery.", "Dr. Comer is currently an Associate Editor of the IEEE Transactions on Image Processing. She was the Program Chair for the 2009 Picture Coding Symposium, Chicago, IL, and also for the 2010 IEEE Southwest Symposium on Image Analysis (SSIAI), Dallas, TX. She is the General Chair of SSIAI in 2012. She has been recently elected to serve on the IEEE Image, Video, and Multidimensional Signal Processing Technical Committee. She received the DARPA Young Faculty Award in 2009."]}}, {"name": "Ilya Pollak", "affiliation": "Purdue University, West Lafayette, IN, USA", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6255841/6166871/6166871-photo-4-small.gif", "p": ["Ilya Pollak received the B.S. and M.Eng. degrees in 1995 and the Ph.D. degree in 1999, all in electrical engineering from the Massachusetts Institute of Technology, Cambridge.", "From 1999 to 2000, he was a Post-Doctoral Researcher with the Division of Applied Mathematics, Brown University, Providence, RI. Since 2000, he has been with Purdue University, West Lafayette, IN, where he is currently an Associate Professor of electrical and computer engineering. His current research interests include signal and image processing and financial engineering.", "Dr. Pollak received the CAREER Award from the National Science Foundation in 2001. He received the Eta Kappa Nu Outstanding Faculty Award in 2002 and 2007, and the Chicago-Area Alumni Young Faculty Award in 2003. He was a Lead Guest Editor of the IEEE Signal Processing Magazine Special Issue on Signal Processing for Financial Applications which appeared in September 2011. He has been the Co-Chair of the SPIE/IS&T Conference on Computational Imaging."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Dictionaries", "Vectors", "Bismuth", "Encoding", "Motion compensation", "Cost function", "Prediction algorithms"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video coding", "arithmetic codes", "computational complexity", "data compression", "entropy codes", "image sequences", "motion compensation", "search problems"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["entropy coding", "interframe video compression", "tree-structured dictionaries", "rate-distortion cost function", "fast search algorithms", "motion compensation stage", "arithmetic coding algorithm", "H.264-AVC-like video coder", "tiling selection methods", "bit rate", "standard video sequences", "computation time"]}, {"type": "Author Keywords ", "kwd": ["tree-structured dictionaries", "H.264/AVC", "motion compensation"]}],"citations":[{"ieee-citations":[{"authors":["You-Hsiang Hsu","Yeni Anistyasari","Yi-Hui Chen","Kai-Lung Hua"],"article name":"A novel robust data hiding scheme for image authentication","Journal Name":"Multimedia and Broadcasting (APMediaCast) 2015 Asia Pacific Conference on","vol":"none","pp.": "1-6","Year": "2015","ISSN":"none","ISBN":"none"}]},{"nonieee-citations":[{"authors":["L. Arun Raj","Dhananjay Kumar","H. Iswarya","S. Aparna","A. Srinivasan"],"article name":"Adaptive video streaming over HTTP through 4G wireless networks based on buffer analysis","Journal Name":"EURASIP Journal on Image and Video Processing","vol.": "2017","pp.":"none","Year": "2017","ISSN": "1687-5281","ISBN":"none"}]}]}