{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 34, "citationCountPatent": 1, "totalDownloads": 1833},"doi": "10.1109/TCSVT.2011.2148450","title": "Fast Motion Estimation System Using Dynamic Models for H.264/AVC Video Coding","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "H.264/AVC offers many coding tools for achieving high compression gains of up to 50% more than other standards. These tools dramatically increase the computational complexity of the block based motion estimation (BB-ME) which consumes up to 80% of the entire encoder's computations. In this paper, computationally efficient accurate skipping models are proposed to speed up any BB-ME algorithm. First, an accurate initial search center (ISC) is decided using a smart prediction technique. Thereafter, a dynamic early stop search termination (DESST) is used to decide if the block at the ISC position can be considered as a best match candidate block or not. If the DESST algorithm fails, a less complex style of the motion estimation algorithm which incorporates dynamic padding window size technique will be used. Further reductions in computations are achieved by combining the following two techniques. First, a dynamic partial internal stop search technique which utilizes an accurate adaptive threshold model is exploited to skip the internal sum of absolute difference operations between the current and the candidate blocks. Second, a dynamic external stop search technique greatly reduces the unnecessary operations by skipping all the irrelevant blocks in the search area. The proposed techniques can be incorporated in any block matching motion estimation algorithm. Computational complexity reduction is reflected in the amount of savings in the motion estimation encoding time. The novelty of the proposed techniques comes from their superior saving in computations with an acceptable degradation in both peak signal-to-noise ratio (PSNR) and bit-rate compared to the state of the art and the recent motion estimation techniques. Simulation results using H.264/AVC reference software (JM 12.4) show up to 98% saving in motion estimation time using the proposed techniques compared to the conventional full search algorithm with a negligible degradation in the PSNR by approximately 0.05 dB and a small increase in the required bits per frame by only 2%. Experimental results also prove the effectiveness of the proposed techniques if they are incorporated with any fast BB-ME technique such as fast extended diamond enhanced predictive zonal search and predictive motion vector field adaptive search technique.","authors": [{"name": "Yasser Ismail", "affiliation": "Department of Electronics and Communications, Faculty of Engineering, Mansoura University, Mansoura, Egypt", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6121964/5756652/5756652-photo-1-small.gif", "p": ["Yasser Ismail received the B.S. degree in electronics and communications engineering from Mansoura University, Mansoura, Egypt, in 1999, the M.S. degree in electrical communications from Mansoura University in 2002, the M.S. degree in computer engineering from the University of Louisiana at Lafayette, Lafayette, in 2007, and the Ph.D. degree from the University of Louisiana at Lafayette in May 2010.", "He is currently with the University College in Lieth, Makkah, Saudi Arabia. His current research interests include wireless and digital communication systems, algorithms, and very large scale integration architectures for video processing.", "Dr. Ismail was the third place winner in the Student Paper Contest at the University of Louisiana at Lafayette in 2008 and 2009. He has served as a reviewer for several conferences and journals."]}}, {"name": "Jason B. McNeely", "affiliation": "Alaska University, Fairbanks, AK, USA", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6121964/5756652/5756652-photo-2-small.gif", "p": ["Jason B. McNeely received the B.S. degree in electrical engineering and the M.S. degree in computer engineering from the University of Louisiana at Lafayette, Lafayette, in 2001 and 2003, respectively.", "He is currently an Assistant Professor with Alaska University, Fairbanks. His current research interests include video compression and low-power very large scale integration design."]}}, {"name": "Mohsen Shaaban", "affiliation": "University of Louisiana at Lafayette, Lafayette, LA, USA", "bio": {"p": ["Hanan Mahmoud received the Ph.D. degree from the University of Louisiana, Lafayette, in 2001.", "Since then, she has been an Assistant Professor with the University of Alexandria, Alexandria, Egypt, and is an Assistant Professor with King Saud University, Riyadh, Saudi Arabia. She is the Coordinator of the Research Unit, Department of Information Technology, College of Computer and Information Sciences, King Saud University. She is very active in research, and has published more than 40 papers in the field of video processing and very large-scale integration.", "Dr. Mahmoud was awarded five grants in the last four years."]}}, {"name": "Hanan Mahmoud", "affiliation": "Research Unit, Department of Information Technology, College of Computer and Information Sciences, King Saud University, Riyadh, Saudi Arabia", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6121964/5756652/5756652-photo-4-small.gif", "p": ["Mohsen Shaaban received the B.S. degree in electrical and communications engineering from the University of Alexandria, Alexandria, Egypt, in 1998, the M.S. degree in the field of computer engineering from the University of Louisiana at Lafayette (ULL), Lafayette, in 2003, and the Ph.D. degree from the ULL in December 2009.", "During his stay with ULL, he has been a Teaching and Research Assistant with the Center for Advanced Computer Studies, VLSI Research Laboratory. He was involved with the ULL IEEE student chapter activities. His current research interests include digital application-specific integrated circuit very-large-scale integration circuit design, computer-aided design tools and digital video processing with particular interest in video compression algorithms and architectures, and heterogeneous video transcoding for lower bit-rate applications and devices."]}}, {"name": "Magdy A. Bayoumi", "affiliation": "University of Louisiana at Lafayette, Lafayette, LA, USA", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6121964/5756652/5756652-photo-5-small.gif", "p": ["Magdy A. Bayoumi is currently the Faculty Advisor for the IEEE Computer Student Chapter with the University of Louisiana at Lafayette, Lafayette.", "He received the University of Louisiana at Lafayette 1988 Researcher of the Year Award and the 1993 Distinguished Professor Award. He was an Associate Editor of the IEEE Circuits and Devices Magazine, the IEEE Transactions on Very Large Scale Integration (VLSI) Systems, the IEEE Transactions on Neural Networks, and the IEEE Transactions on Circuits and Systems—II: Analog and Digital Signal Processing. He was an Associate Editor of the IEEE Circuits and Devices Magazine and is currently an Associate Editor of Integration, the VLSI Journal, and the Journal of VLSI Signal Processing Systems. He is a Regional Editor for the VLSI Design Journal and on the Advisory Board of the Journal on Microelectronics Systems Integration. From 1991 to 1994, he served on the Distinguished Visitors Program for the IEEE Computer Society, and he is on the Distinguished Lecture Program of the Circuits and Systems Society. He was the Vice President for technical activities of the IEEE Circuits and Systems Society. He was the Co-Chairman of the Workshop on Computer Architecture for Machine Perception in 1993, and is a member of the Steering Committee of this workshop. He was the General Chairman of the 1994 MWSCAS and is a member of the Steering Committee of this symposium. He was the General Chairman for the 8th Great Lake Symposium on VLSI in 1998. He has been on the Technical Program Committee for ISCAS for several years and was the Publication Chair for ISCAS'99. He was also the General Chairman of the 2000 Workshop on Signal Processing Design and Implementation. He was a founding member of the VLSI Systems and Applications Technical Committee and was its Chairman. He is currently the Chairman of the Technical Committee on Circuits and Systems for Communication and the Technical Committee on Signal Processing Design and Implementation. He is a member of the Neural Network and the Multimedia Technology Technical Committees."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Motion estimation", "Heuristic algorithms", "Computational complexity", "Mathematical model", "Pixel", "Video sequences", "PSNR"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video coding", "computational complexity", "motion estimation"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["block matching motion estimation", "fast motion estimation system", "dynamic models", "H.264/AVC video coding", "computational complexity", "block based motion estimation", "skipping models", "initial search center", "smart prediction technique", "dynamic early stop search termination", "dynamic padding window size technique", "dynamic partial internal stop search technique", "adaptive threshold model", "dynamic external stop search technique"]}, {"type": "Author Keywords ", "kwd": ["pixel domain motion estimation", "Fast motion estimation", "H.264/AVC"]}],"citations":[{"ieee-citations":[{"authors":["Nana Shan","Wei Zhou","Zhemin Duan","Henglu Wei"],"article name":"A Fast Coding Unit Depth Decision Algorithm for HEVC Inter Prediction","Journal Name":"Frontier of Computer Science and Technology (FCST) 2015 Ninth International Conference on","vol":"none","pp.": "316-320","Year": "2015","ISSN":"none","ISBN":"none"},{"authors":["Mallesham Dasari","Himanshu Sindhwal","Naresh Vattikuti"],"article name":"Efficient content-based dynamic search algorithm for motion estimation from videos","Journal Name":"Advances in Computing Communications and Informatics (ICACCI 2014 International Conference on","vol":"none","pp.": "1004-1008","Year": "2014","ISSN":"none","ISBN":"none"},{"authors":["Shaifali Madan Arora","Navin Rajpal"],"article name":"Survey of fast block motion estimation algorithms","Journal Name":"Advances in Computing Communications and Informatics (ICACCI 2014 International Conference on","vol":"none","pp.": "2022-2026","Year": "2014","ISSN":"none","ISBN":"none"},{"authors":["Xiangbo Li","Mohsen Amini Salehi","Magdy Bayoumi","Rajkumar Buyya"],"article name":"CVSS: A Cost-Efficient and QoS-Aware Video Streaming Using Cloud Services","Journal Name":"Cluster Cloud and Grid Computing (CCGrid) 2016 16th IEEE/ACM International Symposium on","vol":"none","pp.": "106-115","Year": "2016","ISSN":"none","ISBN":"none"},{"authors":["Yufeng Li","Jufei Xiao","Wei Wu"],"article name":"Motion estimation based on H.264 video coding","Journal Name":"Image and Signal Processing (CISP) 2012 5th International Congress on","vol":"none","pp.": "104-108","Year": "2012","ISSN":"none","ISBN":"none"},{"authors":["Karam Singh","Shaik Rafi Ahamed"],"article name":"A new Motion Estimation algorithm for high efficient video coding standard","Journal Name":"India Conference (INDICON) 2015 Annual IEEE","vol":"none","pp.": "1-5","Year": "2015","ISSN": "2325-9418","ISBN":"none"},{"authors":["K C Ravi Chandra Varma","Venkata Phani Kumar M","Sudipta Mahapatra"],"article name":"A low complexity block matching algorithm for fast motion estimation in High Efficiency Video Coding","Journal Name":"Computer Vision Pattern Recognition Image Processing and Graphics (NCVPRIPG) 2015 Fifth National Conference on","vol":"none","pp.": "1-4","Year": "2015","ISSN":"none","ISBN":"none"},{"authors":["Johan De Praeter","Glenn Van Wallendael","rgen Slowack","Peter Lambert"],"article name":"Video Encoder Architecture for Low-Delay Live-Streaming Events","Journal Name":"Multimedia IEEE Transactions on","vol.": "19","pp.": "2252-2266","Year": "2017","ISSN": "1520-9210","ISBN":"none"},{"authors":["Pao-Sheng Chouy","Nuwan Ferdinandy","Ihab Amer","Stark Drapery"],"article name":"Hardware-aware motion estimation via low-resolution motion hints","Journal Name":"Information Theory (CWIT) 2017 15th Canadian Workshop on","vol":"none","pp.": "1-5","Year": "2017","ISSN":"none","ISBN":"none"},{"authors":["Shaifali M. Arora","Navin Rajpal","Ravinder Purwar"],"article name":"Dynamic Pattern Search Algorithm with Zero Motion Prejudgment for Fast Motion Estimation","Journal Name":"Advanced Computing & Communication Technologies (ACCT) 2015 Fifth International Conference on","vol":"none","pp.": "138-142","Year": "2015","ISSN": "2327-0659","ISBN":"none"},{"authors":["Ya-Xiang Zhao","Xiao-Ping Fan","Shao-Qiang Liu"],"article name":"Fast motion region segmentation based on motion vector field","Journal Name":"Wavelet Active Media Technology and Information Processing (ICWAMTIP) 2012 International Conference on","vol":"none","pp.": "153-156","Year": "2012","ISSN":"none","ISBN":"none"},{"authors":["Rui Fan","Yongfei Zhang","Bo Li"],"article name":"Motion Classification-Based Fast Motion Estimation for High-Efficiency Video Coding","Journal Name":"Multimedia IEEE Transactions on","vol.": "19","pp.": "893-907","Year": "2017","ISSN": "1520-9210","ISBN":"none"},{"authors":["Yogananda Patnaik","Dinesh Kumar Singh","Dipti Patra"],"article name":"A new search method for block motion estimation in video compression","Journal Name":"India Conference (INDICON) 2014 Annual IEEE","vol":"none","pp.": "1-5","Year": "2014","ISSN":"none","ISBN":"none"},{"authors":["Nan Hu","En-Hui Yang"],"article name":"Fast Motion Estimation Based on Confidence Interval","Journal Name":"Circuits and Systems for Video Technology IEEE Transactions on","vol.": "24","pp.": "1310-1322","Year": "2014","ISSN": "1051-8215","ISBN":"none"},{"authors":["Bin Sun","Zhi Liu","Haixia Zhang"],"article name":"Novel unsymmetrical dual cross-diamond search algorithm for fast block motion estimation","Journal Name":"Audio Language and Image Processing (ICALIP) 2014 International Conference on","vol":"none","pp.": "133-137","Year": "2014","ISSN":"none","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Soon-Chan Kwon","Jisang Yoo"],"article name":"Multi-Frame-Based Super Resolution Algorithm by Using Motion Vector Normalization and Edge Pattern Analysis","Journal Name":"The Journal of Korea Information and Communications Society","vol.": "38A","pp.": "164","Year": "2013","ISSN": "1226-4717","ISBN":"none"},{"authors":["Deepak Singh","Sukadev Meher"],"article name":"Direction-Adaptive Motion Estimation (DAME) for Efficient Video Compression","Journal Name":"IETE Technical Review","vol":"none","pp.": "1","Year": "2015","ISSN": "0256-4602","ISBN":"none"},{"authors":["Karam Singh","Shaik Rafi Ahamed"],"article name":"Computationally Efficient Motion Estimation Algorithm for HEVC","Journal Name":"Journal of Signal Processing Systems","vol":"none","pp.":"none","Year": "2017","ISSN": "1939-8018","ISBN":"none"},{"authors":["Shaifali Madan Arora","Navin Rajpal","Kavita Khanna"],"article name":"A new approach with enhanced accuracy in zero motion prejudgment for motion estimation in real-time applications","Journal Name":"Journal of Real-Time Image Processing","vol":"none","pp.":"none","Year": "2016","ISSN": "1861-8200","ISBN":"none"},{"authors":["K. C. Ravi Chandra Varma","M. Venkata Phani Kumar","Sudipta Mahapatra"],"article name":"Search range reduction for uni-prediction and bi-prediction in HEVC","Journal Name":"Journal of Real-Time Image Processing","vol":"none","pp.":"none","Year": "2016","ISSN": "1861-8200","ISBN":"none"},{"authors":["Soon-Chan Kwon","Jisang Yoo"],"article name":"Enhanced Multi-Frame Based Super-Resolution Algorithm by Normalizing the Information of Registration","Journal Name":"Journal of Electrical Engineering and Technology","vol.": "9","pp.": "363","Year": "2014","ISSN": "1975-0102","ISBN":"none"},{"authors":["Yasser Ismail","Wael El-Medany","Hessa Al-Junaid","Ahmed Abdelgawad"],"article name":"High performance architecture for real-time HDTV broadcasting","Journal Name":"Journal of Real-Time Image Processing","vol":"none","pp.":"none","Year": "2014","ISSN": "1861-8200","ISBN":"none"},{"authors":["Shaifali M. Arora","Kavita Khanna"],"Article Name":"none","Journal Name":"Communications in Computer and Information Science","vol.": "721","pp.": "272","Year": "2017","ISSN": "1865-0929","ISBN": "978-981-10-5426-6"},{"authors":["S. Madan Arora","N. Rajpal","K. Khanna","R. Purwar"],"article name":"Improved Accuracy in Initial Search Center Prediction to Fasten Motion Estimation in h.264/AVC","Journal Name":"IETE Journal of Research","vol":"none","pp.": "1","Year": "2016","ISSN": "0377-2063","ISBN":"none"},{"authors":["Lili Lin","I-Chyn Wey","Jing-Hua Ding"],"article name":"Fast predictive motion estimation algorithm with adaptive search mode based on motion type classification","Journal Name":"Signal Image and Video Processing","vol":"none","pp.":"none","Year": "2014","ISSN": "1863-1703","ISBN":"none"},{"authors":["Yasser Ismail","Ahmed Abdelgawad","Sherif El-etriby"],"article name":"High speed on-chip multiple cosine transform generator","Journal Name":"Journal of Real-Time Image Processing","vol":"none","pp.":"none","Year": "2015","ISSN": "1861-8200","ISBN":"none"},{"authors":["Jun Luo","Xiaohua Yang","Liheng Liu"],"article name":"A fast motion estimation algorithm based on adaptive pattern and search priority","Journal Name":"Multimedia Tools and Applications","vol":"none","pp.":"none","Year": "2014","ISSN": "1380-7501","ISBN":"none"},{"authors":["Tarek A. Elarabi","Randa Ayoubi","Hanan Mahmoud","Magdy A. Bayoumi"],"article name":"Efficient 45nm ASIC Architecture for Full-Search Free Intra Prediction in Real-Time H.264/AVC Decoder","Journal Name":"Journal of Signal Processing Systems","vol.": "70","pp.": "91","Year": "2013","ISSN": "1939-8018","ISBN":"none"},{"authors":["Chuan-Ming Song","Yanwen Guo","Xiang-Hai Wang","Dan Liu"],"article name":"Fuzzy quantization based bit transform for low bit-resolution motion estimation","Journal Name":"Signal Processing: Image Communication","vol.": "28","pp.": "1435","Year": "2013","ISSN": "09235965","ISBN":"none"},{"authors":["Zhibin Pan","Weiping Ku","Yidi Wang"],"article name":"Dynamic initial search pattern defined on Cartesian product of neighboring motion vectors for fast block-based motion estimation","Journal Name":"Multimedia Tools and Applications","vol":"none","pp.":"none","Year": "2017","ISSN": "1380-7501","ISBN":"none"},{"authors":["SAHU SATISH KUMAR","SHUKLA DOLLEY"],"article name":"A NEW APPROACH OF BLOCK MATCHING MOTION ESTIMATION      ALGORITHM FOR H.264/AVC VIDEO CODEC","Journal Name":"i-manager’s Journal on Pattern Recognition","vol.": "4","pp.": "10","Year": "2017","ISSN": "2349-7912","ISBN":"none"},{"authors":["Yun-Gu Lee"],"article name":"Early search termination for fast motion estimation","Journal Name":"EURASIP Journal on Image and Video Processing","vol.": "2015","pp.":"none","Year": "2015","ISSN": "1687-5281","ISBN":"none"},{"authors":["Djoudi Kerfa","M. F. Belbachir"],"article name":"Star diamond: an efficient algorithm for fast block matching motion estimation in H264/AVC video codec","Journal Name":"Multimedia Tools and Applications","vol":"none","pp.":"none","Year": "2015","ISSN": "1380-7501","ISBN":"none"},{"authors":["Soon-Chan Kwon","Jong-Myeong Lim","Jisang Yoo"],"article name":"Hybrid Super-Resolution Algorithm Robust to Cut-Change","Journal Name":"The Journal of the Korean Institute of Information and Communication Engineering","vol.": "17","pp.": "1672","Year": "2013","ISSN": "2234-4772","ISBN":"none"}]}]}