{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 19, "citationCountPatent": 0, "totalDownloads": 1044},"doi": "10.1109/TCSVT.2012.2186745","title": "Novel Spatio-Temporal Structural Information Based Video Quality Metric","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "Video quality assessment (VQA) is very important for many video processing applications, e.g., compression, archiving, restoration, and enhancement. An ideal video quality metric should achieve consistency between video distortion prediction and psychological perception of human visual system. Different from the quality assessment of single images, motion information and temporal distortion should be carefully considered for VQA. Most of previous VQA algorithms deal with the motion information through two ways: either incorporating motion characteristics into a temporal weighting scheme to account for their affects on the spatial distortion, or modeling the temporal distortion and spatial distortion independently. Optical flows need to be estimated in the two ways. In this paper, we propose a different methodology to deal with the motion information. Instead of explicitly calculating the optical flow and independently modeling the temporal distortion, both the spatial edge features and temporal motion characteristics are accounted for by some structural features in the localized spacetime regions. We propose to represent the structural information by two descriptors extracted from the 3-D structure tensors, which are the largest eigenvalue as well as its corresponding eigenvector. Experimental results on LIVE database and VQEG FR-TV Phase-I database show that the proposed VQA metric is competitive with state-of-the-art VQA metrics, while keeping relatively low computing complexity.","authors": [{"name": "Yue Wang", "affiliation": "Graduate University of the Chinese Academy of Sciences, Beijing, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6145628/6145628-photo-1-small.gif", "p": ["Yue Wang received the B.S. degree in electronic engineering from Tsinghua University, Beijing, China, in 2006. He is currently pursuing the Ph.D. degree with the Graduate University of the Chinese Academy of Sciences, Beijing.", "His current research interests include image and video coding, processing, and quality assessment."]}}, {"name": "Tingting Jiang", "affiliation": "National Engineering Laboratory for Video Technology and Key Laboratory of Machine Perception (MoE), School of Electrical Engineering and Computer Science, Peking University, Beijing, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6145628/6145628-photo-2-small.gif", "p": ["Tingting Jiang received the B.S. degree in computer science from the University of Science and Technology of China, Hefei, China, in 2001, and the Ph.D. degree in computer science from Duke University, Durham, NC, in 2007.", "She is currently an Assistant Professor of computer science with the Institute of Digital Media, School of Electronic Engineering and Computer Science, Peking University, Beijing, China. Her current research interests include computer vision, image, and video quality assessment."]}}, {"name": "Siwei Ma", "affiliation": "National Engineering Laboratory for Video Technology and Key Laboratory of Machine Perception (MoE), School of Electrical Engineering and Computer Science, Peking University, Beijing, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6145628/6145628-photo-3-small.gif", "p": ["Siwei Ma (S'03) received the B.S. degree in computer science from Shandong Normal University, Jinan, China, in 1999, and the Ph.D. degree in computer science from the Institute of Computing Technology, Chinese Academy of Sciences, Beijing, China, in 2005.", "From 2005 to 2007, he was a Post-Doctorate with the University of Southern California, Los Angeles. Then, he joined the Institute of Digital Media, School of Electronic Engineering and Computer Science, Peking University, Beijing, where he is currently an Associate Professor. He has published over 30 technical articles in refereed journals and proceedings in the areas of image and video coding, video processing, video streaming, and transmission. His current research interests include image and video coding, video streaming, and transmission."]}}, {"name": "Wen Gao", "affiliation": "National Engineering Laboratory for Video Technology and Key Laboratory of Machine Perception (MoE), School of Electrical Engineering and Computer Science, Peking University, Beijing, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6145628/6145628-photo-4-small.gif", "p": ["Wen Gao (M'92–SM'05–F'09) received the M.S. degree in computer science from the Harbin Institute of Technology, Harbin, China, in 1985, and the Ph.D. degree in electronics engineering from the University of Tokyo, Tokyo, Japan, in 1991.", "He was a Professor in computer science with the Harbin Institute of Technology from 1991 to 1995, and a Professor in computer science with the Institute of Computing Technology, Chinese Academy of Sciences, Beijing, China, from 1996 to 2005. He is currently a Professor with the Institute of Digital Media, School of Electronic Engineering and Computer Science, Peking University, Beijing. He has been leading research efforts to develop systems and technologies for video coding, face recognition, sign language recognition and synthesis, and multimedia retrieval. He has published four books and over 500 technical articles in refereed journals and proceedings in the areas of signal processing, image and video communication, computer vision, multimodal interface, pattern recognition, and bioinformatics. His current research interests include signal processing, image and video communication, computer vision, and artificial intelligence.", "Dr. Gao has received many awards, including five national awards for research achievements and activities. He did many services for the academic society, such as being the General Co-Chair of the IEEE International Conference on Multimedia and Expo in 2007 and the Head of Chinese delegation to the Moving Picture Expert Group of International Standard Organization since 1997. He is also the Chairman of the working group responsible for setting a National Audio Video Coding Standard for China."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Measurement", "Eigenvalues and eigenfunctions", "Tensile stress", "Three dimensional displays", "Optical distortion", "Databases", "Streaming media"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["visual databases", "computational complexity", "eigenvalues and eigenfunctions", "feature extraction", "image motion analysis", "video signal processing"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["computing complexity", "spatio-temporal structural information", "video quality metric", "video quality assessment", "video distortion prediction", "human visual system", "motion information", "spatial distortion", "temporal distortion", "temporal weighting scheme", "optical flows", "spatial edge features", "temporal motion characteristics", "localized spacetime regions", "3D structure tensors", "eigenvalue", "eigenvector", "LIVE database", "VQEG FR-TV Phase-I database"]}, {"type": "Author Keywords ", "kwd": ["video quality assessment (VQA)", "3-D structure tensor", "human visual system (HVS)"]}],"citations":[{"ieee-citations":[{"authors":["Xiaoou Tang","Wei Luo","Xiaogang Wang"],"article name":"Content-Based Photo Quality Assessment","Journal Name":"Multimedia IEEE Transactions on","vol.": "15","pp.": "1930-1943","Year": "2013","ISSN": "1520-9210","ISBN":"none"},{"authors":["Qun Guo","Xiaoqiang Lu","Yuan Yuan"],"article name":"Video quality assessment via supervised topic model","Journal Name":"Signal and Information Processing (ChinaSIP) 2014 IEEE China Summit & International Conference on","vol":"none","pp.": "636-640","Year": "2014","ISSN":"none","ISBN":"none"},{"authors":["Benjamin Rainer","Christian Timmerer"],"article name":"A quality of experience model for Adaptive Media Playout","Journal Name":"Quality of Multimedia Experience (QoMEX) 2014 Sixth International Workshop on","vol":"none","pp.": "177-182","Year": "2014","ISSN":"none","ISBN":"none"},{"authors":["Long Xu","Weisi Lin","Jia Li","Xu Wang","Yihua Yan","Yuming Fang"],"article name":"Rank learning on training set selection and image quality assessment","Journal Name":"Multimedia and Expo (ICME) 2014 IEEE International Conference on","vol":"none","pp.": "1-6","Year": "2014","ISSN":"none","ISBN":"none"},{"authors":["Harsha D. Appuhami","Maria G. Martini","Chaminda T. E. R. Hewage"],"article name":"Using 3D structural tensors in quality evaluation of stereoscopic video","Journal Name":"Visual Communications and Image Processing Conference 2014 IEEE","vol":"none","pp.": "418-421","Year": "2014","ISSN":"none","ISBN":"none"},{"authors":["Li-Chun Wang","Ru Wang","De-Hui Kong","Bao-Cai Yin"],"article name":"Similarity Assessment Model for Chinese Sign Language Videos","Journal Name":"Multimedia IEEE Transactions on","vol.": "16","pp.": "751-761","Year": "2014","ISSN": "1520-9210","ISBN":"none"},{"authors":["Jingjing Han","Tingting Jiang","Siwei Ma"],"article name":"Stereoscopic video quality assessment model based on spatial-temporal structural information","Journal Name":"Visual Communications and Image Processing (VCIP) 2012 IEEE","vol":"none","pp.": "1-6","Year": "2012","ISSN":"none","ISBN":"none"},{"authors":["Kai Kang","Xingang Liu","Chao Sun"],"article name":"Video Quality Assessment Metric Based on Spatio-temporal Motion Information","Journal Name":"Dependable Autonomic and Secure Computing (DASC) 2013 IEEE 11th International Conference on","vol":"none","pp.": "47-51","Year": "2013","ISSN":"none","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Shiyu Zhou","Xiuyan Xia","Meng Ran","Luhan Wang","Chen Cheng"],"Article Name":"none","Journal Name":"Lecture Notes in Electrical Engineering","vol.": "473","pp.": "365","Year": "2018","ISSN": "1876-1100","ISBN": "978-981-10-7520-9"},{"authors":["ana Rimac-Drlje"],"article name":"Foveation-based content adaptive root mean squared error for video quality assessment","Journal Name":"Multimedia Tools and Applications","vol":"none","pp.":"none","Year": "2017","ISSN": "1380-7501","ISBN":"none"},{"authors":["Kuo-Cheng Liu"],"article name":"Estimation of Structural Irregularity Based Temporal Masking for Color Video","Journal Name":"Journal of Image and Graphics","vol":"none","pp.":"none","Year": "2015","ISSN": "23013699","ISBN":"none"},{"authors":["Qiang Zhang","Sheng Hua","Rick S. Blum","Minli Chen"],"article name":"Video fusion performance assessment based on spatial–temporal phase congruency","Journal Name":"Signal Processing","vol.": "105","pp.": "43","Year": "2014","ISSN": "01651684","ISBN":"none"},{"authors":["Long Xu","Jia Li","Weisi Lin","Yun Zhang","Yongbing Zhang","Yihua Yan"],"article name":"Pairwise comparison and rank learning for image quality assessment","Journal Name":"Displays","vol.": "44","pp.": "21","Year": "2016","ISSN": "01419382","ISBN":"none"},{"authors":["Qiang Zhang","Yueling Chen","Long Wang"],"article name":"Multisensor video fusion based on spatial–temporal salience detection","Journal Name":"Signal Processing","vol.": "93","pp.": "2485","Year": "2013","ISSN": "01651684","ISBN":"none"},{"authors":["Lihuo He","Fei Gao","Weilong Hou","Lei Hao"],"article name":"Objective image quality assessment: a survey","Journal Name":"International Journal of Computer Mathematics","vol.": "91","pp.": "2374","Year": "2014","ISSN": "0020-7160","ISBN":"none"},{"authors":["Jie Yang","Jian Xiong","Guan Gui","Rongfang Song","Wang Luo","Xianzhong Long"],"article name":"Hierarchical Gradient Similarity Based Video Quality Assessment Metric","Journal Name":"Algorithms","vol.": "10","pp.": "72","Year": "2017","ISSN": "1999-4893","ISBN":"none"},{"authors":["Yang Li","Xu Wang","Feng Li","Qingrui Guo","Qiang Fan","Qiwei Peng","Wang Luo","Min Feng","Yuan Xia","Shaowei Liu"],"Article Name":"none","Journal Name":"Lecture Notes of the Institute for Computer Sciences Social Informatics and Telecommunications Engineering","vol.": "214","pp.": "299","Year": "2018","ISSN": "1867-8211","ISBN": "978-3-319-72997-8"},{"authors":["Jiefeng Guo","Gong Hu","Weijian Xu","Lianfen Huang"],"article name":"Hierarchical content importance-based video quality assessment for HEVC encoded videos transmitted over LTE networks","Journal Name":"Journal of Visual Communication and Image Representation","vol":"none","pp.":"none","Year": "2016","ISSN": "10473203","ISBN":"none"},{"authors":["Qiang Zhang","Yabin Wang","Martin D. Levine","Xiaoqing Yuan","Long Wang"],"article name":"Multisensor video fusion based on higher order singular value decomposition","Journal Name":"Information Fusion","vol.": "24","pp.": "54","Year": "2015","ISSN": "15662535","ISBN":"none"}]}]}