{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 3, "citationCountPatent": 0, "totalDownloads": 603},"doi": "10.1109/TCSVT.2011.2168294","title": "Gradient Ordinal Signature and Fixed-Point Embedding for Efficient Near-Duplicate Video Detection","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "In order to meet the requirement of large scale real-time near-duplicate video detection, this paper has achieved two goals. First, this paper proposes a more compact local image descriptor which is termed as gradient ordinal signature (GOS). GOS not only has the advantages of low dimension, simplicity in computation, and high discrimination but also is invariant to mirror reflection, rotation, and scale changes. Second, applying the characteristics of the proposed GOS and combining with the embedding theory of metric spaces, this paper proposes an efficient similarity search method based on the fixed-point embedding (FE). A main advantage of FE is that its parameters have good controllability, and its performance is stable and not sensitive to dataset changes. On the whole, the goal of our approach focuses on the speed rather than the accuracy of near-duplicate video detection. We have evaluated our method on four different settings to verify the two goals. Specifically, the tests include image and video datasets, respectively, to evaluate the performance of GOS. Experimental results demonstrate the effectiveness, efficiency, and lower memory usage of GOS. Furthermore, the third test compares FE with locality sensitivity hashing. FE also shows a speed improvement of about ten times and saves more than 60% in memory usage. The fourth test demonstrates that the combination of GOS and FE for near-duplicate video detection can achieve better overall efficiency than the state-of-the-art methods.","authors": [{"name": "Hong Liu", "affiliation": "Shanghai Key Laboratory of Intelligent Information Processing, School of Computer Science, Fudan University, Shanghai, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6069572/6069572-photo-1-small.gif", "p": ["Hong Liu (S'01–M'04) received the B.S. degree from the Department of Physics, Hunan Normal University, Hunan, China, in 1998, and the M.S. degree from the Department of Information Management, Shanghai Branch of Nanjing Political Institute, Shanghai, China, in 2004. Since 2007, he has been pursuing the Ph.D. degree with the School of Computer Science, Fudan University, Shanghai.", "From 1998 to 2001, he was a Lecturer and Researcher with the Lianyungang Normal Faculty. Since 2004, he has been an Engineer with the Information Center of Second Military Medical University, Shanghai, where he is currently a Senior Engineer. His current research interests include multimedia information processing and retrieval, pattern recognition, and machine learning."]}}, {"name": "Hong Lu", "affiliation": "Shanghai Key Laboratory of Intelligent Information Processing, School of Computer Science, Fudan University, Shanghai, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6069572/6069572-photo-2-small.gif", "p": ["Hong Lu (S'01–M'04) received the B.Eng. and M.Eng. degrees in computer science and technology from Xidian University, Xi'an, China, in 1993 and 1998, respectively, and the Ph.D. degree from Nanyang Technological University, Singapore, in 2005.", "From 1993 to 2000, she was a Lecturer and Researcher with the School of Computer Science and Technology, Xidian University. From 2000 to 2003, she was a Research Student with the School of Electrical and Electronic Engineering, Nanyang Technological University. Since 2004, she has been with the School of Computer Science, Fudan University, Shanghai, China, where she is currently an Associate Processor. Her current research interests include image and video processing, computer vision, machine learning, and pattern recognition."]}}, {"name": "Zhaohui Wen", "affiliation": "Shanghai Key Laboratory of Intelligent Information Processing, School of Computer Science, Fudan University, Shanghai, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6069572/6069572-photo-3-small.gif", "p": ["Zhaohui Wen received the B.S. degree from the Software School, Hunan University, Hunan, China, in 2008, and the M.S. degree from the School of Computer Science, Fudan University, Shanghai, China, in 2011.", "His current research interests include multimedia information processing and retrieval, pattern recognition, and machine learning."]}}, {"name": "Xiangyang Xue", "affiliation": "Shanghai Key Laboratory of Intelligent Information Processing, School of Computer Science, Fudan University, Shanghai, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6069572/6069572-photo-4-small.gif", "p": ["Xiangyang Xue (M'05) received the B.S., M.S., and Ph.D. degrees in communication engineering from Xidian University, Xi'an, China, in 1989, 1992, and 1995, respectively.", "He joined the School of Computer Science, Fudan University, Shanghai, China, in May 1995. Since 2000, he has been a Full Professor. He has published more than 100 research papers in journals or conference proceedings. His current research interests include multimedia information processing and retrieval, pattern recognition, and machine learning.", "Dr. Xue is an Associate Editor of the IEEE Transactions on autonomous mental development and the Journal of Computer Research and Development."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Mirrors", "Feature extraction", "Extraterrestrial measurements", "Iron", "Accuracy", "Streaming media"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video signal processing", "gradient methods", "object detection", "search problems"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["locality sensitivity hashing", "large scale real-time near-duplicate video detection", "compact local image descriptor", "gradient ordinal signature", "GOS", "mirror reflection", "rotation change", "scale change", "metric space", "similarity search method", "fixed-point embedding", "image dataset", "video dataset", "memory usage"]}, {"type": "Author Keywords ", "kwd": ["similarity search", "Fixed-point embedding (FE)", "gradient ordinal signature (GOS)", "local feature", "near-duplicate video detection"]}],"citations":[{"ieee-citations":[{"authors":["Jun-Tae Lee","Kyung-Rae Kim","Won-Dong Jang","Chang-Su Kim"],"article name":"Near-duplicate video clustering using multiple complementary video signatures","Journal Name":"Signal and Information Processing Association Annual Summit and Conference (APSIPA) 2015 Asia-Pacific","vol":"none","pp.": "667-671","Year": "2015","ISSN":"none","ISBN":"none"},{"authors":["Benchang Wei","Tao Guan","Junqing Yu"],"article name":"Projected Residual Vector Quantization for ANN Search","Journal Name":"MultiMedia IEEE","vol.": "21","pp.": "41-51","Year": "2014","ISSN": "1070-986X","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Zhipeng Wu","Kiyoharu Aizawa"],"article name":"Self-similarity-based partial near-duplicate video retrieval and alignment","Journal Name":"International Journal of Multimedia Information Retrieval","vol.": "3","pp.": "1","Year": "2014","ISSN": "2192-6611","ISBN":"none"}]}]}