{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 17, "citationCountPatent": 1, "totalDownloads": 790},"doi": "10.1109/TCSVT.2011.2179458","title": "Novel 2-D MMSE Subpixel-Based Image Down-Sampling","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "Subpixel-based down-sampling is a method that can potentially improve apparent resolution of a down-scaled image on LCD by controlling individual subpixels rather than pixels. However, the increased luminance resolution comes at price of chrominance distortion. A major challenge is to suppress color fringing artifacts while maintaining sharpness. We propose a new subpixel-based down-sampling pattern called diagonal direct subpixel-based down-sampling (DDSD) for which we design a 2-D image reconstruction model. Then, we formulate subpixel-based down-sampling as a MMSE problem and derive the optimal solution called minimum mean square error for subpixel-based down-sampling (MMSE-SD). Unfortunately, straightforward implementation of MMSE-SD is computational intensive. We thus prove that the solution is equivalent to a 2-D linear filter followed by DDSD, which is much simpler. We further reduce computational complexity using a small <i>k</i> &#x00D7; <i>k</i> filter to approximate the much larger MMSE-SD filter. To compare the performances of pixel and subpixel-based down-sampling methods, we propose two novel objective measures: normalized <i>l</i><sub>1</sub> high frequency energy for apparent luminance sharpness and PSNR<sub>U(V)</sub> for chrominance distortion. Simulation results show that both MMSE-SD and MMSE-SD(<i>k</i>) can give sharper images compared with conventional down-sampling methods, with little color fringing artifacts.","authors": [{"name": "Lu Fang", "affiliation": "Department of Electronic and Computer Engineering, Hong Kong University of Science and Technology, Clear Water Bay, Hong Kong", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6193248/6101564/6101564-photo-1-small.gif", "p": ["Lu Fang received the B.S. degree from the Department of Electronic Engineering and Information Science, University of Science and Technology of China, Hefei, China, in June 2007. She used to visit Northwestern University, Evanston, IL, under the support of Prof. A. K. Katsaggelos. She received the Ph.D. degree from the Department of Electronic and Computer Engineering, Hong Kong University of Science and Technology, Clear Water Bay, Hong Kong, in July 2011.", "She is currently with the Department of Electronic and Computer Engineering, Hong Kong University of Science and Technology."]}}, {"name": "Oscar C. Au", "affiliation": "Department of Electronic and Computer Engineering, Hong Kong University of Science and Technology, Clear Water Bay, Hong Kong", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6193248/6101564/6101564-photo-2-small.gif", "p": ["Oscar C. Au (SM'XX) received the B.A.Sc. degree from the University of Toronto, Toronto, ON, Canada, in 1986, and the M.A. and Ph.D. degrees from Princeton University, Princeton, NJ, in 1988 and 1991, respectively.", "After being a Post-Doctoral Researcher with Princeton University for one year, he joined the Hong Kong University of Science and Technology (HKUST), Clear Water Bay, Hong Kong, as an Assistant Professor in 1992. He is/has been a Professor with the Department of Electronic and Computer Engineering, the Director of the Multimedia Technology Research Center, and the Director of the Computer Engineering Program in HKUST. He has published about 320 technical journals and conference papers. His fast motion estimation algorithms were accepted into the ISO/IEC 14496–7 MPEG-4 International Video Coding Standard and the China AVS-M Standard. His light-weight encryption and error resilience algorithms are accepted into the China AVS Standard. He has eight U.S. patents and is applying for more than 60 on his signal processing techniques. He has performed forensic investigation and stood as an Expert Witness in the Hong Kong courts many times. His main research interests include video and image coding and processing, watermarking and light weight encryption, speech, and audio processing. Research topics include fast motion estimation for MPEG-1/2/4, H.261/3/4 and AVS, optimal and fast suboptimal rate control, mode decision, transcoding, denoising, deinterlacing, postprocessing, multiview coding, scalable video coding, distributed video coding, subpixel rendering, JPEG/JPEG2000, HDR imaging, compressive sensing, halftone image data hiding, GPU-processing, software–hardware codesign, and so on.", "Dr. Au is a Board of Governor Member of the Asia Pacific Signal and Information Processing Association. He is/was an Associate Editor of the IEEE Transactions on Circuits and Systems for Video Technology, the IEEE Transactions on Image Processing, and the IEEE Transactions on Circuits and Systems, Part1. He is on the editorial boards of the Journal of Signal Processing Systems, the Journal of Multimedia, and the Journal of Franklin Institute. He is/was the Chair of the CAS Technical Committee on Multimedia Systems and Applications, the Vice Chair of the SP TC on Multimedia Signal Processing, and a member of the CAS TC on Video Signal Processing and Communications, the CAS TC on DSP, and the SP TC on Image, Video and Multidimensional Signal Processing. He has served on the steering committees of the IEEE Transactions on Multimedia and the IEEE International Conference of Multimedia and Expo. He also served on the organizing committees of the IEEE International Symposium on Circuits and Systems in 1997, the IEEE International Conference On Acoustics, Speech and Signal Processing in 2003, the ISO/IEC MPEG 71st Meeting in 2005, the International Conference on Image Processing in 2010, and other conferences. He was the General Chair of the Pacific-Rim Conference on Multimedia in 2007, the IEEE ICME in 2010, and the Packet Video Workshop in 2010. He received Best Paper Awards in SiPS 2007 and PCM 2007. He was an IEEE Distinguished Lecturer in 2009 and 2010, and has been a Keynote Speaker for a few times."]}}, {"name": "Ketan Tang", "affiliation": "Department of Electronic and Computer Engineering, Hong Kong University of Science and Technology, Clear Water Bay, Hong Kong", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6193248/6101564/6101564-photo-3-small.gif", "p": ["Ketan Tang received the B.S. degree from the Department of Electronic Engineering and Information Science, University of Science and Technology of China, Hefei, China, in 2009. He is currently pursuing the Ph.D. degree with the Department of Electronic and Computer Engineering, Hong Kong University of Science and Technology, Clear Water Bay, Hong Kong."]}}, {"name": "Xing Wen", "affiliation": "Department of Electronic and Computer Engineering, Hong Kong University of Science and Technology, Clear Water Bay, Hong Kong", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6193248/6101564/6101564-photo-4-small.gif", "p": ["Xing Wen received the B.E. degree in electronic engineering from Xidian University, Xi'an, China, in 2007. He is currently pursuing the Ph.D. degree with the Department of Electronic and Computer Engineering, Hong Kong University of Science and Technology, Clear Water Bay, Hong Kong, under the supervision of Prof. O. C. Au and Prof. J. Xu.", "His current research interests include video coding standard, motion estimation, HW/SW codesign, hardware implementation of multimedia algorithms, high throughput very large scale integration design, multiple description video coding, and visual quality assessment."]}}, {"name": "Hanli Wang", "affiliation": "Department of Computer Science and Technology, Tongji University, Shanghai, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6193248/6101564/6101564-photo-5-small.gif", "p": ["Hanli Wang received the B.S. and M.S. degrees in electrical engineering from Zhejiang University, Hangzhou, China, in 2001 and 2004, respectively, and the Ph.D. degree in computer science from the City University of Hong Kong, Kowloon, Hong Kong, in 2007.", "From 2007 to 2008, he was a Research Fellow with the Department of Computer Science, City University of Hong Kong. From 2007 to 2008, he was a Visiting Scholar with Stanford University, Palo Alto, CA, invited by Prof. C. K. Chui. From 2008 to 2009, he was a Research Engineer with Precoad, Inc., Menlo Park, CA. From 2009 to 2010, he was an Alexander von Humboldt Research Fellow with the University of Hagen, Hagen, Germany. In 2010, he joined the Department of Computer Science and Technology, Tongji University, Shanghai, China, as a Professor. His current research interests include digital video coding, image processing, pattern recognition, and video content analysis."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Image color analysis", "Image resolution", "Rendering (computer graphics)", "Image reconstruction", "Manganese", "Computational complexity", "Interpolation"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["least mean squares methods", "distortion", "filtering theory", "image colour analysis", "image denoising", "image reconstruction", "image resolution", "image sampling"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["apparent luminance sharpness", "2D MMSE subpixel-based image down-sampling pattern", "LCD", "luminance resolution", "chrominance distortion", "color fringing artifact suppression", "diagonal direct subpixel-based down-sampling", "DDSD", "2D image reconstruction model", "minimum mean square error", "2D linear filter", "k&#x00D7;k filter", "MMSE-SD filter", "normalized l<sub>1</sub> high frequency energy"]}, {"type": "Author Keywords ", "kwd": ["subpixel rendering", "Color fringing", "image down-sampling"]}],"citations":[{"ieee-citations":[{"authors":["Chul Lee","Jin-Hwan Kim","Chulwoo Lee","Chang-Su Kim"],"article name":"Optimized Brightness Compensation and Contrast Enhancement for Transmissive Liquid Crystal Displays","Journal Name":"Circuits and Systems for Video Technology IEEE Transactions on","vol.": "24","pp.": "576-590","Year": "2014","ISSN": "1051-8215","ISBN":"none"},{"authors":["Jin Zeng","Lu Fang","Jiahao Pang","Houqiang Li","Feng Wu"],"article name":"Subpixel Image Quality Assessment Syncretizing Local Subpixel and Global Pixel Features","Journal Name":"Image Processing IEEE Transactions on","vol.": "25","pp.": "5841-5856","Year": "2016","ISSN": "1057-7149","ISBN":"none"},{"authors":["Yeon Oh Nam","Dong Yoon Choi","Byung Cheol Song"],"article name":"A subpixel-based image downsamping using learned 2D FIR filters","Journal Name":"Multimedia and Expo Workshops (ICMEW) 2014 IEEE International Conference on","vol":"none","pp.": "1-5","Year": "2014","ISSN": "1945-7871","ISBN":"none"},{"authors":["Lu Fang","Oscar C. Au","Ngai-Man Cheung"],"article name":"Subpixel rendering: from font rendering to image subsampling [Applications Corner]","Journal Name":"Signal Processing Magazine IEEE","vol.": "30","pp.": "177-189","Year": "2013","ISSN": "1053-5888","ISBN":"none"},{"authors":["Avishai M. Marson","Adrian Stern"],"article name":"Horizontal Resolution Enhancement of Autostereoscopy Three-Dimensional Displayed Image by Chroma Subpixel Downsampling","Journal Name":"Display Technology Journal of","vol.": "11","pp.": "800-806","Year": "2015","ISSN": "1551-319X","ISBN":"none"},{"authors":["Jin Zeng","Oscar C. Au","Yuanfang Guo","Jiahao Pang","Ketan Tang","Yonggen Ling"],"article name":"Analysis of sampling pattern and Luma-Chroma filter design for subpixel-based image downsampling","Journal Name":"Acoustics Speech and Signal Processing (ICASSP) 2014 IEEE International Conference on","vol":"none","pp.": "5834-5838","Year": "2014","ISSN":"none","ISBN":"none"},{"authors":["Suk-Ju Kang"],"article name":"Adaptive Weight Allocation-Based Subpixel Rendering Algorithm","Journal Name":"Circuits and Systems for Video Technology IEEE Transactions on","vol.": "24","pp.": "224-229","Year": "2014","ISSN": "1051-8215","ISBN":"none"},{"authors":["Lu Fang","Oscar C. Au","Ngai-Man Cheung","Aggelos. K. Katsaggelos","Houqiang Li","Feng Zou"],"article name":"Luma-Chroma Space Filter Design for Subpixel-Based Monochrome Image Downsampling","Journal Name":"Image Processing IEEE Transactions on","vol.": "22","pp.": "3818-3829","Year": "2013","ISSN": "1057-7149","ISBN":"none"},{"authors":["Jiahao Pang","Lu Fang","Jin Zeng","Yuanfang Guo","Ketan Tang"],"article name":"Subpixel-Based Image Scaling for Grid-like Subpixel Arrangements: A Generalized Continuous-Domain Analysis Model","Journal Name":"Image Processing IEEE Transactions on","vol.": "25","pp.": "1017-1032","Year": "2016","ISSN": "1057-7149","ISBN":"none"},{"authors":["Jae-Han Lee","Kyung-Rae Kim","Chang-Su Kim"],"article name":"Subpixel rendering without color distortions for diamond-shaped PenTile displays","Journal Name":"Circuits and Systems (ISCAS) 2017 IEEE International Symposium on","vol":"none","pp.": "1-4","Year": "2017","ISSN": "2379-447X","ISBN":"none"},{"authors":["Lu Fang","Oscar C. Au","Yan Chen","Aggelos K. Katsaggelos","Hanli Wang","Xing Wen"],"article name":"Joint Demosaicing and Subpixel-Based Down-Sampling for Bayer Images: A Fast Frequency-Domain Analysis Approach","Journal Name":"Multimedia IEEE Transactions on","vol.": "14","pp.": "1359-1369","Year": "2012","ISSN": "1520-9210","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Yeon-Oh Nam","Byung Cheol Song"],"article name":"Subpixel-based image downsampling algorithm using content-adaptive two-dimensional FIR filters","Journal Name":"IET Image Processing","vol.": "8","pp.": "445","Year": "2014","ISSN": "1751-9659","ISBN":"none"},{"authors":["Boon Tatt Koik","Haidi Ibrahim"],"article name":"Thumbnail Image with Blurry Edge Information Utilizing Half Factor Rules","Journal Name":"Mathematical Problems in Engineering","vol.": "2014","pp.": "1","Year": "2014","ISSN": "1024-123X","ISBN":"none"},{"authors":["Chengqiang Huang","Qi Zhang","Hui Wang","Songlin Feng"],"article name":"An RGB to RGBG conversion algorithm for AMOLED panel","Journal Name":"Journal of the Society for Information Display","vol":"none","pp.":"none","Year": "2017","ISSN": "10710922","ISBN":"none"},{"authors":["Boon Tatt Koik","Haidi Ibrahim"],"article name":"Thumbnail with Integrated Blur Based on Edge Width Analysis","Journal Name":"Journal of Sensors","vol.": "2016","pp.": "1","Year": "2016","ISSN": "1687-725X","ISBN":"none"},{"authors":["Lu Fang","Oscar C. Au","Ketan Tang","Xing Wen"],"article name":"Increasing image resolution on portable displays by subpixel rendering – a systematic overview","Journal Name":"APSIPA Transactions on Signal and Information Processing","vol.": "1","pp.":"none","Year": "2012","ISSN": "2048-7703","ISBN":"none"},{"authors":["Ji Yong Kwon","Moon Gi Kang"],"article name":"Image Restoration Considering Chromatic Aberration Problem of Multi-Spectral Filter Array Image","Journal Name":"Journal of the Institute of Electronics and Information Engineers","vol.": "53","pp.": "123","Year": "2016","ISSN": "2287-5026","ISBN":"none"}]}]}