{"issn": [{"format": "Print ISSN", "value": "0095-9804"}],"metrics": {"citationCountPaper": 0, "citationCountPatent": 0, "totalDownloads": 27},"doi": "10.1109/JAIEE.1930.6535163","title": "Operating transformers by temperature","publicationTitle": "Journal of the A.I.E.E.","abstract": "This paper discusses a proposal, sponsored by the Transformer Subcommittee of the Committee on Electrical Machinery, which is intended to serve as a guide in operating transformers by temperature rather than in accordance with their nameplate ratings. There is a real difference between &#x201C;rating standards&#x201D; and &#x201C;recommendations for operation;&#x201D; one simply specifies the measure of a machine under a definite set of conditions and the other constitutes a guide for loading under the varying conditions of actual service. With this difference in mind, a departure from the practise of the Institute up to this time is suggested; namely, that these operating recommendations be placed in an appendix of the Standards and considered not as rating standards but purely as a guide in loading transformers which have been designed to meet the Standards of Rating. One of the first things that had to be done in framing these recommendations was to setae the maximum safe limiting temperature of the windings for operation in actual service. The aim in making this selection was to provide for reasonable deterioration of the insulation and therefore a reasonably long life for the transformer. For reasons disclosed in this paper, a limiting temperature of 95 deg. cent. was adopted. This limit is 10 deg. below that used in the Standards for Rating. These are the high points of the proposal. But opinion on these matters seems to be rather divided throughout the industry, and the purpose of this paper is to bring them to the attention of all members of the Institute.","authors": [{"name": "W. M. Dann", "affiliation": "Westinghouse Elec. &#x0026; Mfg. Co., Sharon, Pa."}],"citations":[null]}