{"issn": [{"format": "Print ISSN", "value": "0095-9804"}],"metrics": {"citationCountPaper": 0, "citationCountPatent": 0, "totalDownloads": 102},"doi": "10.1109/JAIEE.1930.6535173","title": "Abridgment of three-phase short-circuit synchronous machines &#x2014; V","publicationTitle": "Journal of the A.I.E.E.","abstract": "This paper is the fifth of a series which the authors' have presented on the subject of synchronous machines. Part I was an extension of the fundamental theory: Part II, a treatment of torque-angle characteristics under steady-stale conditions; Part III, a study of torque-angle characteristics under transient conditions; and Part IV, an analysis of single-phase short-circuits. In the present paper equations for the currents in the armature phases and field under three-phase short-circuit are developed. The analysis is divided into three parts: The first covers the case of short-circuit at no-load when the resistance is negligible in determining the magnitude of the current although it must naturally be considered in finding the decrement factors: the second considers the same case where the resistance does effect the magnitude of the current; the third covers the case of short-circuit under load when resistance is negligible as in the first case. The effect of the nature of the load, &#x2014; i. e., whether the power factor is lagging or leading, &#x2014; is studied and some interesting results are brought out. It is shown that short circuits under load may give less current than at no-load; and it is further developed that under certain practical operating conditions, it is even possible to obtain substantially no fundamental current. The paper is illustrated with comparisons of calculated curves and oscillograms showing the actual currents obtained in test. Some of the interesting points concerning the nature of the short-circuit currents and the manner in which they are influenced by the design of the machine are mentioned in the discussion of results.","authors": [{"name": "R. E. Doherty", "affiliation": "Gen'l. Elec. Company, Schenectady, N. Y."}, {"name": "C. A. Nickle", "affiliation": "Elec. Engr., Gen'l. Elec. Company, Schenectady, N. Y."}],"citations":[null]}