{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 8, "citationCountPatent": 0, "totalDownloads": 557},"doi": "10.1109/TCSVT.2012.2189669","title": "Distributed Video Coding With Feedback Channel Constraints","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "Many of the distributed video coding (DVC) systems described in the literature make use of a feedback channel from the decoder to the encoder to determine the rate. However, the number of requests through the feedback channel is often high, and as a result the overall delay of the system could be unacceptable in practical applications. As a solution, feedback-free DVC systems have been proposed, but the problem with these solutions is that they incorporate a difficult trade-off between encoder complexity and compression performance. Recognizing that a limited form of feedback may be supported in many video-streaming scenarios, in this paper we propose a method for constraining the number of feedback requests to a fixed maximum number of N requests for an entire Wyner-Ziv (WZ) frame. The proposed technique estimates the WZ rate at the decoder using information obtained from previously decoded WZ frames and defines the N requests by minimizing the expected rate overhead. Tests on eight sequences show that the rate penalty is less than 5% when only five requests are allowed per WZ frame (for a group of pictures of size four). Furthermore, due to improvements from previous work, the system is able to perform better than or similar to DISCOVER even when up to two requests per WZ frame are allowed. The practical usefulness of the proposed approach is studied by estimating end-to-end delay and encoder buffer requirements, indicating that DVC with constrained feedback can be an important solution in the context of video-streaming scenarios.","authors": [{"name": "J&#x00FC;rgen Slowack", "affiliation": "Multimedia Lab, Department of Electronics and Information Systems, Ghent University, Ledeberg-Ghent, Belgium", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6162975/6162975-photo-1-small.gif", "p": ["Jürgen Slowack received the M.S. and Ph.D. degrees in computer engineering from Ghent University, Ghent, Belgium, in 2006 and 2010, respectively.", "He is currently a Post-Doctoral Researcher with the Multimedia Lab, a research group part of the Department of Electronics and Information Systems, Ghent University, and part of the Interdisciplinary Institute for Broadband Technology, Ghent. His current research interests include distributed video coding and video compression and analysis, in general."]}}, {"name": "Jozef Skorupa", "affiliation": "Multimedia Lab, Department of Electronics and Information Systems, Ghent University, Ledeberg-Ghent, Belgium", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6162975/6162975-photo-2-small.gif", "p": ["Jozef Škorupa received the Masters degree in mathematics from Comenius University, Bratislava, Slovakia, in 2004. In 2006, he joined the Multimedia Lab, Ghent University, Ghent, Belgium, from where he received the Ph.D. degree in computer science engineering in 2011.", "His current research interests include distributed video compression."]}}, {"name": "Nikos Deligiannis", "affiliation": "Department of Electronics and Informatics, Vrije Universiteit Brussel, Brussels, Belgium", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6162975/6162975-photo-3-small.gif", "p": ["Nikos Deligiannis (S'08–M'10) received the degree in electrical and computer engineering from the University of Patras, Patras, Greece, in 2006. Currently, he is pursuing the Ph.D. degree in distributed video coding for wireless lightweight applications with the Department of Electronics and Informatics, Vrije Universiteit Brussel, Brussels, Belgium.", "From December 2006 to September 2007, he was a Researcher with the Wireless Telecommunications Laboratory, University of Patras. He joined the Department of Electronics and Informatics, Vrije Universiteit Brussel, in October 2007. His current research interests include statistical channel modeling, multimedia coding, distributed source coding, multiple description coding, wireless cellular networks, and location positioning."]}}, {"name": "Peter Lambert", "affiliation": "Multimedia Lab, Department of Electronics and Information Systems, Ghent University, Ledeberg-Ghent, Belgium", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6162975/6162975-photo-4-small.gif", "p": ["Peter Lambert (M'07) received the Masters degree in science (mathematics) and in applied informatics from Ghent University, Ghent, Belgium, in 2001 and 2002, respectively, and the Ph.D. degree in computer science in 2007.", "He is currently a Lecturer and Technology Developer with the Multimedia Lab, Ghent University. In 2010, he became a part-time Lecturer with the Multimedia Lab in multimedia techniques. His current research interests include (mobile) multimedia applications, (scalable and 3-D) media coding technologies, and multimedia content adaptation."]}}, {"name": "Adrian Munteanu", "affiliation": "Department of Electronics and Informatics, Vrije Universiteit Brussel, Brussels, Belgium", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6162975/6162975-photo-5-small.gif", "p": ["Adrian Munteanu (M'07) was born in Constanta, Romania, in 1970. He received the M.S. degree in electronics and telecommunications from the Politehnica University of Bucharest, Bucharest, Romania, in 1994, the M.S. degree in biomedical engineering from the Technical University of Patras, Patras, Greece, in 1996, and the Ph.D. degree in applied sciences from Vrije Universiteit Brussel (VUB), Brussel, Belgium, in 2003.", "From 2004 to 2010, he was a Post-Doctoral Fellow with the Fund for Scientific Research-Flanders (FWO), Flanders, Belgium. Since 2007, he has been a Professor with VUB. He is the author of more than 200 journal and conference publications, patent applications, and contributions to standards, of which more than 40 are journal publications and contributions to books. His current research interests include scalable image and video coding, wavelet-based coding of images, video, and 3-D models, coding of volumetric datasets, scalable coding of meshes, multiresolution analysis, joint source and channel coding, multiple description coding, and distributed source coding.", "Dr. Munteanu was the recipient of the BARCO-FWO Prize for his Ph.D. thesis."]}}, {"name": "Rik Van de Walle", "affiliation": "Multimedia Lab, Department of Electronics and Information Systems, Ghent University, Ledeberg-Ghent, Belgium", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6162975/6162975-photo-6-small.gif", "p": ["Rik Van de Walle (M'99) received the M.S. and Ph.D. degrees in engineering from Ghent University, Ghent, Belgium, in 1994 and 1998, respectively.", "After a visiting scholarship with the University of Arizona, Tucson, he returned to Ghent University, where he became a Professor of multimedia systems and applications, and the Head of the Multimedia Lab. He is the author of more than 120 articles in international peer-reviewed journals and 350 articles in proceedings of international conferences. His current research interests include multimedia content delivery, presentation and archiving, coding and description of multimedia data, content adaptation, and interactive (mobile) multimedia applications.", "Dr. Van de Walle received several awards for his work, e.g., the ISO Award for Outstanding Technical Contributions, nominated by MPEG. He is a member of the Board of Directors at Ghent University and the member of the IBBT Governing Board."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Decoding", "Estimation", "Encoding", "Indexes", "Delay", "Correlation", "Codecs"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video streaming", "decoding", "delays", "encoding", "estimation theory", "feedback", "video coding"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["encoder buffer requirements", "distributed video coding", "feedback channel constraints", "feedback-free DVC systems", "encoder complexity", "compression performance", "video streaming", "Wyner-Ziv frame", "decoded WZ frames", "expected rate overhead", "end-to-end delay"]}, {"type": "Author Keywords ", "kwd": ["rate estimation", "Distributed video coding", "feedback channel"]}],"citations":[{"ieee-citations":[{"authors":["Huynh Van Luong","Soren Forchhammer","Jurgen Slowack","Jan De Cock","Rik Van de Walle"],"article name":"Adaptive mode decision with residual motion compensation for distributed video coding","Journal Name":"Picture Coding Symposium (PCS) 2013","vol":"none","pp.": "153-156","Year": "2013","ISSN":"none","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Yonghong Kuo","Pan Gao","Jian Chen"],"article name":"Distributed video coding with limited feedback requests","Journal Name":"Multimedia Tools and Applications","vol":"none","pp.":"none","Year": "2014","ISSN": "1380-7501","ISBN":"none"},{"authors":["Bingyu Ji","Ran Li","Changan Wu"],"article name":"Rate-Distortion and Rate-Energy-Distortion Evaluations of Compressive-Sensing Video Coding","Journal Name":"International Journal of Digital Multimedia Broadcasting","vol.": "2017","pp.": "1","Year": "2017","ISSN": "1687-7578","ISBN":"none"},{"authors":["Chang Lee"],"article name":"Efficient bit rate control method for distributed video coding system","Journal Name":"EURASIP Journal on Advances in Signal Processing","vol.": "2012","pp.": "244","Year": "2012","ISSN": "1687-6180","ISBN":"none"},{"authors":["Daniel J Louw","Haruhiko Kaneko"],"article name":"Suppressing feedback in a distributed video coding system by employing real field codes","Journal Name":"EURASIP Journal on Advances in Signal Processing","vol.": "2013","pp.": "181","Year": "2013","ISSN": "1687-6180","ISBN":"none"},{"authors":["Ruisong Han","Wei Yang","Kaiming You"],"article name":"MB-OFDM-UWB Based Wireless Multimedia Sensor Networks for Underground Coalmine: A Survey","Journal Name":"Sensors","vol.": "16","pp.": "2158","Year": "2016","ISSN": "1424-8220","ISBN":"none"},{"authors":["Huynh Van Luong","ren Forchhammer","rgen Slowack","Jan De Cock","Rik Van de Walle"],"article name":"Adaptive mode decision with residual motion compensation for distributed video coding","Journal Name":"APSIPA Transactions on Signal and Information Processing","vol.": "4","pp.":"none","Year": "2015","ISSN": "2048-7703","ISBN":"none"},{"authors":["Sang-Uk Park","Young-Yoon Lee","Chang-Su Kim","Sang-Uk Lee"],"article name":"CDV-DVC: Transform-domain distributed video coding with multiple channel division","Journal Name":"Journal of Visual Communication and Image Representation","vol.": "24","pp.": "534","Year": "2013","ISSN": "10473203","ISBN":"none"}]}]}