{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 1, "citationCountPatent": 0, "totalDownloads": 503},"doi": "10.1109/TCSVT.2011.2168175","title": "Transcoding From Hybrid Nonscalable to Wavelet-Based Scalable Video Codecs","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "Scalable video coding (SVC) enables low complexity adaptation of compressed video, providing an efficient solution for content delivery through heterogeneous networks and to diverse displays. However, legacy video and most commercially available content capturing devices use conventional nonscalable coding, e.g., H.264/AVC. This paper proposes an efficient transcoder from H.264/AVC to a wavelet-based SVC. It aims at exploiting the advantages offered by fine granularity SVC technology when dealing with conventional coders and legacy video. The proposed transcoder was developed to cope with important functionalities of H.264/AVC, such as flexible reference frame (RF) selection. It is able to work with different coding configurations of H.264/AVC, including IPP or IBBP with multiple RFs. Moreover, many of the techniques presented in this paper are generic in the sense that they can be used for transcoding with many popular wavelet-based and hybrid-based video coding architectures. To reduce the transcoder's complexity, motion information and residual data extracted from a compressed H.264/AVC stream are exploited. Experimental results show a very good performance of the proposed transcoder in terms of decoded video quality and system complexity.","authors": [{"name": "Eduardo Peixoto", "affiliation": "School of Electronic Engineering and Computer Science, Queen Mary University of London, London, U.K.", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6019028/6019028-photo-1-small.gif", "p": ["Eduardo Peixoto (S'09) was born in Brasilia, Brazil. He received the Engineering and M.S. degrees from Universidade de Brasilia, Brasilia, in 2005 and 2008, respectively. He is currently pursuing the Ph.D. degree from Queen Mary, University of London, London, U.K.", "In 2008, he was a Research Associate with the DSP Research Group, Universidade de Brasilia. His current research interests include video transcoding, distributed video coding, and scalable video coding."]}}, {"name": "Toni Zgaljic", "affiliation": "School of Electronic Engineering and Computer Science, Queen Mary University of London, London, U.K.", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6019028/6019028-photo-2-small.gif", "p": ["Toni Zgaljic received the Dipl.Ing. degree in electrical engineering from the Faculty of Electrical Engineering and Computing, University of Zagreb, Zagreb, Croatia, and the Ph.D. degree from Queen Mary, University of London, London, U.K., in 2003 and 2008, respectively.", "He is currently a Research Assistant with the Multimedia and Vision Group, Queen Mary. His current research interests include scalable video coding and transmission, universal multimedia access, surveillance centric coding, and video transcoding. He has published more than 20 technical papers in these areas, including chapters in books. He was a contributor to the European Project aceMedia and the Surveillance Centric Coding Project—a joint project between United Technology Research Centre and Queen Mary."]}}, {"name": "Ebroul Izquierdo", "affiliation": "School of Electronic Engineering and Computer Science, Queen Mary University of London, London, U.K.", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6019028/6019028-photo-3-small.gif", "p": ["Ebroul Izquierdo (M'95–SM'03) received the M.S. degree and the Ph.D. (rerum naturalium) degree from the Humboldt University, Berlin, Germany.", "He is the Chair of the Multimedia and Computer Vision and the Head of the Multimedia and Vision Group, School of Electronic Engineering and Computer Science, Queen Mary, University of London, London, U.K. He has been a Senior Researcher with the Heinrich-Hertz Institute for Communication Technology, Berlin, and the Department of Electronic Systems Engineering, University of Essex, Essex, U.K. He holds several patents in the area of multimedia signal processing and has published over 450 technical papers including chapters in books.", "Prof. Izquierdo is a Chartered Engineer, a Fellow of the Institution of Engineering and Technology (IET), a member of the British Machine Vision Association, Past Chairman of the IET Professional Network on Information Engineering, a member of the Visual Signal Processing and Communication Technical Committee of the IEEE Circuits and Systems Society, and a member of the Multimedia Signal Processing Technical Committee. He has also been an Associate and Guest Editor of several relevant journals in the field including the IEEE Transactions on Circuits and Systems for Video Technology, the EURASIP Journal on Image and Video processing, the Elsevier journal Signal Processing: Image Communication, the EURASIP Journal on Applied Signal Processing, the IEEE Proceedings on Vision, Image, and Signal Processing, the Journal of Multimedia Tools and Applications, and the Journal of Multimedia."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Codecs", "Transcoding", "Optimization", "Scalability", "Radio frequency", "Bit rate"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video coding", "data compression", "transcoding"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["hybrid-based video coding architecture", "transcoding", "wavelet-based scalable video codecs", "scalable video coding", "low complexity adaptation", "compressed video", "content delivery", "heterogeneous networks", "diverse displays", "legacy video", "conventional nonscalable coding", "H.264/AVC", "wavelet-based SVC", "flexible reference frame selection"]}, {"type": "Author Keywords ", "kwd": ["transcoding", "Scalable video coding (SVC)"]}],"citations":[{"ieee-citations":[{"authors":["Tamer Shanableh","Eduardo Peixoto","Ebroul Izquierdo"],"article name":"MPEG-2 to HEVC Video Transcoding With Content-Based Modeling","Journal Name":"Circuits and Systems for Video Technology IEEE Transactions on","vol.": "23","pp.": "1191-1196","Year": "2013","ISSN": "1051-8215","ISBN":"none"}]},{"nonieee-citations":[]}]}