{"issn": [{"format": "Print ISSN", "value": "0095-9804"}],"metrics": {"citationCountPaper": 0, "citationCountPatent": 0, "totalDownloads": 72},"doi": "10.1109/JAIEE.1930.6538054","title": "Abridgment of transient torque-angle characteristics of synchronous machines","publicationTitle": "Journal of the A.I.E.E.","abstract": "Mechanical oscillations of synchronous motors following the application of abrupt shaft loads have not heretofore been easily calculated for cases of large angular swings, taking into account the damping currents in the rotor, except by tedious point-by-point methods. The chief difficulty has been due to the form of the basic differential equation upon which the solution of hunting problems depends. Within the last few years, Doctor V. Bush and others at the Massachusetts Institute of Technology have devised the integraph which is capable of solving the equations of the synchronous motor. Into the integraph are put curves representing the non-linear differential equations and the boundary conditions. The desired results come from the integraph as curves. In this paper, the problem of sudden load on the non-salient pole alternator is solved by the integraph for enough different conditions so that the performance of practically any machine of this type may easily be predicted from the compiled results. Knowing the moments of inertia of the machine and its load, the characteristics of the machine running as a synchronous motor and as an induction motor, the maximum amount of sudden load for which the machine will remain in synchronism may be determined for different values of initial load. Other curves give the maximum angle of the first swing of the rotor and the time interval for the rotor to change from Us initial position to this maximum angle. The simplest type of equation representing an ideal synchronous machine is solved in this paper. The integraph is capable of solving problems of a much more complicated nature than those presented. The more complicated problems pertaining to machines with unsymmetrical excitation and salient-pole rotors will probably be the subjects of future papers.","authors": [{"name": "W. V. Lyon", "affiliation": "Massachusetts Institute of Technology, Cambridge, Mass."}, {"name": "H. E. Edgerton", "affiliation": "Massachusetts Institute of Technology, Cambridge, Mass."}],"citations":[null]}