{"issn": [{"format": "Print ISSN", "value": "0095-9804"}],"metrics": {"citationCountPaper": 0, "citationCountPatent": 0, "totalDownloads": 40},"doi": "10.1109/JAIEE.1930.6538047","title": "Abridgment of thyrite: A new material for lightning arresters","publicationTitle": "Journal of the A.I.E.E.","abstract": "A new material has been developed which is peculiarly adapted for use in lightning arresters. Physically, it is similar to dry process porcelain, and it can be made in any shape that can be successfully moulded. The manufacturing processes have been perfected so that the electrical and mechanical characteristics can be duplicated or varied as desired within practical limits. This material, which is called thyrite, does not follow Ohm's law, for each time the voltage is doubled, the current increases 12.6 times. The ratio of change of current to change in voltage is constant over ranges of current of 10,000,000 to one. This means that the resistance decreases as the current and voltage increase. The resistance at any particular value of voltage or current is fixed by the physical dimensions of the piece. It is slightly lowered at high temperatures but returns to normal when cooled. The resistance does not depend upon the rapidity of current or voltage change and it is unaffected by long service. Because of the definite characteristics of thyrite, the action of lightning arresters can, for the first time, be accurately calculated. Thyrite is now being used experimentally in three types of lightning arresters. The station type is made in 11.5-kv. sections, each containing its own gap unit so that no series arrester gap is required. These gap units have the desirable properly of sparking over at practically the same voltage, irrespective of wave front. The 11.5-kv. sections are assembled in the field in the same manner as pedestal insulators. The distribution arresters are smaller than those of the station type and have but one-fourth of the impulse current carrying capacity. For discharge currents up to 1000 amperes, neither of the arresters will allow more than 2.8 times the arrester rating in crest volts to appear across it. The third type of arrester is incorporated directly in the transmission line suspension insulators, and is designed to absorb a considerable portion of abnormal surge energy as well as to protect the insulators from flashover. This new line of lightning arresters has the following advantages: 1. Ample protection for all insulation. 2. Conservative factor of safety from failure. 3. Permanence. 4. Small size and weight. 5. Low installation cost. 6. Invariable characteristics and predictability of results for any given condition. 7. Characteristics which can be measured by the user.","authors": [{"name": "K. B. Mc Eachron", "affiliation": "Research Engineer, General Electric Co., Pittsfield, Mass."}],"citations":[null]}