{"issn": [{"format": "Print ISSN", "value": "0095-9804"}],"metrics": {"citationCountPaper": 0, "citationCountPatent": 0, "totalDownloads": 11},"doi": "10.1109/JAIEE.1930.6538049","title": "Abridgment of fundamental plan of power supply in the Chicago district","publicationTitle": "Journal of the A.I.E.E.","abstract": "This paper describes the design of a large metropolitan system, interconnected with a surrounding high-voltage transmission system. The region included in the scheme comprises an area of 6000 square miles, including the City of Chicago and is served by several companies with systems so interconnected as to form a consolidated scheme of generation and distribution. The physical limitations in locating generating stations within the metropolitan area at the load centers, and the economic advantage of locating stations for the greatest benefit to the group as a whole, makes this arrangement desirable. However, it imposes the necessity of transmitting large blocks of energy and a very free interchange of reserve capacity over the entire system. The system described as contrasted with the &#x201C;loose linked&#x201D; and &#x201C;synchronized at the load&#x201D; types is solidly interconnected, and because of the nature of its tie connections, it has inherently a very high degree of stability. The service standards of this system require the greatest possible reliability and continuity of supply. The general plan of the system, method of operation, and provisions for protection from the effects of excessive short-circuit currents, are described. In the future development of this system, it is probable that within the next few years a considerable proportion of the total supply to the densely loaded portion within the City of Chicago, will come from stations located quite remote to the load. Energy will be transmitted into the city over a network of transmission lines at voltages from 66 to 220 kv. or higher.","authors": [{"name": "George M. Armbrust", "affiliation": "Commonwealth Edison Company, Chicago, Ill."}, {"name": "Titus G. LeClair", "affiliation": "Commonwealth Edison Company, Chicago, Ill."}],"citations":[null]}