{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 2, "citationCountPatent": 1, "totalDownloads": 549},"doi": "10.1109/TCSVT.2011.2177939","title": "Intracoding and Refresh With Compression-Oriented Video Epitomic Priors","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "In video compression, intracoding plays an important role in terms of coding efficiency and error resilience and has been an attractive research topic since the standardization of H.264/AVC. In this paper, we propose a high-performance intracoding scheme with the help of epitomic priors. Different from intracoding in H.264/AVC and other video standards, we construct image epitomes as coding priors and use them to generate predictions of intrablocks at the encoder. In addition, we losslessly code and transmit the image epitomes to the decoder. We perform compression-oriented video epitomic analysis and search for the best epitomic priors by using the expectation maximization algorithm. The resulting image epitomes for a video sequence can be viewed as the base layer in spatially scalable video coding. Experiments show that our proposed intracoding scheme improves the state of the art by an average of 0.53 dB in PSNR. Simulations under a packet loss environment also demonstrate that intrarefresh with epitomic priors outperforms random intrarefresh by up to 2 dB, leading to better subjective quality.","authors": [{"name": "Qijun Wang", "affiliation": "National Engineering Research Center on Multimedia Software and the School of Computer Science, Wuhan University, Wuhan, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6193248/6093956/6093956-photo-1-small.gif", "p": ["Qijun Wang received the B.S. and M.S. degrees in graphic communication and the Ph.D. degree in electrical engineering, all from Wuhan University, Wuhan, China, in 2005, 2007, and 2011, respectively.", "He was with the School of Computer Science, Wuhan University. He is currently with the No. 38 Institute, China Electronics Technology Group Corporation, Hefei, China. His current research interests include video coding and streaming."]}}, {"name": "Ruimin Hu", "affiliation": "National Engineering Research Center on Multimedia Software and the School of Computer Science, Wuhan University, Wuhan, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6193248/6093956/6093956-photo-2-small.gif", "p": ["Ruimin Hu (M'09–SM'10) received the B.S. and M.S. degrees in communication and electronic system from the Nanjing University of Posts and Telecommunications, Nanjing, China, in 1984 and 1990, respectively, and the Ph.D. degree in communication and electronic systems from the Huazhong University of Science and Technology, Wuhan, China, in 2000.", "He is currently a Professor with Wuhan University, Wuhan. He also serves as the Associate Dean of the School of Computer Science and the Director of the National Engineering Research Center on Multimedia Software. His current research interests include audio and video signal processing, multimedia network communication, security and surveillance techonology, digital multimedia content management, and protection."]}}, {"name": "Zhongyuan Wang", "affiliation": "National Engineering Research Center on Multimedia Software and the School of Computer Science, Wuhan University, Wuhan, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6193248/6093956/6093956-photo-3-small.gif", "p": ["Zhongyuan Wang received the Ph.D. degree in communication and information systems from Wuhan University, Wuhan, China, in 2008.", "He is currently an Associate Professor with the School of Computer Science, Wuhan University. He is currently directing two projects funded by the National Natural Science Foundation Program of China. His current research interests include video compression, image processing, and multimedia communications."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Image coding", "Encoding", "Streaming media", "Decoding", "Coherence", "Video coding", "Visualization"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video coding", "expectation-maximisation algorithm"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["packet loss environment", "compression-oriented video epitomic priors", "video compression", "coding efficiency", "error resilience", "attractive research topic", "H.264/AVC", "video standards", "image epitomes", "coding priors", "intrablocks", "encoder", "decoder", "compression-oriented video epitomic analysis", "expectation maximization algorithm", "video sequence", "scalable video coding", "intracoding scheme"]}, {"type": "Author Keywords ", "kwd": ["spatial scalability", "Epitomic analysis", "intracoding", "intrarefresh", "scalable video coding"]}],"citations":[{"ieee-citations":[{"authors":["Chia-Wen Lin","Chia-Ming Tsai","Po-Chun Chen"],"article name":"Low-Overhead Content-Adaptive Spatial Scalability for Scalable Video Coding","Journal Name":"Selected Topics in Signal Processing IEEE Journal of","vol.": "7","pp.": "1084-1095","Year": "2013","ISSN": "1932-4553","ISBN":"none"},{"authors":["Martin Alain","Christine Guillemot","Dominique Thoreau","Philippe Guillotel"],"article name":"Scalable Image Coding Based on Epitomes","Journal Name":"Image Processing IEEE Transactions on","vol.": "26","pp.": "3624-3635","Year": "2017","ISSN": "1057-7149","ISBN":"none"}]},{"nonieee-citations":[]}]}