{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 14, "citationCountPatent": 0, "totalDownloads": 949},"doi": "10.1109/TCSVT.2011.2168289","title": "Efficient Low-Delay Distributed Video Coding","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "Distributed video coding (DVC) is a video coding paradigm that allows for a low-complexity encoding process by exploiting the temporal redundancies in a video sequence at the decoder side. State-of-the-art DVC systems exhibit a structural coding delay since exploiting the temporal redundancies through motion-compensated interpolation requires the frames to be decoded out of order. To alleviate this problem, we propose a system based on motion-compensated extrapolation that allows for efficient low-delay video coding with low complexity at the encoder. The proposed extrapolation technique first estimates the motion field between the two most recently decoded frames using the Lucas-Kanade algorithm. The obtained motion field is then extrapolated to the current frame using an extrapolation grid. The proposed techniques are implemented into a novel architecture featuring hybrid block-frequency Wyner-Ziv coding as well as mode decision. Results show that having references from both temporal directions in interpolation provides superior rate-distortion performance over a single temporal direction in extrapolation, as expected. However, the proposed extrapolation method is particularly suitable for low-delay coding as it performs better than H.264/AVC intra, and it is even able to outperform the interpolation-based DVC codec from DISCOVER for several sequences.","authors": [{"name": "Jozef Skorupa", "affiliation": "Multimedia Lab, Ghent University, Ledeberg-Ghent, Belgium", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6020767/6020767-photo-1-small.gif", "p": ["Jozef Škorupa received the Masters degree in mathematics from Comenius University, Bratislava, Slovakia, in 2004, and the Ph.D. degree in computer science engineering from Ghent University, Ghent, Belgium, in 2011.", "In 2006, he joined the Multimedia Lab, Ledeberg-Ghent, Belgium. His current research interests include distributed video compression."]}}, {"name": "J&#x00FC;rgen Slowack", "affiliation": "Multimedia Lab, Ghent University, Ledeberg-Ghent, Belgium", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6020767/6020767-photo-2-small.gif", "p": ["Jürgen Slowack received the M.Sc. and Ph.D. degrees in computer engineering from Ghent University, Ghent, Belgium, in 2006 and 2010, respectively.", "He is currently a Post-Doctoral Researcher with the Multimedia Lab, a research group part of the Department of Electronics and Information Systems, Ghent University, and part of the Interdisciplinary Institute for Broadband Technology (IBBT), Ghent. His current research interests include distributed video coding and video compression and analysis in general."]}}, {"name": "Stefaan Mys", "affiliation": "Addestino, Ghent, Belgium", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6020767/6020767-photo-3-small.gif", "p": ["Stefaan Mys received the Masters degree in computer science from Ghent University, Ghent, Belgium, in 2005.", "From 2005 to 2010, he was a Researcher with the Multimedia Lab, Department of Electronics and Information Systems, Ghent University. In June 2010, he left the Multimedia Lab and is currently a Consultant with Addestino, Ghent. His main research interests include video coding, in particular error resilient video coding and distributed video coding."]}}, {"name": "Nikos Deligiannis", "affiliation": "Department of Electronics and Informatics, Faculty of Engineering Sciences, Vrije Universiteit Brussel, Brussels, Belgium", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6020767/6020767-photo-4-small.gif", "p": ["Nikos Deligiannis (S'08–M'10) received the degree in electrical and computer engineering from the University of Patras, Patras, Greece, in 2006. Since 2007, he has been pursuing the Ph.D. degree in distributed video coding for wireless lightweight applications from Vrije Universiteit Brussel, Brussels, Belgium.", "From December 2006 to September 2007, he was a Researcher with the Wireless Telecommunications Laboratory, University of Patras. He joined the Department of Electronics and Informatics, Faculty of Engineering Sciences, Vrije Universiteit Brussel, in October 2007. His current research interests include statistical channel modeling, multimedia coding, distributed source coding, multiple description coding, wireless cellular networks, and location positioning."]}}, {"name": "Jan De Cock", "affiliation": "Multimedia Lab, Ghent University, Ledeberg-Ghent, Belgium", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6020767/6020767-photo-5-small.gif", "p": ["Jan De Cock (M'06) received the M.S. and Ph.D. degrees in engineering from Ghent University, Ghent, Belgium, in 2004 and 2009, respectively.", "Since 2004, he has been with the Multimedia Lab, Ghent University, and with the Interdisciplinary Institute for Broadband Technology (IBBT). His current research interests include (high-efficiency) video compression and transcoding, scalable video coding, and multimedia applications.", "Dr. De Cock received the Post-Doctoral Research Fellowship from the Agency for Innovation by Science and Technology in 2010."]}}, {"name": "Peter Lambert", "affiliation": "Multimedia Lab, Ghent University, Ledeberg-Ghent, Belgium", "bio": {"p": ["Peter Lambert (M–07) received the Masters degree in science (mathematics) and in applied informatics from Ghent University, Ghent, Belgium, in 2001 and 2002, respectively, and the Ph.D. degree in computer science from the same university in 2007.", "He is currently a Lecturer and Technology Developer with the Multimedia Lab, Ghent University. Since 2010, he is a part-time Lecturer with the Multimedia Lab in the field of multimedia techniques. His current research interests include (mobile) multimedia applications, (scalable and 3-D) media coding technologies, and multimedia content adaptation."]}}, {"name": "Christos Grecos", "affiliation": "School of Computing, University of the West of Scotland, Paisley, Scotland, U.K.", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6020767/6020767-photo-7-small.gif", "p": ["Christos Grecos (M'01) received the Ph.D. degree in image/video coding algorithms from the University of Glamorgan, Glamorgan, U.K., in 2001.", "He is currently a Professor in visual communications standards and the Head of the School of Computing, University of the West of Scotland (UWS), Paisley, Scotland, U.K. He leads the Audio-Visual Communications and Networks Research Group, UWS. He was an Associate Professor at Loughborough and with Central Lancashire University, Preston, U.K., prior to his appointment with UWS. His current research interests include image/video compression standards, image/video processing and analysis, image/video networking, and computer vision. He has published over 100 research papers in top-tier international publications, including a number of IEEE transactions and SPIE conferences, on these topics.", "Dr. Grecos is on the editorial boards or has served as a Guest Editor for numerous international journals and has been invited to give talks in various international conferences. He was the Principal Investigator for several national or international projects funded by the U.K. Engineering and Physical Sciences Research Councils (EPSRC) or EU. He is a Senior Member of SPIE, a member of the U.K. EPSRC Peer Review College, and a reviewer of grants for the Greek Ministry of Education."]}}, {"name": "Adrian Munteanu", "affiliation": "Department of Electronics and Informatics, Faculty of Engineering Sciences, Vrije Universiteit Brussel, Brussels, Belgium", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6020767/6020767-photo-8-small.gif", "p": ["Adrian Munteanu (M'07) was born in Constanta, Romania, in 1970. He received the M.Sc. degree in electronics and telecommunications from the Politehnica University of Bucharest, Bucharest, Romania, in 1994, the M.Sc. degree in biomedical engineering from the Technical University of Patras, Patras, Greece, in 1996, and the Ph.D. degree in applied sciences from Vrije Universiteit Brussel (VUB), Brussels, Belgium, in 2003.", "From 2004 to 2010, he was a Post-Doctoral Fellow with the Fund for Scientific Research—Flanders (FWO), Brussels, and since 2007, he is a Professor with the Department of Electronics and Informatics, Faculty of Engineering Sciences, VUB. He is the author of more than 200 journal and conference publications, patent applications and contributions to standards, of which more than 40 are journal publications and contributions to books. His current research interests include scalable image and video coding, wavelet-based coding of images, video and 3-D models, coding of volumetric datasets, scalable coding of meshes, multiresolution analysis, joint source and channel coding, multiple description coding, and distributed source coding.", "Dr. Munteanu was the recipient of the 2004 BARCO-FWO Prize for his Ph.D. work."]}}, {"name": "Rik Van de Walle", "affiliation": "Multimedia Lab, Ghent University, Ledeberg-Ghent, Belgium", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6020767/6020767-photo-9-small.gif", "p": ["Rik Van de Walle (M'99) received the M.Sc. and Ph.D. degrees in engineering from Ghent University, Ghent, Belgium, in 1994 and 1998, respectively.", "After a visiting scholarship with the University of Arizona, Tucson, he returned to Ghent University, where he became a Professor of multimedia systems and applications, and the Head of the Multimedia Lab. His current research interests include multimedia content delivery, presentation and archiving, coding and description of multimedia data, content adaptation, and interactive (mobile) multimedia applications. The Multimedia Lab is one of the partners of the Interdisciplinary Institute for Broadband Technology (IBBT), which was founded by the Flemish Government in 2004."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Extrapolation", "Interpolation", "Encoding", "Decoding", "Delay", "Complexity theory", "Video coding"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video coding", "computational complexity", "extrapolation", "interpolation", "motion compensation"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["hybrid block-frequency Wyner-Ziv coding", "low-delay distributed video coding", "video coding paradigm", "low-complexity encoding", "temporal redundancies", "video sequence", "structural coding delay", "motion-compensated interpolation", "motion-compensated extrapolation", "Lucas-Kanade algorithm"]}, {"type": "Author Keywords ", "kwd": ["motion-compensated extrapolation", "Distributed video coding (DVC)", "low-delay coding"]}],"citations":[{"ieee-citations":[{"authors":["Matteo Salmistraro","ren Forchhammer"],"article name":"Low delay Wyner-Ziv coding using optical flow","Journal Name":"Image Processing (ICIP) 2014 IEEE International Conference on","vol":"none","pp.": "5591-5595","Year": "2014","ISSN": "1522-4880","ISBN":"none"},{"authors":["Gengfeng Qiu","Shaoshuai Gao","Guofang Tu"],"article name":"Low-complexity low-delay distributed video coding","Journal Name":"Digital Signal Processing (DSP) 2013 18th International Conference on","vol":"none","pp.": "1-6","Year": "2013","ISSN": "2165-3577","ISBN":"none"},{"authors":["Jeffrey J. Micallef","Reuben A. Farrugia","Carl James Debono"],"article name":"Correlation Noise-Based Unequal Error Protected Rate-Adaptive Codes for Distributed Video Coding","Journal Name":"Circuits and Systems for Video Technology IEEE Transactions on","vol.": "24","pp.": "127-140","Year": "2014","ISSN": "1051-8215","ISBN":"none"},{"authors":["Zilin Lee","Chun-Ling Yang","Z. Jane Wang"],"article name":"Least square filtering for low-delay transform domain Wyner-Ziv video coding","Journal Name":"Intelligent Signal Processing and Communications Systems (ISPACS) 2012 International Symposium on","vol":"none","pp.": "527-530","Year": "2012","ISSN":"none","ISBN":"none"},{"authors":["Huynh Van Luong","Lars Lau Raket","Xin Huang","ren Forchhammer"],"article name":"Side Information and Noise Learning for Distributed Video Coding Using Optical Flow and Clustering","Journal Name":"Image Processing IEEE Transactions on","vol.": "21","pp.": "4782-4796","Year": "2012","ISSN": "1057-7149","ISBN":"none"},{"authors":["Chen Zhao","Siwei Ma","Jian Zhang","Ruiqin Xiong","Wen Gao"],"article name":"Video Compressive Sensing Reconstruction via Reweighted Residual Sparsity","Journal Name":"Circuits and Systems for Video Technology IEEE Transactions on","vol.": "27","pp.": "1182-1195","Year": "2017","ISSN": "1051-8215","ISBN":"none"},{"authors":["Guanhong Lai","Yu Liu","Quan Wang","Lin Zhang"],"article name":"A channel adaptive video broadcast scheme based on analog coding and delivery","Journal Name":"Wireless Personal Multimedia Communications (WPMC) 2014 International Symposium on","vol":"none","pp.": "112-117","Year": "2014","ISSN": "1882-5621","ISBN":"none"},{"authors":["Abdulah Jeza Aljohani","Soon Xin Ng","Lajos Hanzo"],"article name":"Distributed Source Coding and Its Applications in Relaying-Based Transmission","Journal Name":"Access IEEE","vol.": "4","pp.": "1940-1970","Year": "2016","ISSN": "2169-3536","ISBN":"none"},{"authors":["Shuai Li","Joohee Kim","Ken Choi","Yun Sik Lee"],"article name":"Distributed video coding with background modeling for wireless capsule endoscopy applications","Journal Name":"SoC Design Conference (ISOCC) 2015 International","vol":"none","pp.": "163-165","Year": "2015","ISSN":"none","ISBN":"none"},{"authors":["Guanhong Lai","Yu Liu","Lin Zhang"],"article name":"Distributed Realcast: A Channel-Adaptive Video Broadcast Delivery Scheme","Journal Name":"Vehicular Technology Conference (VTC Fall) 2014 IEEE 80th","vol":"none","pp.": "1-5","Year": "2014","ISSN":"none","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Chang-Ming Lee","Zhi-Heng Chiang","Dung-Chan Tsai","Wen-Nung Lie"],"article name":"Distributed video coding with block mode decision to reduce temporal flickering","Journal Name":"EURASIP Journal on Advances in Signal Processing","vol.": "2013","pp.": "177","Year": "2013","ISSN": "1687-6180","ISBN":"none"},{"authors":["rgen Slowack","Rik Van de Walle"],"Article Name":"none","Journal Name":"none","vol":"none","pp.": "27","Year": "2013","ISSN":"none","ISBN": "978-1-4398-7998-6"},{"authors":["Yonghong Kuo","Kai Wu","Jian Chen"],"article name":"A scheme for distributed compressed video sensing based on hypothesis set optimization techniques","Journal Name":"Multidimensional Systems and Signal Processing","vol":"none","pp.":"none","Year": "2015","ISSN": "0923-6082","ISBN":"none"},{"authors":["Catarina Brites","o Ascenso","Fernando Pereira"],"article name":"Side information creation for efficient Wyner–Ziv video coding: Classifying and reviewing","Journal Name":"Signal Processing: Image Communication","vol":"none","pp.":"none","Year": "2013","ISSN": "09235965","ISBN":"none"}]}]}