{"issn": [{"format": "Print ISSN", "value": "0095-9804"}],"metrics": {"citationCountPaper": 0, "citationCountPatent": 0, "totalDownloads": 339},"doi": "10.1109/JAIEE.1930.6538219","title": "Abridgment of generalized theory of electrical machinery","publicationTitle": "Journal of the A.I.E.E.","abstract": "In the following pages, electrical machinery is analyzed from a new point of view. Analytical quantities, like magnetizing current, armature reaction, leakage flux, transient reactance are not introduced; only such quantities are used as actually exist in the machine at one particular load. Thereby the theory of electrical machinery is expressed in terms of the minimum possible number of quantities. No hypothetical currents or fluxes are used and no actual physical quantity is left out. The concept of &#x201C;free energy,&#x201D; used in thermodynamics, is introduced and generalized. The criterion of good design of all electrical machines is expressed by a constant, the &#x201C;thermodynamic efficiency&#x201D; which gives a measure of the effective utilization of iron and space for the transformation of energy. This constant plays a most fundamental role in the steady and transient behavior of the machine. A method is given by which the direction of flow of energy between different parts of any complicated machine can easily be read from the diagrams. The theory of constant-potential and constant-current electromagnets is used as a stepping stone to show that the theory of the polyphase alternator is identical with the theory of the constant-potential polyphase transformer if flux linkages and magnetomotive forces are interchanged. The circle diagrams of the transformer and the alternator are developed, as well as the elliptical locus diagram of the alternator with salient poles. Problems in the sudden short circuit and the sudden load variation of the polyphase alternator are also solved. Blondel's diagram for the circular locus of the synchronous motor is derived in a more extended form together with its elliptical locus with salient poles. The elliptical loci of the reaction machine and the synchronous converter are also developed. The circular locus for the polyphase induction motor, the single-phase induction motor and the repulsion motor are derived. The method of attack used in the paper is applicable not only to circular and elliptical loci, but also to loci of higher curves. The method is used to develop the complete theory and locus diagram of the double squirrel-cage induction motor and the split-phase induction motor with or without condenser (or the so-called condenser motor). Besides those mentioned above, the writer has also developed with this method the loci of commutator machines such as the polyphase induction motor with commutator rotor, the series polyphase and the shunt polyphase commutator motors, and the compensated series motor, including the effect of the short-circuited brush currents, also the locus of induction motors in cascade. An extension of the concept of free energy establishes the four-line vector diagram and the locus characteristics of any transmission system or any four-terminal network, showing the voltages and currents at both sending and receiving ends. Due to the length of the article, however, their discussion does not appear here. All locus diagrams show the speed and the torque at all loads. They also show the magnitude and phase relation of all actual currents, fluxes, and e. m. fs. A relation of the form r/x is found for the ratio of the work done to the free energy and this one simple formula is sufficient to find the locus diagram and the complete performance of all electrical machinery and transmission lines. It is the only formula used in the paper. In the appendix, the relation of the design constants used to the constants of other methods is shown.","authors": [{"name": "Gabriel Kron", "affiliation": "The Lincoln Electric Company, Cleveland, Ohio"}],"citations":[null]}