{"issn": [{"format": "Print ISSN", "value": "0095-9804"}],"metrics": {"citationCountPaper": 0, "citationCountPatent": 0, "totalDownloads": 32},"doi": "10.1109/JAIEE.1930.6538221","title": "Abridgment of extinction of a long A-C. arc","publicationTitle": "Journal of the A.I.E.E.","abstract": "The extinction of an a-c. arc is analyzed as depending on two factors &#x2014; the rate of recovery of dielectric strength of the arc space after current zero, and the rate at which voltage tending to re-ignite the arc is applied by the external circuit. In the short arc, most of the recovered dielectric strength resides in a deionized layer next to the cathode, but in the long arc, the rest of the arc space contributes largely to the dielectric strength. The breakdown gradient of the still ionized arc space is defined, and using a thermal ionization theory, a formula for growth of breakdown gradient is derived. The extinction of long a-c. arcs in the open is greatly influenced by the sectional area which the arc stream has at current zero. By confining arcs to slots and holes, the rate of deionization at current zero is greatly increased, and so large voltages per cm. of arc can be interrupted. A gas blast passing turbulently through an arc stream greatly accelerates deionization at current zero and so is effective in increasing the capacity of the a-c. arc to interrupt high-voltage circuits. The expulsion fuse is an example of a gas blast circuit interrupter, the gas blast resulting from the decomposition of the fiber fuse case. The oil circuit breaker is also a gas blast circuit interrupter, the blast arising from the gases produced by the decomposition of the oil. Means which increase the rate of oil decomposition improve the operation of the breaker. The magnetic blow-out in oil breakers is effective by causing an increased rate of oil decomposition. Electrostatic unbalance may lower the volts per cm. which a long arc can interrupt. The use of static balancing devices may then become advisable.","authors": [{"name": "J. Slepian", "affiliation": "Consulting Research Engineer, Westinghouse Elec. &#x0026; Mfg. Co., East Pittsburgh, Pa."}],"citations":[null]}