{"issn": [{"format": "Print ISSN", "value": "0095-9804"}],"metrics": {"citationCountPaper": 0, "citationCountPatent": 0, "totalDownloads": 60},"doi": "10.1109/JAIEE.1930.6538210","title": "Abridgment of ventilation of revolving field salient-pole alternators","publicationTitle": "Journal of the A.I.E.E.","abstract": "The studies were made experimentally and analytically. In the experimental study, a model of hard wood with a multiple of vent ducts of normal width of 3/8 in. each in the stator, the slots and teeth being of approximately average width was used. A four-pole rotor is distinct from one of a large number of poles; consequently two rotors were built, one of four poles and one of twelve poles, the latter being considered as representative of the greater number. The end-bells and the imitations of the end windings were different for the two numbers of poles. In the test results given, data for only standard fiber wedges are included, but other forms were investigated. The vent fingers extended the full depth of the core, thereby enabling measurement to be made of the volume of air per vent per tooth, a rotating vane anemometer with a suitable funnel attachment being employed. The end-bells were solid, simulating standard construction, and the entrances to the two bells were joined to a common duct, in series with which was a thermal volume meter and an external blower of readily adjustable speed. (See Fig. 6.) Pressures were measured in the inner and in the outer end-bells. The rotor of the model was driven by a d-c. motor. with the power input measured. By this means, windage data were obtained and many of the results are included among other data on the curve sheets. For taking a characteristic pressure volume curve, the first reading was taken with the rotor running at a suitable arbitrary speed, with the external blower stationary and its entrance closed. The pressure was then generated by the poles acting as fans, and by the internal fans. For a number of succeeding readings, cardboard orifices with various size holes were placed over the external blower entrance, until that entrance was wide open. Subsequently, the external blower was started, and readings were taken with it running at a number of speeds. The form of curves thus obtained is shown in Fig. 9, the meaning of the three curves being there indicated. One of the limitations imposed by ventilation tests as usually made on an alternator is that only one point on the inner end-bell pressure &#x2014; volume curve is obtained &#x2014; nearly that at D in Fig. 9. The data thereby obtained do not enable the designer to estimate the volumes when conditions out of the ordinary are introduced; these would include, for example, the resistance of external ducts of a cooler, or of the influence of greater or less axial length, or of the effect of change in fan proportions, etc. The effects of these and the influence of the structural changes are treated in the paper. At one or more volumes on the pressure-volume curve, volume distribution curves were taken, and from data thereby obtained the influence of axial length was allowed for in the equations derived. In interpreting the results, it is important to eliminate some independent variables. Thus angular velocity may be eliminated, as the pressure is proportional to the square and the volume to the first power of the speed, the shape of volume distribution curve remaining the same. Ample experimental verification was obtained. Machine dimensions were more uncertain, and after many tests, it appears that for a given value of end-bell pressure and angular velocity, the volume distribution for the shorter machine is substantially the same as for the longer machine with the ends removed. As those tests were many, the number of vents, (or length of machine) is considered in the following list of the 11 structural independent variables: (1) Number of poles; (2) fans; (3) number of vents; (4) wedges in stator; (5) interpolar spaces; (6) fan seals; (7) fan shroud rings; (8) field coil braces; (9) plates in end-bells; (10) round and square pole corners; (11) location of fans, data for Nos. 4, 8, and 11 are not given in this paper, and not all for No. 2. There were several unusual results obtained, such as breaks in some of the pressure volume curves for four poles. Data are given for various fans, and also without fans, for both numbers of poles. For twelve poles centrifugal and axial (or &#x201C;scoop&#x201D;) fans were studied. In Appendixes 1 and 2, derivations of the more important equations for resistance and volume distribution are given. Appendix 3 covers a method for allowing for air flow through holes back of the core, for various fans and for external pressure drops. In Appendix 4 the equations for parabolic volume distribution and the method of least squares appear.","authors": [{"name": "Carl J. Fechheimer", "affiliation": "Power Engg., Dept., Westinghouse Elec. &#x0026; Mfg. Co., East Pittsburgh, Pa."}],"citations":[null]}