{"issn": [{"format": "Print ISSN", "value": "0095-9804"}],"metrics": {"citationCountPaper": 0, "citationCountPatent": 0, "totalDownloads": 76},"doi": "10.1109/JAIEE.1930.6538217","title": "Abridgment of loading transformers by temperature","publicationTitle": "Journal of the A.I.E.E.","abstract": "It is pointed out that safe loading of transformers by temperature requires not only an accurate knowledge of the thermal laws but also a knowledge of what is a safe temperature limit to be maintained continuously which condition, with the present method of limiting the load to nameplate rating, seldom, if ever, happens. In view of our present knowledge and experience, the author questions the advisability of loading transformers continuously up to the present A. I. E. E. limit of 105 deg. cent, hot-spot and argues for the establishment of a differential of 10 deg. cent, between the limit to be maintained continuously by means of overloads and the limit to be reached occasionally with rated load. It is shown that by the use of the thermal laws and without increasing the maximum or hot-spot temperature, transformers can be overloaded 1 per cent for each deg. cent, by which the ambient is below 30 deg. cent, (air) for self-cooled transformers; 25 deg. (water) for water-cooled transformers. The results of laboratory aging tests conducted on class A insulations in air and in oil are given. These tests show that the rate of aging is, roughly, double for each 8 deg. cent, increase in temperature. By the use of these data and by integrating the hot-spot temperature rise curve resulting from different load factors, the permissible peak load which causes the same deterioration in the insulation as a steady load is obtained. By combining the two rules, increased kv-a. with lower ambients and increased kv-a. with lower load factors, there is obtained a series of loading curves giving the permissible kv-a. capacities for differentcooling mediums and load factors. On an average, these curves are conservative because they apply to transformers having quite a wide range of characteristics which affect the temperature rise.","authors": [{"name": "V. M. Montsinger", "affiliation": "Development and Research Engineer, General Electric Company, Pittsfield, Mass."}],"citations":[null]}