{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 2, "citationCountPatent": 0, "totalDownloads": 515},"doi": "10.1109/TCSVT.2011.2158336","title": "VSYNC: Bandwidth-Efficient and Distortion-Tolerant Video File Synchronization","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "We introduce video-sync (VSYNC), a video file synchronization system that efficiently uses a bidirectional communications link to maintain up-to-date video sources at remote ends to a desired resolution and distortion level. By automatically detecting and transmitting only the differences between video files, VSYNC is able to avoid unnecessary re-transmission of the entire video when there are only minor differences between video copies. A hierarchical hashing scheme is designed to allow synchronization to within some user-defined distortion, white being rate-efficient and computationally tractable. Distributed video coding is used to realize further rate savings when transmitting video updates. VSYNC is bandwidth-efficient and is useful in many scenarios including video backup, video sharing, and video authentication applications. Experimental results show that rate-savings ranging from 2&#x00D7; to 10&#x00D7; can be obtained by VSYNC with about 10% of the frames being edited, compared to re- transmitting the compressed video or using a file synchronization utility such as rsync.","authors": [{"name": "Hao Zhang", "affiliation": "Department of Electrical Engineering and Computer Science, University of California at Berkeley, Berkeley, CA, USA", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6121964/5783338/5783338-photo-1-small.gif", "p": ["Hao Zhang (S'06–M'09) received the B.E. degree in electronic engineering from Tsinghua University, Beijing, China, in 2006, and the M.A. degree in statistics and the M.S. degree in electrical engineering and computer sciences from the University of California (UC) at Berkeley, Berkeley, in 2009. He is currently pursuing the Ph.D. degree in electrical engineering and computer sciences at UC Berkeley.", "From 2005 to 2006, he was a Research Assistant with the Center for Intelligent Image and Document Processing, Tsinghua University. He was an Engineering Intern with Cisco Systems, San Jose, CA, in 2007. Since 2007, he has been a Graduate Student Researcher with the Berkeley Audio Visual Signal Processing and Communication Systems Laboratory, UC Berkeley. His current research interests include image and video processing and communications, distributed source coding, computer vision, and machine learning.", "Mr. Zhang was a recipient of the U.S. Vodafone Foundation Fellowship from 2006 to 2008. He received a Best Student Paper Award at ACM MM 2008, a Best Paper Finalist in ICASSP 2009, and a Best Paper Finalist in ICIP 2010."]}}, {"name": "Chuohao Yeo", "affiliation": "Department of Signal Processing, Institute for Infocomm Research, Singapore", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6121964/5783338/5783338-photo-2-small.gif", "p": ["Chuohao Yeo received the B.S. degree in electrical science and engineering and the M.E. degree in electrical engineering and computer science from the Massachusetts Institute of Technology (MIT), Cambridge, in 2002, and the Ph.D. degree in electrical engineering from the Department of Electrical Engineering and Computer Sciences, University of California at Berkeley, Berkeley.", "From 2001 to 2002, he was a Research Assistant with the Research Laboratory of Electronics, MIT. He was a Research Engineer with the Institute for Infocomm Research, Singapore, in 2004, and was an Engineering Intern with Omnivision Technologies, Sunnyvale, CA, in 2005. His current research interests include image and video processing and communications, distributed source coding, computer vision, and machine learning.", "Dr. Yeo was a recipient of the Singapore Government Public Service Commission Overseas Merit Scholarship from 1998 to 2002. Since 2004, he has been receiving the Singapore's Agency for Science, Technology, and Research Overseas Graduate Scholarship. He received a Best Student Paper Award at SPIE VCIP in 2007."]}}, {"name": "Kannan Ramchandran", "affiliation": "Department of Electrical Engineering and Computer Science, University of California at Berkeley, Berkeley, CA, USA", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6121964/5783338/5783338-photo-3-small.gif", "p": ["Kannan Ramchandran (S'92–M'93–SM'98–F'05) received the Ph.D. degree in electrical engineering from Columbia University, New York, NY, in 1993.", "Since 1999, he has been a Professor with the Department of Electrical Engineering and Computer Science, University of California (UC) at Berkeley, Berkeley. From 1993 to 1999, he was a Faculty Member with the Department of Electrical and Computer Engineering, University of Illinois at Urbana-Champaign (UIUC), Urbana. Prior to that, he was with AT&T Bell Laboratories, Murray Hill, NJ, from 1984 to 1990. His current research interests include distributed signal processing and coding for networks, robust and scalable video delivery over wireless and peer-to-peer networks, robust distributed storage, multi-user information theory, media and information-theoretic security, and multiscale statistical image processing and modeling.", "Dr. Ramchandran received the Eli Jury Award in 1993 from Columbia University for his doctoral thesis, the National Science Foundation CAREER Award in 1997, the Office of Naval Research and Army Research Office Young Investigator Awards in 1996 and 1997, respectively, the Henry Magnusky Scholar Award at UIUC, and the Okawa Foundation Prize from the Department of Electrical Engineering and Computer Science at UC Berkeley in 2001. He was the co-recipient of the two Senior Best Paper Awards from the IEEE Signal Processing Society in 1993 and 1997. He has been a co-author on several Best Paper and Best Student Paper Awards in leading conferences in his field including the IEEE Packet Video Workshop in 2000, the IEEE/ACM Information Processing in Sensor Networks in 2005, the IEEE MMSP in 2007 (finalist), the ACM Multimedia in 2008, the IEEE International Conference on Image Processing in 2008, and the IEEE ICASSP in 2009 (finalist). He was also the recipient of the Outstanding Teaching Award from the Department of Electrical Engineering and Computer Science at UC Berkeley in 2009. He serves on numerous technical program committees for premier conferences in image, video, and signal processing, communications, and information theory."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Synchronization", "Optical fibers", "Electron tubes", "Pixel", "Protocols", "Bandwidth", "PSNR"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video coding", "cryptography", "data compression", "distortion", "synchronisation"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["video compression", "VSYNC", "bandwidth-efficient video file synchronization", "distortion-tolerant video file synchronization", "video sources", "user-defined distortion", "video backup", "video sharing", "video authentication"]}, {"type": "Author Keywords ", "kwd": ["VSYNC", "Rsync", "video coding", "video file synchronization", "video hash"]}],"citations":[{"ieee-citations":[{"authors":["Chuohao Yeo","Parvez Ahammad","Hao Zhang","Kannan Ramchandran"],"article name":"Rate-constrained distributed distance testing and its applications","Journal Name":"Acoustics Speech and Signal Processing 2009. ICASSP 2009. IEEE International Conference on","vol":"none","pp.": "809-812","Year": "2009","ISSN": "1520-6149","ISBN":"none"},{"authors":["Ramji Venkataramanan","Vasuki Narasimha Swamy","Kannan Ramchandran"],"article name":"Low-Complexity Interactive Algorithms for Synchronization From Deletions Insertions and Substitutions","Journal Name":"Information Theory IEEE Transactions on","vol.": "61","pp.": "5670-5689","Year": "2015","ISSN": "0018-9448","ISBN":"none"}]},{"nonieee-citations":[]}]}