{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 17, "citationCountPatent": 0, "totalDownloads": 956},"doi": "10.1109/TCSVT.2011.2158335","title": "Cast Shadow Removal in a Hierarchical Manner Using MRF","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "In this paper, we present a novel method for shadow removal using Markov random fields (MRF). In our method, we first construct the shadow model in a hierarchical manner. At the pixel level, we use the Gaussian mixture model to model the behavior of cast shadows for every pixel in the HSV color space. The samples which are used to update the shadow model should satisfy a pre-classifier. This pre-classifier indicates the color feature of shadow in current frame. At the global level, we exploit the statistical features of shadow in the whole scene over several consecutive frames to make this pre-classifier accurate and adaptive to the change of shadow. Then, based on the shadow model, an MRF model is constructed for shadow removal. The main contribution of this paper is twofold. First, although our method is a chroma-based method, we make the pre-classifier accurate and adaptive to the change of shadow by using the statistical features of shadow at the global level. Moreover, tracking information can make this global-level statistical information more robust. Second, we construct an MRF model to represent the dependencies between the label of a pixel and the shadow models of its neighbors. Experimental results show that the proposed method is efficient and robust.","authors": [{"name": "Zhou Liu", "affiliation": "National Laboratory of Pattern Recognition, Institute of Automation, Chinese Academy of Sciences, Beijing, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6121964/5783336/5783336-photo-1-small.gif", "p": ["Zhou Liu received the M.S. degree in control theory and control engineering from Harbin Engineering University, Harbin, China, in 2005, and the Ph.D. degree in pattern recognition and intelligent systems from the National Laboratory of Pattern Recognition, Institute of Automation, Chinese Academy of Sciences, Beijing, China, in 2009.", "Currently, he is a Researcher with Sonny China Research Laboratory, Beijing. His current research interests include activity recognition, video surveillance, and image processing."]}}, {"name": "Kaiqi Huang", "affiliation": "National Laboratory of Pattern Recognition, Institute of Automation, Chinese Academy of Sciences, Beijing, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6121964/5783336/5783336-photo-2-small.gif", "p": ["Kaiqi Huang (M'06–SM'09) received the M.S. degree in electrical engineering from the Nanjing University of Science and Technology, Nanjing, China, and the Ph.D. degree in signal and information processing from Southeast University, Nanjing.", "He then joined the National Laboratory of Pattern Recognition, Chinese Academy of Sciences, Beijing, China, where he is currently an Associate Professor. His current research interests include visual surveillance, image and video analysis, human vision and cognition, and computer vision. He has published more than 50 papers in international journals and conferences, such as the IEEE Transactions on Image Processing, the IEEE Transactions on Systems, Man and Cybernetics-b, Computer Vision and Image Understanding, Pattern Recognition, Computer Vision and Pattern Recognition, the European Conference on Computer Vision, and others.", "Dr. Huang is the Deputy Secretary-General of the IEEE Beijing Section. He serves as a program committee member or chair of more than 30 international conferences."]}}, {"name": "Tieniu Tan", "affiliation": "National Laboratory of Pattern Recognition, Institute of Automation, Chinese Academy of Sciences, Beijing, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6121964/5783336/5783336-photo-3-small.gif", "p": ["Tieniu Tan (M'92–SM'97–F'04) received the B.S. degree in electronic engineering from Xi'an Jiaotong University, Xi'an, China, in 1984, and the M.S. and Ph.D. degrees in electronic engineering from Imperial College, London, U.K., in 1986 and 1989, respectively.", "In October 1989, he joined the Computational Vision Group at the Department of Computer Science, University of Reading, Reading, U.K., where he was a Research Fellow, Senior Research Fellow, and Lecturer. In January 1998, he returned to China to join the National Laboratory of Pattern Recognition (NLPR), Institute of Automation of the Chinese Academy of Sciences (CAS), Beijing, China. He was the Director General of the CAS Institute of Automation from 2000 to 2007. Since 1998, he has been a Professor and Director of the NLPR. He also serves as Deputy Secretary-General (for cyber-infrastructure and international affairs) of the CAS. He has published more than 300 research papers in refereed journals and conferences in the areas of image processing, computer vision, and pattern recognition, and has authored or edited nine books. He holds more than 30 patents. His current research interests include biometrics, image and video understanding, and information forensics and security.", "Dr. Tan is a fellow of the International Association of Pattern Recognition (IAPR). He has served as chair or program committee member for many major national and international conferences. He is or has served as an Associate Editor or Editorial Board Member of many leading international journals including the IEEE Transactions on Pattern Analysis and Machine Intelligence, the IEEE Transactions on Automation Science and Engineering, the IEEE Transactions on Information Forensics and Security, the IEEE Transactions on Circuits and Systems for Video Technology, Pattern Recognition, Pattern Recognition Letters, Image and Vision Computing, and others. He is the Editor-in-Chief of the International Journal of Automation and Computing. He was the Founding Chair of the IAPR Technical Committee on Biometrics, the IAPR/IEEE International Conference on Biometrics, and the IEEE International Workshop on Visual Surveillance. He is a Strategic Coordinating Committee Member on Information and Data of the International Council for Science, and a member of the IEEE MGA Nominations and Appointments Committee. He currently serves as the Vice President of the IAPR, the Executive Vice President of the Chinese Society of Image and Graphics, and the Deputy President of the Chinese Association for Artificial Intelligence. He was the Deputy President of the China Computer Federation and the Chinese Automation Association. He has given invited talks and keynotes at many universities and international conferences, and has received numerous national and international awards and recognitions."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Pixel", "Histograms", "Image color analysis", "Adaptation model", "Lighting", "Robustness", "Mathematical model"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["statistical analysis", "image classification", "image colour analysis"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["global-level statistical information", "cast shadow removal", "Markov random fields", "Gaussian mixture model", "HSV color space", "pre-classifier", "color feature", "statistical features"]}, {"type": "Author Keywords ", "kwd": ["tracking", "Markov random fields", "robust estimation", "shadow removal"]}],"citations":[{"ieee-citations":[{"authors":["Yuan Zhou","Jin Chen","Qinghua Guo","Ruyin Cao","Xiaolin Zhu"],"article name":"Restoration of Information Obscured by Mountainous Shadows Through Landsat TM/ETM+ Images Without the Use of DEM Data: A New Method","Journal Name":"Geoscience and Remote Sensing IEEE Transactions on","vol.": "52","pp.": "313-328","Year": "2014","ISSN": "0196-2892","ISBN":"none"},{"authors":["Hidetomo Sakaino"],"article name":"Video-Based Tracking Learning and Recognition Method for Multiple Moving Objects","Journal Name":"Circuits and Systems for Video Technology IEEE Transactions on","vol.": "23","pp.": "1661-1674","Year": "2013","ISSN": "1051-8215","ISBN":"none"},{"authors":["Huan Huang","Shiying Li","Kai Tang","Renfa Li"],"article name":"Accurate segmentation of moving objects and their shadows via brightness ratios and movement patterns","Journal Name":"Intelligent Vehicles Symposium Proceedings 2014 IEEE","vol":"none","pp.": "820-826","Year": "2014","ISSN":"none","ISBN":"none"},{"authors":["Kratika Garg","Siew-Kei Lam","Thambipillai Srikanthan","Vedika Agarwal"],"article name":"Real-time road traffic density estimation using block variance","Journal Name":"Applications of Computer Vision (WACV) 2016 IEEE Winter Conference on","vol":"none","pp.": "1-9","Year": "2016","ISSN":"none","ISBN":"none"},{"authors":["Dawei Li","Lihong Xu","Erik D. Goodman"],"article name":"Illumination-Robust Foreground Detection in a Video Surveillance System","Journal Name":"Circuits and Systems for Video Technology IEEE Transactions on","vol.": "23","pp.": "1637-1650","Year": "2013","ISSN": "1051-8215","ISBN":"none"},{"authors":["Feng Su","Gu Fang","Ngai Ming Kwok"],"article name":"Shadow removal using background reconstruction","Journal Name":"Image and Signal Processing (CISP) 2012 5th International Congress on","vol":"none","pp.": "154-158","Year": "2012","ISSN":"none","ISBN":"none"},{"authors":["Yan Zhou","Huiwen Guo","Guoyuan Liang","Xinyu Wu"],"article name":"Shadow removal for light field images","Journal Name":"Information and Automation (ICIA) 2014 IEEE International Conference on","vol":"none","pp.": "1190-1194","Year": "2014","ISSN":"none","ISBN":"none"},{"authors":["Zhou Liu","Kaiqi Huang","Tieniu Tan"],"article name":"Foreground Object Detection Using Top-Down Information Based on EM Framework","Journal Name":"Image Processing IEEE Transactions on","vol.": "21","pp.": "4204-4217","Year": "2012","ISSN": "1057-7149","ISBN":"none"},{"authors":["Mohamed I. Elbakary","Khan M. Iftekharuddin"],"article name":"Shadow Detection of Man-Made Buildings in High-Resolution Panchromatic Satellite Images","Journal Name":"Geoscience and Remote Sensing IEEE Transactions on","vol.": "52","pp.": "5374-5386","Year": "2014","ISSN": "0196-2892","ISBN":"none"},{"authors":["Tao Luo","Jianbing Shen","Xuelong Li"],"article name":"Accurate Normal and Reflectance Recovery Using Energy Optimization","Journal Name":"Circuits and Systems for Video Technology IEEE Transactions on","vol.": "25","pp.": "212-224","Year": "2015","ISSN": "1051-8215","ISBN":"none"},{"authors":["Kunfeng Wang","Yuqiang Liu","Chao Gou","Fei-Yue Wang"],"article name":"A Multi-view Learning Approach to Foreground Detection for Traffic Surveillance Applications","Journal Name":"Vehicular Technology IEEE Transactions on","vol.": "65","pp.": "4144-4158","Year": "2016","ISSN": "0018-9545","ISBN":"none"},{"authors":["Adrienne Heinrich","Di Geng","Dmitry Znamenskiy","Jelte Peter Vink","Gerard de Haan"],"article name":"Robust and Sensitive Video Motion Detection for Sleep Analysis","Journal Name":"Biomedical and Health Informatics IEEE Journal of","vol.": "18","pp.": "790-798","Year": "2014","ISSN": "2168-2194","ISBN":"none"},{"authors":["Kalyan Kumar Hati","Pankaj Kumar Sa","Banshidhar Majhi"],"article name":"Intensity Range Based Background Subtraction for Effective Object Detection","Journal Name":"Signal Processing Letters IEEE","vol.": "20","pp.": "759-762","Year": "2013","ISSN": "1070-9908","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Ling Zhang","Yao Zhu","Bin Liao","Chunxia Xiao"],"article name":"Video Shadow Removal Using Spatio-temporal Illumination Transfer","Journal Name":"Computer Graphics Forum","vol.": "36","pp.": "125","Year": "2017","ISSN": "01677055","ISBN":"none"},{"authors":["Jiangyan Dai","Dianyuan Han","Xiaowei Zhao"],"article name":"Effective moving shadow detection using statistical discriminant model","Journal Name":"Optik - International Journal for Light and Electron Optics","vol.": "126","pp.": "5398","Year": "2015","ISSN": "00304026","ISBN":"none"},{"authors":["Yong Luo","Ye Peng Guan"],"article name":"Motion objects segmentation based on structural similarity background modelling","Journal Name":"IET Computer Vision","vol.": "9","pp.": "476","Year": "2015","ISSN": "1751-9632","ISBN":"none"},{"authors":["Ranran Song","Min Liu","Minghu Wu","Juan Wang","Cong Liu"],"Article Name":"none","Journal Name":"Lecture Notes on Data Engineering and Communications Technologies","vol.": "6","pp.": "585","Year": "2018","ISSN": "2367-4512","ISBN": "978-3-319-59462-0"}]}]}