{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 6, "citationCountPatent": 0, "totalDownloads": 455},"doi": "10.1109/TCSVT.2011.2181231","title": "Differential Edit Distance: A Metric for Scene Segmentation Evaluation","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "In this paper, a novel approach to evaluating video temporal decomposition algorithms is presented. The evaluation measures typically used to this end are nonlinear combinations of precision-recall or coverage-overflow, which are not metrics and additionally possess undesirable properties, such as nonsymmetricity. To alleviate these drawbacks, we introduce a novel unidimensional measure that is proven to be metric and satisfies a number of qualitative prerequisites that previous measures do not. This measure is named differential edit distance (DED), since it can be seen as a variation of the well-known edit distance. After defining DED, we further introduce an algorithm that computes it in less than cubic time. Finally, DED is extensively compared with state-of-the-art measures, namely, the harmonic means (F-score) of precision-recall and coverage-overflow. The experiments include comparisons of qualitative properties, the time required for optimizing the parameters of scene segmentation algorithms with the help of these measures, and a user study gauging the agreement of these measures with the users' assessment of the segmentation results. The results confirm that the proposed measure is a unidimensional metric that is effective in evaluating scene segmentation techniques and in helping to optimize their parameters.","authors": [{"name": "Panagiotis Sidiropoulos", "affiliation": "Informatics and Telematics Institute/Center for Research and Technology Hellas, Thessaloniki, Greece", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6209393/6111460/6111460-photo-1-small.gif", "p": ["Panagiotis Sidiropoulos received the Diploma degree in electrical and computer engineering in 2003 and the M.S. degree in informatics in 2007, both from the Aristotle University of Thessaloniki, Thessaloniki, Greece. He is currently pursuing the Ph.D. degree from the University of Surrey, Guildford, Surrey, U.K.", "In June 2008, he joined Informatics and Telematics Institute/Center for Research and Technology Hellas, Thessaloniki, as a Research Associate. His current research interests include multimedia retrieval, image and video analysis, and machine learning."]}}, {"name": "Vasileios Mezaris", "affiliation": "Informatics and Telematics Institute/Center for Research and Technology Hellas, Thessaloniki, Greece", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6209393/6111460/6111460-photo-2-small.gif", "p": ["Vasileios Mezaris (S'98–M'06) received the Diploma and Ph.D. degrees in electrical and computer engineering from the Aristotle University of Thessaloniki, Thessaloniki, Greece, in 2001 and 2005, respectively.", "He is currently a Senior Researcher (Researcher C) with the Informatics and Telematics Institute/Center for Research and Technology Hellas, Thessaloniki. His current research interests include image and video analysis, content-based and semantic image and video retrieval, event detection in multimedia, and medical image analysis. He is the co-author of 22 papers in refereed international journals, seven book chapters, one patent, and more than 70 papers in international conferences."]}}, {"name": "Ioannis Kompatsiaris", "affiliation": "Informatics and Telematics Institute/Center for Research and Technology Hellas, Thessaloniki, Greece", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6209393/6111460/6111460-photo-3-small.gif", "p": ["Ioannis (Yiannis) Kompatsiaris (S'94–M'02–SM'11) received the Ph.D. degree in 3-D model-based image sequence coding from the Aristotle University of Thessaloniki, Thessaloniki, Greece, in 2001.", "He is currently a Senior Researcher (Researcher B') with the Informatics and Telematics Institute, Thessaloniki. His current research interests include semantic multimedia analysis, indexing and retrieval, social media analysis, knowledge structures, and reasoning and personalization for multimedia applications. He is the co-author of 55 papers in refereed journals, 30 book chapters, seven patents, and more than 170 papers in international conferences.", "Dr. Kompatsiaris has been the co-organizer of various international conferences and workshops and has served as a regular reviewer for a number of journals and conferences. He is a member of ACM."]}}, {"name": "Josef Kittler", "affiliation": "Center for Vision, Speech, and Signal Processing, Faculty of Engineering and Physical Sciences, University of Surrey, Guildford, Surrey, U.K.", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6209393/6111460/6111460-photo-4-small.gif", "p": ["Josef Kittler (M'72) received the B. A., Ph.D., and D. Sc. degrees from the University of Cambridge, Cambridge, U.K., in 1971, 1974, and 1991, respectively.", "He is currently a Professor of machine intelligence with the Center for Vision, Speech, and Signal Processing, University of Surrey, Surrey, U.K. He conducts research in biometrics, video and image database retrieval, medical image analysis, and cognitive vision. He has published a textbook, Pattern Recognition: A Statistical Approach (Englewood Cliffs, NJ: Prentice-Hall), and several edited volumes, as well as more than 170 journal papers. He is an Editorial Board Member of several scientific journals, including Pattern Recognition and Computer Vision."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Measurement", "Harmonic analysis", "Streaming media", "Transforms", "Estimation", "Matrix decomposition", "Electronic mail"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video signal processing", "image segmentation"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["unidimensional measure", "differential edit distance", "scene segmentation evaluation", "video temporal decomposition", "precision-recall", "coverage-overflow"]}, {"type": "Author Keywords ", "kwd": ["string matching", "Differential edit distance (DED)", "scene segmentation"]}],"citations":[{"ieee-citations":[{"authors":["George Kamberov","Matt Burlick","Lazaros Karydas","Olga Koteogou"],"article name":"Unsupervised Detection of Video Sub-scenes","Journal Name":"Pattern Recognition (ICPR) 2014 22nd International Conference on","vol":"none","pp.": "1934-1939","Year": "2014","ISSN": "1051-4651","ISBN":"none"},{"authors":["Werner Bailer","Andras Horti"],"article name":"TAME-Diff: Smart differencing of time-aligned multimedia metadata","Journal Name":"Content-Based Multimedia Indexing (CBMI) 2014 12th International Workshop on","vol":"none","pp.": "1-6","Year": "2014","ISSN": "1949-3991","ISBN":"none"},{"authors":["Saki Yamashita","Takayuki Itoh"],"article name":"An Interactive Digest Movie Creation Method Focusing on Specific Persons Using Face Detection","Journal Name":"Nicograph International (NicoInt) 2017","vol":"none","pp.": "72-75","Year": "2017","ISSN":"none","ISBN":"none"},{"authors":["Panagiotis Sidiropoulos","Vasileios Mezaris","Ioannis Kompatsiaris"],"article name":"Differential edit distance as a countermeasure to video scene ambiguity","Journal Name":"Machine Learning for Signal Processing (MLSP) 2012 IEEE International Workshop on","vol":"none","pp.": "1-6","Year": "2012","ISSN": "1551-2541","ISBN":"none"},{"authors":["Lorenzo Baraldi","Costantino Grana","Rita Cucchiara"],"article name":"Recognizing and Presenting the Storytelling Video Structure With Deep Multimodal Networks","Journal Name":"Multimedia IEEE Transactions on","vol.": "19","pp.": "955-968","Year": "2017","ISSN": "1520-9210","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Manfred Del Fabro","rmenyi"],"article name":"State-of-the-art and future challenges in video scene detection: a survey","Journal Name":"Multimedia Systems","vol":"none","pp.":"none","Year": "2013","ISSN": "0942-4962","ISBN":"none"}]}]}