{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 9, "citationCountPatent": 0, "totalDownloads": 690},"doi": "10.1109/TCSVT.2011.2177142","title": "Adaptive Temporal Trajectory Filtering for Video Compression","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "Most in-loop filters currently being employed in video compression algorithms use spatial information from a single frame of the video sequence only. In this paper, a new filter is introduced and investigated that combines both spatial and temporal information to provide subjective and objective quality improvement. The filter only requires a small overhead on slice level while using the temporal information conveyed in the bit stream to reconstruct the individual motion trajectory of every pixel in a frame at both encoder and decoder. This information is then used to perform pixel-wise adaptive motion-compensated temporal filtering. It is shown that the filter performs better than the state-of-the-art codec H.264/AVC over a large range of sequences and bit rates. Additionally, the filter is compared with another, Wiener-based in-loop filtering approach and a complexity analysis of both algorithms is conducted.","authors": [{"name": "Marko Esche", "affiliation": "Communication Systems Group, Technische Universit&#x00E4;t Berlin, Berlin, Germany", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6193248/6086601/6086601-photo-1-small.gif", "p": ["Marko Esche (S'10) received the B.S. and M.S. degrees in electrical engineering from Technische Universität Berlin, Berlin, Germany, in 2008 and 2009, respectively, where he is currently pursuing the Dr.-Ing. degree.", "Since 2009, he has been a Research and Teaching Assistant with the Communication Systems Group, Technische Universität Berlin. His current research interests include hybrid video coding, video denoising, and rate-distortion theory."]}}, {"name": "Alexander Glantz", "affiliation": "Communication Systems Group, Technische Universit&#x00E4;t Berlin, Berlin, Germany", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6193248/6086601/6086601-photo-2-small.gif", "p": ["Alexander Glantz (S'08) received the Dipl.-Ing. degree in computer engineering from Technische Universität Berlin, Berlin, Germany. He is currently pursuing the Dr.-Ing. degree from the Communication Systems Group, Technische Universität Berlin.", "He has been involved in the European Networks of Excellence VISNET II and PetaMedia, and currently takes part in international ITU and ISO standardization activities. His current research interests include multimedia signal processing, hybrid video coding, rate-distortion theory, global motion estimation, and object segmentation in video sequences.", "Mr. Glantz is a member of the German Society for Information Technology."]}}, {"name": "Andreas Krutz", "affiliation": "Communication Systems Group, Technische Universit&#x00E4;t Berlin, Berlin, Germany", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6193248/6086601/6086601-photo-3-small.gif", "p": ["Andreas Krutz (M'10) received the Dipl.-Ing. and the Dr.-Ing. degrees in electrical engineering from Technische Universität Berlin, Berlin, Germany, in 2006 and 2010, respectively.", "He is currently a Post-Doctoral Researcher with the Communication Systems Group, Technische Universität Berlin. He was a Student Research Assistant with the University College, University of New South Wales, Canberra, Australia, where he started to research image processing and video coding. He was involved in four European network of excellences, namely, 3DTV, K-space, VISNET II, and PetaMedia. Within the K-Space project, he worked on video analysis techniques, especially on object segmentation. Within the remaining three projects, he worked on new techniques for hybrid video coding based on analysis/synthesis as well as common hybrid approaches. In 2008, he was a Guest Researcher with the University of New South Wales.", "Dr. Krutz served as a Co-Chair of the Special Sessions at MMSP 2008 in Cairns, Australia, and ICIP 2011 in Brussels, Belguim. He is currently an Active Contributor to the JCT-VC, a joint standardization activity of ITU and ISO/IEC MPEG leading to the next video coding standard HEVC. He is a member of VDE/ITG."]}}, {"name": "Thomas Sikora", "affiliation": "Communication Systems Group, Technische Universit&#x00E4;t Berlin, Berlin, Germany", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6193248/6086601/6086601-photo-4-small.gif", "p": ["Thomas Sikora (SM'97) received the Dipl.-Ing. and Dr.-Ing. degrees in electrical engineering from Bremen University, Bremen, Germany, in 1985 and 1989, respectively.", "He is currently a Professor and the Director of the Systems Group (Nachrichtenübertragung) at Technische Universität Berlin, Berlin, Germany. In 1990, he joined Siemens Ltd. and Monash University, Melbourne, Australia, as a Project Leader responsible for video compression research activities in the Australian Universal Broadband Video Codec Consortium. Between 1994 and 2001, he was the Director of the Interactive Media Department, Heinrich Hertz Institute, Berlin GmbH, Germany. He is a co-founder of Vis-a-Pix GmbH (www.visapix.com) and imcube media GmbH (www.imcube.com), two Berlin-based start-up companies involved in research and development of audio and video signal processing and compression technology. He is an Appointed Member of the Advisory and Supervisory board of a number of German companies and international research organizations. He frequently works as an Industry Consultant and Patent Reviewer on issues related to interactive digital audio and video. He has been involved in international ITU and ISO standardization activities as well as in several European research activities for more than 15 years. As the Chairman of the ISO-MPEG video group, he was responsible for the development and standardization of the MPEG-4 and MPEG-7 video algorithms. He also served as the Chairman of the European COST 211th Video Compression Research Group. He was appointed as the Research Chair for the VISNET and 3DTV European Networks of Excellence. He has published more than 300 journal and conference papers related to audio and video processing. He has co-authored three books: Introduction to MPEG-7: Multimedia Content Description Interface (New York: Wiley, 2002), MPEG-7 Audio and Beyond: Audio Content Indexing and Retrieval (New York: Wiley, 2005), and 3D Videocommunication: Algorithms, Concepts and Real-Time Systems in User-Centered Communications (New York: Wiley, 2005).", "Dr. Sikora is a member of the German Society for Information Technology and a recipient of the 1996 ITG Award. He received the 1996 Engineering Emmy Award of the U.S. National Academy of Television Arts and Sciences as a member of the ISO MPEG-2 Video Standards Group. He is a Frequent Invited Speaker at international conferences. He was the Editor-in-Chief of the IEEE Transactions on circuits and systems for video technology. From 1998 to 2002, he was an Associate Editor of the IEEE Signal processing magazine. He is an Advisory Editor of the EURASIP Signal Processing: Image Communication Journal and was an Associate Editor of the EURASIP Signal Processing Journal."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Trajectory", "Noise", "Video sequences", "Decoding", "Vectors", "Correlation", "Noise reduction"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video coding", "adaptive filters", "data compression", "image reconstruction", "image sequences", "motion compensation"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["H.264/AVC", "adaptive temporal trajectory filtering", "video compression", "spatial information", "video sequence", "temporal information", "quality improvement", "bit stream", "pixel reconstruction", "motion trajectory", "encoder", "decoder", "pixel-wise adaptive motion-compensated temporal filtering"]}, {"type": "Author Keywords ", "kwd": ["video compression", "Deblocking filter", "motion-compensated filtering", "pixel trajectories"]}],"citations":[{"ieee-citations":[{"authors":["Marko Esche","Michael Tok","Thomas Sikora"],"article name":"Theoretical Considerations Concerning Pixelwise Temporal Filtering","Journal Name":"Data Compression Conference (DCC) 2014","vol":"none","pp.": "73-82","Year": "2014","ISSN": "1068-0314","ISBN":"none"},{"authors":["Marko Esche","Michael Tok","Thomas Sikora"],"article name":"Adpative dense vector field interpolation for temporal filtering","Journal Name":"Image Processing (ICIP) 2013 20th IEEE International Conference on","vol":"none","pp.": "1918-1922","Year": "2013","ISSN":"none","ISBN":"none"},{"authors":["Malavika Bhaskaranand","Jerry D. Gibson"],"article name":"Global Motion Assisted Low Complexity Video Encoding for UAV Applications","Journal Name":"Selected Topics in Signal Processing IEEE Journal of","vol.": "9","pp.": "139-150","Year": "2015","ISSN": "1932-4553","ISBN":"none"},{"authors":["Marko Esche","Michael Tok","Alexander Glantz","Andreas Krutz","Thomas Sikora"],"article name":"Efficient Quadtree Compression for Temporal Trajectory Filtering","Journal Name":"Data Compression Conference (DCC) 2013","vol":"none","pp.": "488-488","Year": "2013","ISSN": "1068-0314","ISBN":"none"},{"authors":["Marko Esche","Alexander Glantz","Andreas Krutz","Michael Tok","Thomas Sikora"],"article name":"Quadtree-based temporal trajectory filtering","Journal Name":"Image Processing (ICIP) 2012 19th IEEE International Conference on","vol":"none","pp.": "1553-1556","Year": "2012","ISSN": "1522-4880","ISBN":"none"},{"authors":["Seok Bong Yoo","Kyuha Choi","Jong Beom Ra"],"article name":"Post-Processing for Blocking Artifact Reduction Based on Inter-Block Correlation","Journal Name":"Multimedia IEEE Transactions on","vol.": "16","pp.": "1536-1548","Year": "2014","ISSN": "1520-9210","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Ali Abdullah Yahya","Jieqing Tan","Lian Li"],"article name":"Video Noise Reduction Method Using Adaptive Spatial-Temporal Filtering","Journal Name":"Discrete Dynamics in Nature and Society","vol.": "2015","pp.": "1","Year": "2015","ISSN": "1026-0226","ISBN":"none"},{"authors":["Artyom M. Grigoryan","Edward R. Dougherty","Sos S. Agaian"],"article name":"Optimal Wiener and homomorphic filtration: Review","Journal Name":"Signal Processing","vol.": "121","pp.": "111","Year": "2016","ISSN": "01651684","ISBN":"none"},{"authors":["Geng Zhang","Zejian Yuan","Yuehu Liu","Liang Ma","Nanning Zheng"],"article name":"Video object segmentation by integrating trajectories from points and regions","Journal Name":"Multimedia Tools and Applications","vol":"none","pp.":"none","Year": "2014","ISSN": "1380-7501","ISBN":"none"}]}]}