{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 11, "citationCountPatent": 0, "totalDownloads": 764},"doi": "10.1109/TCSVT.2012.2197077","title": "Implementation and Applications of Tri-State Self-Organizing Maps on FPGA","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "This paper introduces a tri-state logic self-organizing map (bSOM) designed and implemented on a field programmable gate array (FPGA) chip. The bSOM takes binary inputs and maintains tri-state weights. A novel training rule is presented. The bSOM is well suited to FPGA implementation, trains quicker than the original self-organizing map (SOM), and can be used in clustering and classification problems with binary input data. Two practical applications, character recognition and appearance-based object identification, are used to illustrate the performance of the implementation. The appearance-based object identification forms part of an end-to-end surveillance system implemented wholly on FPGA. In both applications, binary signatures extracted from the objects are processed by the bSOM. The system performance is compared with a traditional SOM with real-valued weights and a strictly binary weighted SOM.","authors": [{"name": "Kofi Appiah", "affiliation": "Lincoln School of Computer Science, University of Lincoln, Lincoln, U.K.", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6255841/6193165/6193165-photo-1-small.gif", "p": ["Kofi Appiah (M'04) received the B. Sc. degree in computer science from the Kwame Nkrumah University of Science and Technology, Kumasi, Ghana, the M. Sc. degree in electrical engineering from the Royal Institute of Technology, Stockholm, Sweden, another M. Sc. degree in computer science from the University of Oxford, Oxford, U. K., and the Ph. D. degree from the University of Lincoln, Lincoln, U. K., in 2010.", "He is currently a Senior Researcher with the Lincoln School of Computer Science, University of Lincoln. His current research interests include computer vision, and highly parallel software and hardware architectures."]}}, {"name": "Andrew Hunter", "affiliation": "Lincoln School of Computer Science, University of Lincoln, Lincoln, U.K.", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6255841/6193165/6193165-photo-2-small.gif", "p": ["Andrew Hunter (M'09) received the B. Sc. degree in mathematics and computing and the Ph.D. degree in computer graphics from Bath University, Bath, U.K.", "He worked on computer graphics and CAD/CAM software for several years within the industry, before returning to academia. He has held positions with Sunderland University, Sunderland, U.K., and Durham University, Durham, U.K., before joining the Lincoln School of Computer Science, University of Lincoln, Lincoln, U.K. He became the Head of the Department of Computing in 2004, the Dean of Research in 2007, and the Dean of Science, Technology, and Engineering in 2010. He has published over 80 academic papers, including more than 20 in international journals. He has also developed several freeware and commercial artificial intelligence software packages."]}}, {"name": "Patrick Dickinson", "affiliation": "Lincoln School of Computer Science, University of Lincoln, Lincoln, U.K.", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6255841/6193165/6193165-photo-3-small.gif", "p": ["Patrick Dickinson (M'04) previously studied at the University of Oxford, Oxford, U.K., and the University of Southampton, Southampton, U.K. He received the Ph.D. degree in computer vision from the University of Lincoln, Lincoln, U.K.", "He is currently a Senior Lecturer with the Lincoln School of Computer Science, University of Lincoln. His current research interests include computer vision applied to the surveillance of wildlife, games artificial intelligence, and the use of games metrics.", "Dr. Dickinson is a member of the Center for Computer Vision and Robotics, and is a co-founder of the Games Research Group, University of Lincoln."]}}, {"name": "Hongying Meng", "affiliation": "School of Engineering and Design, Brunel University, Uxbridge, U.K.", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6255841/6193165/6193165-photo-4-small.gif", "p": ["Hongying Meng (M'10) received the Ph.D. degree in communication and electronics systems from Xi'an Jiaotong University, Xi'an, China.", "He is currently a Lecturer with the School of Engineering and Design, Brunel University, Uxbridge, U.K. He was with the Department of Electronics Engineering, Tsinghua University, Beijing, China. Before joining Brunel University, he held research positions with several U.K. universities, including University College London, London, U.K., the University of Lincoln, Lincoln, U.K., the University of York, York, U.K., the University of Southampton, Southampton, U.K., and the University of Dundee, Dundee, U.K. He has more than 60 publications with more than 500 citations. He current research interests include digital signal processing, machine learning, computer vision, embedded systems, and affective computing.", "Dr. Meng is a member of the HUMAINE Association and a fellow of the Higher Education Academy, U.K."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Vectors", "Neurons", "Field programmable gate arrays", "Training", "Hardware", "Computer architecture", "Prototypes"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["surveillance", "field programmable gate arrays", "handwritten character recognition", "image classification", "object recognition", "pattern clustering", "self-organising feature maps"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["binary signature extraction", "tri-state logic binary self-organizing map", "bSOM design", "held programmable gate array", "FPGA chip", "tri-state weight", "clustering problem", "classification problem", "binary input data", "character recognition", "appearance-based object identihcation", "end-to-end surveillance system"]}, {"type": "Author Keywords ", "kwd": ["object recognition", "Binary self-organizing map (SOM)", "character recognition", "field programmable gate array (FPGA)"]}],"citations":[{"ieee-citations":[{"authors":["Jaeyoung Kim","Pinaki Mazumder"],"article name":"Energy-Efficient Hardware Architecture of Self-Organizing Map for ECG Clustering in 65-nm CMOS","Journal Name":"Circuits and Systems II: Express Briefs IEEE Transactions on","vol.": "64","pp.": "1097-1101","Year": "2017","ISSN": "1549-7747","ISBN":"none"},{"authors":["Callejas Ivan","Pineros Juan","Rocha Juan","Hernandez Ferney","Delgado Fabio"],"article name":"Implementación de una red neuronal artificial tipo SOM en una FPGA para la resolución de trayectorias tipo laberinto","Journal Name":"Engineering Mechatronics and Automation (CIIMA) 2013 II International Congress of","vol":"none","pp.": "1-6","Year": "2013","ISSN":"none","ISBN":"none"},{"authors":["Marta Kolasa","ugosz"],"article name":"An advanced software model for optimization of self-organizing neural networks oriented on implementation in hardware","Journal Name":"Mixed Design of Integrated Circuits & Systems (MIXDES) 2015 22nd International Conference","vol":"none","pp.": "266-271","Year": "2015","ISSN":"none","ISBN":"none"},{"authors":["Marta Kolasa","ugosz","Witold Pedrycz"],"article name":"Problem of efficient initialization of large Self-Organizing Maps implemented in the CMOS technology","Journal Name":"Cybernetics (CYBCONF) 2015 IEEE 2nd International Conference on","vol":"none","pp.": "36-41","Year": "2015","ISSN":"none","ISBN":"none"},{"authors":["Xiaojun Zhai","Kofi Appiah","Shoaib Ehsan","Gareth Howells","Huosheng Hu","Dongbing Gu","Klaus D. McDonald-Maier"],"article name":"A Method for Detecting Abnormal Program Behavior on Embedded Devices","Journal Name":"Information Forensics and Security IEEE Transactions on","vol.": "10","pp.": "1692-1704","Year": "2015","ISSN": "1556-6013","ISBN":"none"},{"authors":["Hsu-Chih Huang"],"article name":"SoPC-Based Parallel ACO Algorithm and its Application to Optimal Motion Controller Design for Intelligent Omnidirectional Mobile Robots","Journal Name":"Industrial Informatics IEEE Transactions on","vol.": "9","pp.": "1828-1835","Year": "2013","ISSN": "1551-3203","ISBN":"none"},{"authors":["Hiroomi Hikawa","Yutaka Maeda"],"article name":"Improved Learning Performance of Hardware Self-Organizing Map Using a Novel Neighborhood Function","Journal Name":"Neural Networks and Learning Systems IEEE Transactions on","vol.": "26","pp.": "2861-2873","Year": "2015","ISSN": "2162-237X","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Miguel Angelo de Abreu de Sousa","Ricardo Pires","Emilio Del-Moral-Hernandez"],"article name":"OFDM symbol identification by an unsupervised learning system under dynamically changing channel effects","Journal Name":"Neural Computing and Applications","vol":"none","pp.":"none","Year": "2017","ISSN": "0941-0643","ISBN":"none"},{"authors":["Ehsan Mohebi","Adil Bagirov"],"article name":"Modified self-organising maps with a new topology and initialisation algorithm","Journal Name":"Journal of Experimental & Theoretical Artificial Intelligence","vol.": "27","pp.": "351","Year": "2015","ISSN": "0952-813X","ISBN":"none"},{"authors":["Marta Kolasa","Tomasz Talaska","ugosz"],"article name":"A novel recursive algorithm used to model hardware programmable neighborhood mechanism of self-organizing neural networks","Journal Name":"Applied Mathematics and Computation","vol":"none","pp.":"none","Year": "2015","ISSN": "00963003","ISBN":"none"},{"authors":["Xiaojun Zhai","Kofi Appiah","Shoaib Ehsan","Gareth Howells","Huosheng Hu","Dongbing Gu","Klaus McDonald-Maier"],"article name":"Exploring ICMetrics to detect abnormal program behaviour on embedded devices","Journal Name":"Journal of Systems Architecture","vol":"none","pp.":"none","Year": "2015","ISSN": "13837621","ISBN":"none"}]}]}