{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 4, "citationCountPatent": 0, "totalDownloads": 856},"doi": "10.1109/TCSVT.2011.2177177","title": "A Linear Dynamical System Framework for Salient Motion Detection","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "Detection of salient motion in a video involves determining which motion is attended to by the human visual system in the presence of background motion that consists of complex visuals that are constantly changing. Salient motion is marked by its predictability compared to the more complex unpredictable motion of the background such as fluttering of leaves, ripples in water, dispersion of smoke, and others. We introduce a novel approach to detect salient motion based on the concept of &#x201C;observability&#x201D; from the output pixels, when the video sequence is represented as a linear dynamical system. The group of output pixels with maximum saliency is further used to model the holistic dynamics of the salient region. The pixel saliency map is bolstered by two region-based saliency maps, which are computed based on the similarity of dynamics of the different spatiotemporal patches in the video with the salient region dynamics, in a global as well as a local sense. The resulting algorithm is tested on a set of challenging sequences and compared to state-of-the-art methods to showcase its superior performance on grounds of its computational efficiency and ability to detect salient motion.","authors": [{"name": "Viswanath Gopalakrishnan", "affiliation": "Center for Multimedia and Network Technology, School of Computer Engineering, Nanyang Technological University, Singapore", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6193248/6086603/6086603-photo-1-small.gif", "p": ["Viswanath Gopalakrishnan received the B. Tech. degree in electronics and communication engineering from Regional Engineering College, Calicut (now National Institute of Technology Calicut), India, in 2001. Currently, he is pursuing the Ph. D. degree from the School of Computer Engineering, Nanyang Technological University, Singapore."]}}, {"name": "Deepu Rajan", "affiliation": "Center for Multimedia and Network Technology, School of Computer Engineering, Nanyang Technological University, Singapore", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6193248/6086603/6086603-photo-2-small.gif", "p": ["Deepu Rajan received the B.E. degree in electronics and communication engineering from the Birla Institute of Technology, Ranchi, India, the M.S. degree in electrical engineering from Clemson University, Clemson, SC, and the Ph.D. degree from the Indian Institute of Technology Bombay, Mumbai, India.", "He is currently an Associate Professor with the School of Computer Engineering, Nanyang Technological University, Singapore. His current research interests include computer vision and multimedia signal processing."]}}, {"name": "Yiqun Hu", "affiliation": "School of Computer Science and Software Engineering, University of Western Australia, Crawley, Australia", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6193248/6086603/6086603-photo-3-small.gif", "p": ["Yiqun Hu received the B.S. degree in computer science from Xiamen University, Xiamen, China, in 2002, and the Ph.D. degree in computer engineering from Nanyang Technological University, Singapore, in 2008.", "He is currently a Research Assistant Professor with the University of Western Australia, Perth, Australia."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Observability", "Dynamics", "Video sequences", "Mathematical model", "Vectors", "Computational modeling", "Covariance matrix"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video signal processing", "computer vision", "image representation", "image sequences", "motion estimation", "observability", "spatiotemporal phenomena"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["salient region dynamics", "linear dynamical system", "salient motion detection", "human visual system", "background motion", "observability", "video sequence representation", "holistic dynamics", "pixel saliency map", "region-based saliency map", "spatiotemporal patch"]}, {"type": "Author Keywords ", "kwd": ["video saliency", "Linear dynamical systems", "observability"]}],"citations":[{"ieee-citations":[{"authors":["Zhi Liu","Xiang Zhang","Shuhua Luo","Olivier Le Meur"],"article name":"Superpixel-Based Spatiotemporal Saliency Detection","Journal Name":"Circuits and Systems for Video Technology IEEE Transactions on","vol.": "24","pp.": "1522-1540","Year": "2014","ISSN": "1051-8215","ISBN":"none"},{"authors":["Zhi Liu","Junhao Li","Linwei Ye","Guangling Sun","Liquan Shen"],"article name":"Saliency Detection for Unconstrained Videos Using Superpixel-Level Graph and Spatiotemporal Propagation","Journal Name":"Circuits and Systems for Video Technology IEEE Transactions on","vol.": "27","pp.": "2527-2542","Year": "2017","ISSN": "1051-8215","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Bing Yang","Xiaoyun Zhang","Li Chen","Zhiyong Gao"],"article name":"Spatiotemporal Salient Object Detection Based on Distance Transform and Energy Optimization","Journal Name":"Neurocomputing","vol":"none","pp.":"none","Year": "2017","ISSN": "09252312","ISBN":"none"},{"authors":["Junhao Li","Zhi Liu","Xiang Zhang","Olivier Le Meur","Liquan Shen"],"article name":"Spatiotemporal saliency detection based on superpixel-level trajectory","Journal Name":"Signal Processing: Image Communication","vol":"none","pp.":"none","Year": "2015","ISSN": "09235965","ISBN":"none"}]}]}