{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 9, "citationCountPatent": 0, "totalDownloads": 1196},"doi": "10.1109/TCSVT.2012.2189478","title": "Tagging Webcast Text in Baseball Videos by Video Segmentation and Text Alignment","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "Sports video annotation, an active research area in the field of multimedia content understanding, is an essential process in applications, such as summarization, highlight extraction, event detection, and retrieval. This paper considers the issue in relation to the annotation of baseball videos. Conventional baseball video annotation frameworks are based primarily on video content analysis, such as scoreboard recognition and machine learning techniques, which require a substantial amount of human input to collect and organize training data. The performance of such frameworks might become unstable if they encounter audiovisual patterns not included in the training data. To address the issue, we propose a novel framework for baseball video annotation that aligns high-level webcast text with low-level video content. Several cues, which are derived from the video content and webcast text, are utilized for alignment by leveraging hierarchical agglomerative clustering and genetic algorithm optimization. In addition, we develop an unsupervised method to learn the pitch segment properties of baseball videos by Markov random walk, and thereby reduce the need for human intervention substantially. Our experiments demonstrate that the proposed framework yields a robust result against a variety of video content and enhances the automaticity in baseball video annotation.","authors": [{"name": "Chih-Yi Chiu", "affiliation": "Department of Computer Science and Information Engineering, National Chiayi University, Chiayi, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6159070/6159070-photo-1-small.gif", "p": ["Chih-Yi Chiu (M'10) received the B.S. degree in information management from National Taiwan University, Taipei, Taiwan, in 1997, and the M.S. degree in computer science from National Taiwan University in 1999, and the Ph.D. degree in computer science from National Tsing Hua University, Hsinchu, Taiwan, in 2004.", "From January 2005 to July 2009, he was with Academia Sinica, Taipei, as a Post-Doctoral Fellow. In August 2009, he joined the Department of Computer Science and Information Engineering, National Chiayi University, Chiayi, Taiwan, as an Assistant Professor. His current research interests include multimedia retrieval, human–computer interaction, and digital archiving."]}}, {"name": "Po-Chih Lin", "affiliation": "Department of Computer Science and Information Engineering, National Chiayi University, Chiayi, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6159070/6159070-photo-2-small.gif", "p": ["Po-Chih Lin received the B.S. and M.S. degrees in information and computer engineering from Chung Yuan Christian University, Chungli, Taiwan, in 2008 and 2010, respectively.", "From September 2010 to October 2010, he was with the Department of Computer Science and Information Engineering, National Chiayi University, Chiayi, Taiwan. He is currently with VIA Technologies, Inc., Taipei, Taiwan. His current research interests include multimedia retrieval, nonphotorealistic rendering, and image processing."]}}, {"name": "Sheng-Yang Li", "affiliation": "Department of Computer Science and Information Engineering, National Chiayi University, Chiayi, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6159070/6159070-photo-3-small.gif", "p": ["Sheng-Yang Li received the B.S. degree in computer science and information engineering from Chang Jung Christian University, Tainan, Taiwan, in 2010.", "In August 2010, he joined the Department of Computer Science and Information Engineering, National Chiayi University, Chiayi, Taiwan, as a Graduate Student. His current research interests include multimedia retrieval and human–computer interaction."]}}, {"name": "Tsung-Han Tsai", "affiliation": "Department of Computer Science and Information Engineering, National Chiayi University, Chiayi, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6159070/6159070-photo-4-small.gif", "p": ["Tsung-Han Tsai received the B.S. degree in computer science and information engineering from National Chiayi University, Chiayi, Taiwan, in 2011.", "In August 2011, he joined the Department of Computer Science and Information Engineering, National Chiayi University, as a Graduate Student. His current research interests include multimedia content analysis and retrieval."]}}, {"name": "Yu-Lung Tsai", "affiliation": "Department of Computer Science and Information Engineering, National Chiayi University, Chiayi, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6159070/6159070-photo-5-small.gif", "p": ["Yu-Lung Tsai received the B.S. degree in computer science and information engineering from National Chiayi University, Chiayi, Taiwan, in 2011.", "In August 2011, he joined the Department of Computer Science and Information Engineering, National Chiayi University, as a Graduate Student. His current research interests include image processing and computer graphics."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Videos", "Sports equipment", "Games", "Hidden Markov models", "Event detection", "Markov processes", "Face"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video retrieval", "image segmentation"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["Markov random walk", "tagging Webcast text", "baseball video", "video segmentation", "text alignment", "sport video annotation", "multimedia content", "highlight extraction", "event detection", "machine learning technique", "scoreboard recognition", "low-level video content", "genetic algorithm optimization", "hierarchical agglomerative clustering"]}, {"type": "Author Keywords ", "kwd": ["video annotation", "Event detection", "genetic algorithm", "multimodal fusion", "unsupervised learning"]}],"citations":[{"ieee-citations":[{"authors":["Gyeong-June Hahm","Keeseong Cho"],"article name":"Event-based sport video segmentation using multimodal analysis","Journal Name":"Information and Communication Technology Convergence (ICTC) 2016 International Conference on","vol":"none","pp.": "1119-1121","Year": "2016","ISSN":"none","ISBN":"none"},{"authors":["Maheshkumar H. Kolekar","Somnath Sengupta"],"article name":"Bayesian Network-Based Customized Highlight Generation for Broadcast Soccer Videos","Journal Name":"Broadcasting IEEE Transactions on","vol.": "61","pp.": "195-209","Year": "2015","ISSN": "0018-9316","ISBN":"none"},{"authors":["Shifeng Chen","Qiang Zhou","Huijun Ding"],"article name":"Learning Boundary and Appearance for Video Object Cutout","Journal Name":"Signal Processing Letters IEEE","vol.": "21","pp.": "101-104","Year": "2014","ISSN": "1070-9908","ISBN":"none"},{"authors":["Chun-Min Chen","Ling-Hwei Chen"],"article name":"Novel framework for sports video analysis: A basketball case study","Journal Name":"Image Processing (ICIP) 2014 IEEE International Conference on","vol":"none","pp.": "961-965","Year": "2014","ISSN":"none","ISBN":"none"},{"authors":["Komei Arasawa","Shun Hattori"],"article name":"Comparative Experiments on Models for Automatic Baseball Video Tagging","Journal Name":"Soft Computing and Intelligent Systems (SCIS) and 17th International Symposium on Advanced Intelligent Systems 2016 Joint 8th International Conference on","vol":"none","pp.": "678-685","Year": "2016","ISSN":"none","ISBN":"none"},{"authors":["Anubhav Kumar"],"article name":"An efficient text extraction algorithm in complex images","Journal Name":"Contemporary Computing (IC3) 2013 Sixth International Conference on","vol":"none","pp.": "6-12","Year": "2013","ISSN":"none","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Wei-Ta Chu","Yung-Chieh Chou"],"article name":"On broadcasted game video analysis: event detection highlight detection and highlight forecast","Journal Name":"Multimedia Tools and Applications","vol":"none","pp.":"none","Year": "2016","ISSN": "1380-7501","ISBN":"none"},{"authors":["Komei Arasawa","Shun Hattori"],"article name":"Automatic Baseball Video Tagging Based on Voice Pattern Prioritization and Recursive Model Localization","Journal Name":"Journal of Advanced Computational Intelligence and Intelligent Informatics","vol.": "21","pp.": "1262","Year": "2017","ISSN": "1883-8014","ISBN":"none"},{"authors":["Palaiahnakote Shivakumara","R. Raghavendra","Longfei Qin","Kiran B. Raja","Tong Lu","Umapada Pal"],"article name":"A new multi-modal approach to bib number/text detection and recognition in Marathon images","Journal Name":"Pattern Recognition","vol.": "61","pp.": "479","Year": "2017","ISSN": "00313203","ISBN":"none"}]}]}