{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 2, "citationCountPatent": 0, "totalDownloads": 592},"doi": "10.1109/TCSVT.2011.2171213","title": "A 135 MHz 542 k Gates High Throughput H.264/AVC Scalable High Profile Decoder","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "To satisfy the requirement of application heterogeneities, the latest H.264/AVC based video coding standard called scalable video coding additional includes temporal, SNR, and spatial scalabilities for frame rate, quality, and frame resolution adaptation. However, these inclusions significantly increase chip design difficulties such as decoding time, memory bandwidth, and area cost. This paper presents an H.264/AVC scalable high profile decoder realization with several optimization techniques to provide high throughput video decoding. For decoding flow, this paper proposes an one-pass macroblock-based quality layer decoding flow for SNR scalability and 71% of external memory bandwidth and 66% of macroblock processing cycles can be saved. For texture padding in interlayer intra prediction, the modified padding flow can save 26% of decoding time. For interlayer predictor design, this paper proposes a centralized concept for accumulation-based calculation of corresponding spatial position, simplified poly-phase interpolator, and efficient motion vector generator to save area cost and decoding time. Furthermore, the residual reconstruction path with the parallel-pipeline architecture is also proposed to cope with the additional decoding complexity and thus leads to 54% of gate count savings compared to the traditional serial-pipeline architecture. Finally, the proposed H.264/AVC scalable high profile decoder design is implemented with 90 nm CMOS technology and it costs 542 k gate count and 39.66 Kbytes on-chip memory while is capable to decode 60 frames/s for resolution with three quality layers at 135 MHz operating frequency.","authors": [{"name": "Gwo-Long Li", "affiliation": "Industrial Technology Research Institute, Hsinchu, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6041017/6041017-photo-1-small.gif", "p": ["Gwo-Long Li received the B.S. degree from the Department of Computer Science and Information Engineering, Shu-Te University, Kaohsiung, Taiwan, in 2004, the M.S. degree from the Department of Electrical Engineering, National Dong-Hwa University, Hualien, Taiwan, in 2006, and the Ph.D. degree from the Department of Electronics Engineering, National Chiao-Tung University, Hsinchu, Taiwan, in 2011.", "He is currently an Engineer with the Industrial Technology Research Institute, Hsinchu. His current research interests include the video signal processing and its very large scale integration architecture design.", "Dr. Li received the Excellent Master Thesis Award from the Institute of Information and Computer Machinery in 2006."]}}, {"name": "Yu-Chen Chen", "affiliation": "VLSI Signal Processing Laboratory, National Chiao-Tung University, Hsinchu, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6041017/6041017-photo-2-small.gif", "p": ["Yu-Chen Chen received the M.S. degree from the Department of Electronics Engineering, National Chiao-Tung University (NCTU), Hsinchu, Taiwan, in 2010.", "In 2008, he joined the VLSI Signal Processing Laboratory, NCTU. His current research interests include signal processing, scalable video coding, as well as very large scale integration architecture design of video decoder."]}}, {"name": "Yuan-Hsin Liao", "affiliation": "PixArt Imagine, Inc., Hsinchu, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6041017/6041017-photo-3-small.gif", "p": ["Yuan-Hsin Liao received the B.S. and M.S. degrees in electronics engineering from National Chiao-Tung University, Hsinchu, Taiwan, in 2008 and 2010, respectively.", "In 2010, he joined PixArt Imagine, Inc., Hsinchu. His current research interests include video processing, computer vision, IP, and system-on-chip design."]}}, {"name": "Po-Yuan Hsu", "affiliation": "Department of Electronics Engineering, National Chiao-Tung University, Hsinchu, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6041017/6041017-photo-4-small.gif", "p": ["Po-Yuan Hsu received the B.S. and M.S. degrees from the Department of Electronics Engineering, National Chiao-Tung University, Hsinchu, Taiwan, in 2007 and 2009, respectively.", "His current research interests include digital signal processing, scalable video coding, and associated very large scale integration architectures."]}}, {"name": "Meng-Hsun Wen", "affiliation": "PixArt Imagine, Inc., Hsinchu, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6041017/6041017-photo-5-small.gif", "p": ["Meng-Hsun Wen received the B.S. and M.S. degrees in electrical engineering from National Chiao-Tung University, Hsinchu, Taiwan, in 2009 and 2011, respectively.", "After graduation, he joined PixArt Imagine, Inc., Hsinchu. His major research interests include H.264/AVC video coding and associated very large scale integration architecture design."]}}, {"name": "Tian-Sheuan Chang", "affiliation": "Department of Electronics Engineering, National Chiao-Tung University, Hsinchu, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6041017/6041017-photo-6-small.gif", "p": ["Tian-Sheuan Chang (S'93–M'06–SM'07) received the B.S., M.S., and Ph.D. degrees in electronic engineering from National Chiao-Tung University (NCTU), Hsinchu, Taiwan, in 1993, 1995, and 1999, respectively.", "He is currently an Associate Professor with the Department of Electronics Engineering, NCTU. From 2000 to 2004, he was a Deputy Manager with Global Unichip Corporation, Hsinchu. His current research interests include (silicon) intellectual property and system-on-a-chip design, very large scale integration signal processing, and computer architecture."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Decoding", "Scalability", "Memory management", "Static VAr compensators", "Entropy", "Throughput", "Hardware"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video coding", "CMOS integrated circuits", "decoding", "image motion analysis", "image reconstruction", "image texture", "optimisation"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["size 90 nm", "H.264/AVC", "scalable high profile decoder", "video coding standard", "scalable video coding", "temporal scalability", "SNR scalability", "spatial scalability", "frame rate", "frame quality", "frame resolution", "decoding time", "memory bandwidth", "area cost", "optimization technique", "high throughput video decoding flow", "macroblock-based quality layer decoding", "macroblock processing cycle", "texture padding", "interlayer intra prediction", "accumulation-based calculation", "poly-phase interpolator", "motion vector generator", "residual reconstruction path", "parallel-pipeline architecture", "decoding complexity", "CMOS technology", "on-chip memory", "frequency 135 MHz"]}, {"type": "Author Keywords ", "kwd": ["very large scale integration (VLSI) design", "Scalable video coding (SVC)", "SVC decoder"]}],"citations":[{"ieee-citations":[{"authors":["Chao-Tsung Huang","Mehul Tikekar","Anantha P. Chandrakasan"],"article name":"Memory-Hierarchical and Mode-Adaptive HEVC Intra Prediction Architecture for Quad Full HD Video Decoding","Journal Name":"Very Large Scale Integration (VLSI) Systems IEEE Transactions on","vol.": "22","pp.": "1515-1525","Year": "2014","ISSN": "1063-8210","ISBN":"none"},{"authors":["Xiaocong Lian","Zhenyu Liu","Wei Zhou","Zhemin Duan"],"article name":"Lossless Frame Memory Compression Using Pixel-Grain Prediction and Dynamic Order Entropy Coding","Journal Name":"Circuits and Systems for Video Technology IEEE Transactions on","vol.": "26","pp.": "223-235","Year": "2016","ISSN": "1051-8215","ISBN":"none"}]},{"nonieee-citations":[]}]}