{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 8, "citationCountPatent": 0, "totalDownloads": 1553},"doi": "10.1109/TCSVT.2012.2186742","title": "A 10-bit CMOS DAC With Current Interpolated Gamma Correction for LCD Source Drivers","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "This paper presents a compact 10-bit digital-to-analog converter (DAC) for LCD source drivers. The cyclic DAC architecture is used to reduce the area of LCD column drivers when compared to the use of conventional resistor-string DACs. The current interpolation technique is proposed to perform gamma correction after D/A conversion. The gamma correction circuit is shared by four DAC channels using the interleave technique. A prototype 10-bit DAC with gamma correction function is implemented in 0.35 &#x03BC;m CMOS technology and its average die size per channel is 0.053 mm<sup>2</sup>, which is smaller than those of the R-DACs with gamma correction function. The settling time of the 10-bit DAC is 1 &#x03BC;s, and the maximum INL and DNL are 2.13 least significant bit (LSB) and 1.30 LSB, respectively.","authors": [{"name": "Pang-Jung Liu", "affiliation": "Department of Electrical Engineering, National Taipei University of Technology, Taipei, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6209393/6148267/6148267-photo-1-small.gif", "p": ["Pang-Jung Liu (S'08–M'10) received the B.S. and M.S. degrees from the National Taiwan University of Science and Technology, Taipei, Taiwan, in 1998 and 2000, respectively, and the Ph.D. degree from the Graduate Institute of Electronics Engineering, National Taiwan University, Taipei, in 2010.", "From 2000 to 2003, he was a Testing Engineer with Taiwan Semiconductor Manufacturing Company, San Jose, CA. From 2003 to 2005, he was working on a digital integrated circuit (IC) design with ELAN Microelectronics Corporation, Hsinchu, Taiwan. From August 2010 to January 2012, he was with the Department of Electrical Engineering, National Ilan University, Ilan, Taiwan. Since February 2012, he has been with the Department of Electrical Engineering, Taipei University of Technology, Taipei, where he is currently an Assistant Professor. His current research interests include power management IC, LCD/LED drivers, and mixed-mode IC design."]}}, {"name": "Yi-Jan Emery Chen", "affiliation": "Graduate Institute of Electronics Engineering, National Taiwan University, Taipei, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6209393/6148267/6148267-photo-2-small.gif", "p": ["Yi-Jan Emery Chen (S'97–M'01–SM'07) received the B.S. degree in electrical engineering from National Taiwan University, Taipei, Taiwan, in 1987, the M.S. degree in electrical and computer engineering from the University of California, Santa Barbara, in 1991, and the Ph.D. degree in electrical engineering from the Georgia Institute of Technology, Atlanta, in 2001.", "From 1992 to 1993, he was a Software Engineer with Siemens Telecommunication, Taiwan, where he was involved with synchronous optical network equipment development. From 1993 to 1996, he was with Tektronix, Taiwan, where he was responsible for electronic test and measurement solutions. From 2000 to 2002, he was with National Semiconductor, Atlanta, where he was involved with radio-frequency (RF) transceiver and RF power amplifier design. In 2002, he was with the Georgia Institute of Technology as a Member of the Research Faculty. Since 2003, he has been with National Taiwan University, where he is currently an Associate Professor. He has authored or coauthored over 90 refereed journal and conference papers. His current research interests include the design of RF integrated circuits, RF power amplifiers, LCD/LED drivers, and power management integrated circuits (ICs).", "Dr. Chen is currently an Associate Editor of the IEEE Microwave and Wireless Components Letters, and a member of the IEEE Microwave Theory and Techniques Society (IEEE MTT-S) TC-24 on RFID Technologies. He has been serving on the technical program committees of the IEEE MTT-S International Microwave Symposium (IMS) and the IEEE Radio and Wireless Symposium since 2008. He was the co-recipient of the 2000 IEEE MTT-S IMS Best Student Paper Award and the co-recipient of the 2008 University Team Award for Contribution to Industrial Economics from the Ministry of Economic Affairs, Taiwan. He has been the Advisor of several student award recipients, including the Chi-Mei Award, the Macronix Golden Silicon Award, the Paper Award from the Institute of Chinese Electrical Engineering, and the Master Thesis Award from the Taiwan IC Design Society."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Interpolation", "Gray-scale", "Materials", "Computer architecture", "Microprocessors", "Electronic mail", "Active matrix liquid crystal displays"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["driver circuits", "CMOS integrated circuits", "digital-analogue conversion"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["time 1 mus", "CMOS DAC", "current interpolated gamma correction", "LCD source driver", "digital-to-analog converter", "conventional resistor-string DAC", "D/A conversion", "gamma correction", "R-DAC", "INL", "DNL", "least significant bit", "LSB", "word length 10 bit", "size 0.35 mum", "word length 2.13 bit", "word length 1.30 bit"]}, {"type": "Author Keywords ", "kwd": ["LCD driver", "Current interpolation", "digital-to-analog converter (DAC)", "gamma correction"]}],"citations":[{"ieee-citations":[{"authors":["Hyeon-Cheon Seol","Seong-Kwan Hong","Oh-Kyong Kwon"],"article name":"An Area-Efficient High-Resolution Resistor-String DAC with Reverse Ordering Scheme for Active Matrix Flat-Panel Display Data Driver ICs","Journal Name":"Display Technology Journal of","vol.": "12","pp.": "828-834","Year": "2016","ISSN": "1551-319X","ISBN":"none"},{"authors":["Bill Ma","Qinjin Huang","Fengqi Yu"],"article name":"A 12-bit 1.74-mW 20-MS/s DAC with resistor-string and current-steering hybrid architecture","Journal Name":"System-on-Chip Conference (SOCC) 2015 28th IEEE International","vol":"none","pp.": "1-6","Year": "2015","ISSN": "2164-1706","ISBN":"none"},{"authors":["Nivethithaa Ravikumar","Zaniar Hoseini","Kye-Shin Lee","S. I. Hariharan","Yong-Min Lee"],"article name":"An area efficient 10-bit time mode hybrid DAC with current settling error compensation","Journal Name":"Circuits and Systems (MWSCAS) 2015 IEEE 58th International Midwest Symposium on","vol":"none","pp.": "1-4","Year": "2015","ISSN":"none","ISBN":"none"},{"authors":["Tao Huang","Hong Ge Li"],"article name":"Based on programmable current buffer 10-bit DAC for AMOLED source driver","Journal Name":"Electron Devices and Solid-State Circuits (EDSSC) 2017 International Conference on","vol":"none","pp.": "1-2","Year": "2017","ISSN":"none","ISBN":"none"},{"authors":["Hyun-Sik Kim","Dong-Kyu Kim"],"article name":"An Active-Matrix OLED Driver CMOS IC With Compensation of Non-Uniform Routing-Line Resistances in Ultra-Thin Panel Bezel","Journal Name":"Solid-State Circuits IEEE Journal of","vol.": "53","pp.": "484-500","Year": "2018","ISSN": "0018-9200","ISBN":"none"},{"authors":["Pang-Jung Liu","Jun-Sheng Hong","Jian-Min Wang"],"article name":"A fast-transient buffer with voltage booting technique for LCD column drivers","Journal Name":"Information Science Electronics and Electrical Engineering (ISEEE) 2014 International Conference on","vol.": "1","pp.": "535-539","Year": "2014","ISSN":"none","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Chung-Yi Ting","Pang-Jung Liu"],"article name":"Low-power buffer with voltage boosting and improved frequency compensation for liquid crystal display source drivers","Journal Name":"IET Circuits Devices & Systems","vol.": "8","pp.": "263","Year": "2014","ISSN": "1751-858X","ISBN":"none"},{"authors":["Dong-Gil Jeong","Sang-Min Park","Yu-Jeong Hwang","Young-Chan Jang"],"article name":"Active-RC Channel Selection Filter with 40MHz Bandwidth and Improved Linearity","Journal Name":"Journal of the Korea Institute of Information and Communication Engineering","vol.": "19","pp.": "149","Year": "2015","ISSN": "2234-4772","ISBN":"none"}]}]}