{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 7, "citationCountPatent": 0, "totalDownloads": 1020},"doi": "10.1109/TCSVT.2011.2165592","title": "Effective Search Point Reduction Algorithm and its VLSI Design for HDTV H.264/AVC Variable Block Size Motion Estimation","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "Variable block size motion estimation (VBSME) in H.264/AVC has greatly led to achieve an optimal inter frame encoding. However, the computation burden of the VBSME becomes the bottleneck of the H.264/AVC encoders. The conventional architecture in hardware realization is hard to adopt a fast software algorithm suitable to reduce the VBSME computation burden. Therefore, this paper presents a search point reduction (SPR) algorithm with an efficient hardware design, able to decrease the motion estimation time while maintaining the coding performance of H.264. The effectiveness of the proposed method is compared with those of existing methods with respect to chip area, operation frequency, and throughput rate. The proposed SPR algorithm increases the coding speed by around 90%; with a peak signal-to-noise ratio drop of less than 0.1 dB than that achieved by the JM reference software. The proposed SPR algorithm can operate at 200 MHz with 191 k gate count, which supports high-definition television 1280&amp;nbsp;&amp;nbsp;720 format.","authors": [{"name": "An-Chao Tsai", "affiliation": "Department of Electrical Engineering, National Cheng Kung University, Tainan, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6019029/6019029-photo-1-small.gif", "p": ["An-Chao Tsai received the M.S. degree in electronic engineering from Da-Yeh University, Changhua, Taiwan, in 2004, and the Ph.D. degree from National Cheng Kung University, Tainan, Taiwan, in 2010.", "He has been a Senior Engineer with Hon Hai Precision Industry Company, Ltd., Taipei, Taiwan, since 2010. His current research interests include video coding technology, scalable video coding, high efficiency video coding, camera applications, Android application development, and associated very large-scale integrated architecture designs."]}}, {"name": "K. Bharanitharan", "affiliation": "Department of Electrical Engineering, National Cheng Kung University, Tainan, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6019029/6019029-photo-2-small.gif", "p": ["K. Bharanitharan (S'07–M'09) received the Ph.D. degree in electrical engineering from National Cheng Kung University, Tainan, Taiwan, in 2009.", "He has published more than 16 research papers in highly reputed journals and conferences. His current research interests include H.264/advanced video coding, high efficiency video coding, scalable video coding, image processing, multiview video coding, associated very large scale integration architectures, multicore reconfigurable systems, Java-based applications development, and dynamic power management for advanced video coding.", "Dr. Bharanitharan received the Outstanding International Student Fellowship Award from National Cheng Kung University in 2005. He has been a reviewer for the IEEE Transactions on circuits and systems for video technology, the IEEE Transactions on very large scale integration systems, the IEEE Transactions onevolutionary computation, the IEEE Signal processing letters, and the IEEE Transactions on very large scale integration systems since 2009."]}}, {"name": "Jhing-Fa Wang", "affiliation": "Department of Electrical Engineering, National Cheng Kung University, Tainan, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6019029/6019029-photo-3-small.gif", "p": ["Jhing-Fa Wang (F'99) received the Bachelors degree in 1973 and the Masters degree in 1979 from National Cheng Kung University (NCKU), Tainan, Taiwan, and the Ph.D. degree from the Stevens Institute of Technology, Hoboken, NJ, in 1983.", "He is currently the Chair and Distinguished Professor with the Department of Electrical Engineering, NCKU. His current research interests include multimedia signal processing including speech signal processing, image processing, and very large-scale integrated system designs. He has published about 130 journal papers in IEEE, SIAM, IEICE, and IEE, and about 200 international conference papers.", "Prof. Wang received the Outstanding Research Award and the Outstanding Researcher Award from the National Science Council in 1990, 1995, 1997, and 2006, respectively. He received the Outstanding Industrial Award from ACER and the Institute of Information Industry, and the Outstanding Professor Award from the Chinese Engineer Association, Taiwan, in 1991 and 1996, respectively. He received the Culture Service Award from the Ministry of Education, Taiwan, in 2008, and the Distinguished Scholar Award of K. T. Li from NCKU in 2009. He was also invited to give the Keynote Speeches in PACLIC 12, Singapore, in 1998, UWN 2005 in Taipei, WirlessCom 2005 in Hawaii, IIH-MSP2006 in Pasadena, CA, ISM2007 in Taichung, and PCM 2008 in Tainan. He was an Associate Editor of the IEEE Transactions on neural network and the IEEE Transactions on very large-Scale integrated systems. He was the Editor-in-Chief of the International Journal of Chinese Engineering from 1995 to 2000. He is the Formal Chair of the IEEE Tainan Section and the Coordinator of Section/Chapter, Region 10, IEEE."]}}, {"name": "Kuan-I Lee", "affiliation": "Department of Electrical Engineering, National Cheng Kung University, Tainan, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6019029/6019029-photo-4-small.gif", "p": ["Kuan-I Lee was born in Tainan, Taiwan, in 1983. He received the B.S. degree in mechanical engineering from National Central University, Taoyuan, Taiwan, in 2004, and the M.S. degree in electrical engineering from National Cheng Kung University, Tainan, in 2006.", "He is currently a Staff Engineer with Realtek Semiconductor Corporation, Hsinchu, Taiwan. His current research interests include multimedia processing, wireless communication, and digital and analog circuit designs."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Random access memory", "Strips", "Algorithm design and analysis", "Arrays", "Hardware", "Motion estimation"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["VLSI", "data compression", "motion estimation", "video coding"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["frequency 200 MHz", "effective search point reduction algorithm", "VLSI design", "HDTV H.264-AVC variable block size motion estimation", "VBSME", "SPR algorithm", "JM reference software", "high-definition television"]}, {"type": "Author Keywords ", "kwd": ["variable block size motion estimation", "2-D systolic array", "H.264/AVC"]}],"citations":[{"ieee-citations":[{"authors":["Caoyang Jiang","Saeid Nooshabadi"],"article name":"Parallel Multiview Video Coding Exploiting Group of Pictures Level Parallelism","Journal Name":"Parallel and Distributed Systems IEEE Transactions on","vol.": "27","pp.": "2316-2328","Year": "2016","ISSN": "1045-9219","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Haibing Yin","Huizhu Jia","Jun Zhou","Zhiyong Gao"],"article name":"Survey on Algorithm and VLSI Architecture for MPEG-Like Video Coder","Journal Name":"Journal of Signal Processing Systems","vol":"none","pp.":"none","Year": "2016","ISSN": "1939-8018","ISBN":"none"},{"authors":["Rohan Mukherjee","Vikrant Mahajan","Anindya Sundar Dhar","Indrajit Chakrabarti"],"article name":"High Performance VISI Design of Diamond Search Algorithm for Fast Motion Estimation","Journal Name":"Journal of Circuits Systems and Computers","vol":"none","pp.": "1650114","Year": "2016","ISSN": "0218-1266","ISBN":"none"},{"authors":["R. Mukherjee","B. Biswas","I. Chakrabarti","P.K. Dutta","A.K. Ray"],"article name":"Efficient VLSI Design of Adaptive Rood Pattern Search Algorithm for Motion Estimation of High Definition Videos","Journal Name":"Microprocessors and Microsystems","vol":"none","pp.":"none","Year": "2016","ISSN": "01419331","ISBN":"none"},{"authors":["S. Madan Arora","N. Rajpal","K. Khanna","R. Purwar"],"article name":"Improved Accuracy in Initial Search Center Prediction to Fasten Motion Estimation in h.264/AVC","Journal Name":"IETE Journal of Research","vol":"none","pp.": "1","Year": "2016","ISSN": "0377-2063","ISBN":"none"},{"authors":["Niras Cheeckottu Vayalil","Yinan Kong"],"article name":"VLSI Architecture of Full-Search Variable-Block-Size Motion Estimation for HEVC Video Encoding","Journal Name":"IET Circuits Devices & Systems","vol":"none","pp.":"none","Year": "2017","ISSN": "1751-858X","ISBN":"none"},{"authors":["Jun Luo","Xiaohua Yang","Liheng Liu"],"article name":"A fast motion estimation algorithm based on adaptive pattern and search priority","Journal Name":"Multimedia Tools and Applications","vol":"none","pp.":"none","Year": "2014","ISSN": "1380-7501","ISBN":"none"}]}]}