{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 1, "citationCountPatent": 0, "totalDownloads": 567},"doi": "10.1109/TCSVT.2011.2179459","title": "A Multiple Description Video Codec With Adaptive Residual Distributed Coding","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "Multiple description coding (MDC) decomposes one single media into several descriptions and transmits them over different channels for error resilience. Each description contributes to improving the reconstructed media quality when decoded. Distributed video coding (DVC) encodes multiple correlated images and utilizes error correction codes to shift the codec complexity to a joint decoder. Combining MDC with DVC (MDVC) yields a stable codec for mobile encoders. In this paper, to improve the MDVC codec performance, image correlations among the MDVC processing modules were exploited to improve reconstructed video quality and enhance transmission robustness. At the side encoder, a DVC-based adaptive differential pulse code modulation was designed to remove interframe redundancy to enhance rate-distortion performances. For the MDVC central decoding, intradescription and interdescription correlations were utilized to dynamically select the best reconstructed frames from two descriptions, instead of selecting just one description or all key-frames from two descriptions. Experiments showed that, as compared to previous methods, the proposed MDVC control method yielded 1-2 dB higher in image PSNRs for Wyner-Ziv reconstructed frames at the side decoder when encoding low-to-medium complexity videos. For high-complexity videos, it effectively prevents error correction of Wyner-Ziv frames from malfunctioning and yields about 3 dB higher in PSNR. The proposed MDVC central decoder control yields 1-4 dB higher PSNRs, as compared to side decoders. Under lossy transmission, it demonstrates 27-64% smaller PSNR variations, as compared to that of combining key-frames as the decoded video. The proposed MDVC system and control not only improve the DVC reconstructed video quality, but also reduce the quality fluctuation artifacts of MDC coded video for mobile coders.","authors": [{"name": "Jiann-Jone Chen", "affiliation": "Department of Electrical Engineering, National Taiwan University of Science and Technology, Taipei, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6193248/6101563/6101563-photo-1-small.gif", "p": ["Jiann-Jone Chen (M'05) received the B.S.E.E. and M.S.E.E. degrees from National Cheng-Kung University, Tainan, Taiwan, in 1989 and 1991, respectively, and the Ph.D.E.E. degree from National Chiao-Tung University, Hsinchu, Taiwan, in 1997.", "From 1999 to 2002, he was with the ITRI Computer and Communication Laboratories, Hsinchu. He joined the Department of Electrical Engineering, National Taiwan University of Science and Technology, Taipei, Taiwan, in August 2002. He has conducted research in video encoding, IPTV media streaming, image indexing, and image/video processing. His current research interests include various topics in digital image processing and multimedia communications.", "Dr. Chen received the ISI Classic Citation Award in 2001."]}}, {"name": "Shih-Chieh Lee", "affiliation": "Department of Electrical Engineering, National Taiwan University of Science and Technology, Taipei, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6193248/6101563/6101563-photo-2-small.gif", "p": ["Shih-Chieh Lee received the B.S.E.E. and M.S.E.E. degrees from Chung-Yuan Christian University, TaoYuan, Taiwan, in 1995 and 2003, respectively. He is currently pursuing the Ph.D.E.E. degree with the Department of Electrical Engineering, National Taiwan University of Science and Technology, Taipei, Taiwan.", "His current research interests include distributed video coding, multiview video coding, video compression, and multimedia communications."]}}, {"name": "Ching-Hua Chen", "affiliation": "Department of Electrical Engineering, National Taiwan University of Science and Technology, Taipei, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6193248/6101563/6101563-photo-3-small.gif", "p": ["Ching-Hua Chen received the B.S.E.E. and M.S.E.E. degrees from the National Kaohsiung University of Applied Sciences, Kaohsiung, Taiwan, and the National Taiwan University of Science and Technology, Taipei, Taiwan, in 2008 and 2010, respectively.", "His current research interests include distributed video coding, multiview video coding, video compression, and multimedia communications."]}}, {"name": "Chen-Hsiang Sun", "affiliation": "Department of Electrical Engineering, National Taiwan University of Science and Technology, Taipei, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6193248/6101563/6101563-photo-4-small.gif", "p": ["Chen-Hsiang Sun received the B.S.E.E. and M.S.E.E. degrees from the National Taiwan University of Science and Technology, Taipei, Taiwan, in 2006 and 2008, respectively.", "His current research interests include multiple description video coding, distributed video coding, and multimedia communications."]}}, {"name": "Jyun-Jie Jhuang", "affiliation": "Department of Electrical Engineering, National Taiwan University of Science and Technology, Taipei, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6193248/6101563/6101563-photo-5-small.gif", "p": ["Jyun-Jie Jhuang received the B.S.E.E. and M.S.E.E. degrees from the National Taiwan University of Science and Technology, Taipei, Taiwan, in 2007 and 2009, respectively.", "His current research interests include image coding, distributed video coding, and video communications."]}}, {"name": "Chi-Chun Lu", "affiliation": "Department of Electrical Engineering, National Taiwan University of Science and Technology, Taipei, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6193248/6101563/6101563-photo-6-small.gif", "p": ["Chi-Chun Lu received the B.S.E.E. and M.S.E.E. degrees from Fu-Jen Catholic University, New Taipei, Taiwan, and the National Taiwan University of Science and Technology, Taipei, Taiwan, in 2009 and 2011, respectively.", "His current research interests include multiview video coding, 3-D video coding, and multimedia communications."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Decoding", "Image reconstruction", "Silicon", "Encoding", "Codecs", "Quantization", "Static VAr compensators"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video coding", "adaptive codes", "computational complexity", "differential pulse code modulation", "error correction", "error statistics", "image reconstruction", "video codecs"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["low-to-medium complexity videos", "multiple description video codec", "adaptive residual distributed coding", "multiple description coding", "error resilience", "reconstructed media quality", "distributed video coding", "multiple correlated images", "utilizes error correction codes", "codec complexity", "joint decoder", "stable codec", "mobile encoders", "MDVC codec performance", "image correlations", "MDVC processing modules", "enhance transmission robustness", "side encoder", "DVC-based adaptive differential pulse code modulation", "interframe redundancy", "rate-distortion performances", "MDVC central decoding", "intradescription", "interdescription correlations", "MDVC control method", "Wyner-Ziv reconstructed frames", "side decoder"]}, {"type": "Author Keywords ", "kwd": ["Wyner&#x2013;Ziv video coder", "Adaptive central decoder control", "multiple description video coding", "residual distributed video coding"]}],"citations":[{"ieee-citations":[]},{"nonieee-citations":[{"authors":["Mohammad Kazemi","Shervin Shirmohammadi","Khosrow Haj Sadeghi"],"article name":"A review of multiple description coding techniques for error-resilient video delivery","Journal Name":"Multimedia Systems","vol.": "20","pp.": "283","Year": "2014","ISSN": "0942-4962","ISBN":"none"}]}]}