{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 3, "citationCountPatent": 0, "totalDownloads": 292},"doi": "10.1109/TCSVT.2011.2170112","title": "Saving Energy in Video Servers by the Use of Multispeed Disks","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "Energy consumption is an important issue in data centers, and disks use a significant proportion of the total energy. A promising approach to reducing disk energy consumption is to use multispeed disks with lower rotational speeds, and allowing disks to run slowly when workloads are light can reduce their large contribution to the power used by video servers. We formulate the prerequisites for speed reductions, and derive an energy model constrained by retrieval period. We then analyze the relationship between retrieval period, buffer size, and disk speed, and examine the effect of buffer allocation on energy consumption. We then propose a new video data retrieval scheme in which the retrieval period and the speed of each disk is dynamically changed to adjust disk bandwidth utilization, with the aim of allowing disks to run at lower speeds while guaranteeing jitter-free speed transitions. Experimental results show that our scheme achieves appreciable energy savings under all workloads. They also reveal that increasing the number of available speeds reduces energy consumption but the benefits gradually tail off.","authors": [{"name": "Manjong Kim", "affiliation": "School of Computer and Information Engineering, Inha University, Incheon, Korea", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6032079/6032079-photo-1-small.gif", "p": ["Manjong Kim (S'11) received the B.S. degree in computer engineering from Inha University, Incheon, Korea, in 2009. He is currently pursuing the M.S. degree from the School of Computer Science and Information Engineering, Inha University.", "His current research interests include embedded software and multimedia systems."]}}, {"name": "Minseok Song", "affiliation": "School of Computer and Information Engineering, Inha University, Incheon, Korea", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6032079/6032079-photo-2-small.gif", "p": ["Minseok Song (M'07) received the B.S. and M.S. degrees in computer engineering in 1996 and 1998, respectively, and the Ph.D. degree in electrical engineering and computer science in 2004, all from Seoul National University, Seoul, Korea.", "Since September 2005, he has been with the School of Computer Science and Information Engineering, Inha University, Incheon, Korea, where he is currently an Associate Professor. His current research interests include real-time, embedded systems and multimedia systems."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Streaming media", "Bandwidth", "Servers", "Prefetching", "Energy consumption", "Indexes", "Arrays"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video servers", "disc storage", "video retrieval"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["jitter-free speed transition", "energy saving", "video servers", "multispeed disks", "data centers", "disk energy consumption", "rotational speeds", "speed reductions", "energy model", "disk speed", "buffer allocation", "video data retrieval", "disk bandwidth utilization"]}, {"type": "Author Keywords ", "kwd": ["video-on-demand (VoD) systems", "Low-power systems", "video storage servers"]}],"citations":[{"ieee-citations":[]},{"nonieee-citations":[{"authors":["Minseok Song","Yeongju Lee","Jinhan Park"],"article name":"Scheduling a Video Transcoding Server to Save Energy","Journal Name":"ACM Transactions on Multimedia Computing Communications and Applications","vol.": "11","pp.": "1","Year": "2015","ISSN": "15516857","ISBN":"none"},{"authors":["Minseok Song","Yeongju Lee","Euiseok Kim"],"article name":"Saving disk energy in video servers by combining caching and prefetching","Journal Name":"ACM Transactions on Multimedia Computing Communications and Applications","vol.": "10","pp.": "1","Year": "2014","ISSN": "15516857","ISBN":"none"},{"authors":["Ce Yu","Jianmei Wang","Chao Sun","Xiaoxiao Lu","Jian Xiao","Jizhou Sun"],"Article Name":"none","Journal Name":"Lecture Notes in Computer Science","vol.": "10393","pp.": "791","Year": "2017","ISSN": "0302-9743","ISBN": "978-3-319-65481-2"}]}]}