{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 11, "citationCountPatent": 0, "totalDownloads": 555},"doi": "10.1109/TCSVT.2011.2181230","title": "Addressing Visual Consistency in Video Retargeting: A Refined Homogeneous Approach","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "For the video retargeting problem which adjusts video content into a smaller display device, it is not clear how to balance the three conflicting design objectives: 1) visual interestingness preservation; 2) temporal retargeting consistency; and 3) nondeformation. To understand their perceptual importance, we first identify that the latter two play a dominating role in making the retargeting results appealing. Then a statistical study on human response to the targeting scale is carried out, suggesting that the global preservation of contents pursued by most existing approaches is not necessary. Based on the newly prioritized objectives and the statistical findings, we design a video retargeting system which, as a refined homogeneous approach, addresses the temporal consistency issue holistically and is still capable of preserving high degree of visual interestingness. In particular, we propose a volume retargeting cost metric to jointly consider the retargeting objectives and formulate video retargeting as an optimization problem in graph representation. A dynamic programming solution is then given. In addition, we introduce a nonlinear fusion based attention model to measure the visual interestingness distribution. The experiment results from both image rendering and subjective tests indicate that our proposed attention modeling and video retargeting system outperform their conventional methods, respectively.","authors": [{"name": "Zheng Yuan", "affiliation": "Department of Electrical and Computer Engineering, University of Florida, Gainesville, FL, USA", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6209393/6111462/6111462-photo-1-small.gif", "p": ["Zheng Yuan received the B.S. degree in electrical engineering from Jilin University, Changchun, China, in 2006, and the M.S. degree in electrical engineering from Shanghai Jiao Tong University, Shanghai, China, in 2009. Currently, he is pursuing the Ph.D. degree with the Multimedia and Communication Network Group, Department of Electrical and Computer Engineering, University of Florida, Gainesville.", "His current research interests include video and image analysis/processing, video compression, multimedia, computer vision, and machine learning."]}}, {"name": "Taoran Lu", "affiliation": "Image Technology Group, Dolby Laboratories, Inc., Burbank, CA, USA", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6209393/6111462/6111462-photo-2-small.gif", "p": ["Taoran Lu received the Ph.D. degree in electrical and computer engineering from the University of Florida, Gainesville, in 2010.", "She is currently a Senior Research Engineer with the Image Technology Group, Dolby Laboratories, Inc., Burbank, CA. Her current research interests include image and video compression and transmission, next-generation video coding, image and video analysis, and computer vision."]}}, {"name": "Yu Huang", "affiliation": "Digital Media Solution Laboratory, Samsung Electronics America, Ridgefield Park, NJ, USA", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6209393/6111462/6111462-photo-3-small.gif", "p": ["Yu Huang received the Bachelors degree in information and control engineering from Xi'an Jiao-Tong University, Xi'an, China, in 1990, the Masters degree in electronic engineering from Xidian University, Xi'an, in 1993, and the Ph.D. degree in information science from Beijing Jiao-Tong University, Beijing, China, in 1997.", "He was a Post-Doctoral Research Associate with the Beckman Institute, University of Illinois at Urbana-Champaign, Urbana, from 2000 to 2003. He is currently a Senior Staff Research Engineer with the Digital Media Solution Laboratory, Samsung Electronics America, Ridgefield Park, NJ. His current research interests include image and video processing, computer vision, human–computer interaction, machine learning, image-based rendering, and augmented reality."]}}, {"name": "Dapeng Wu", "affiliation": "Department of Electrical and Computer Engineering, University of Florida, Gainesville, FL, USA", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6209393/6111462/6111462-photo-4-small.gif", "p": ["Dapeng Wu (S'98–M'04–SM'06) received the Ph.D. degree in electrical and computer engineering from Carnegie Mellon University, Pittsburgh, PA, in 2003.", "Currently, he is a Professor with the Department of Electrical and Computer Engineering, University of Florida, Gainesville."]}}, {"name": "Heather Yu", "affiliation": "Huawei Media Networking Laboratory, Bridgewater, NJ, USA", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6209393/6111462/6111462-photo-5-small.gif", "p": ["Heather Yu received the Ph.D. degree from Princeton University, Princeton, NJ, in 1998.", "Currently, she is the Director of the Huawei Media Networking Laboratory, Bridgewater, NJ. She holds 23 granted U.S. patents and has published more than 70 publications, including 4 books, P2P Networking and Applications, Semantic Computing, P2P Handbooks, and Multimedia Security Technologies for Digital Rights Management.", "Dr. Yu has served numerous positions with related associations, such as the Chair of the IEEE Multimedia Communications Tech Committee, member of the IEEE Communications Society Strategic Planning Committee Member, Chair of the IEEE Human Centric Communications Emerging Technology Committee Chair, Associate Editor-in-Chief for the Peer-to-Peer Networking and Applications journal, Associate Editor of several IEEE journals/magazines, and the Conference Chair and Technical Program Committee Chair for many conferences in the field."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Visualization", "Streaming media", "Humans", "Loss measurement", "Optimization", "Computational modeling"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video signal processing", "dynamic programming", "graph theory", "rendering (computer graphics)"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["subjective tests", "visual consistency", "video retargeting", "refined homogeneous approach", "video content", "display device", "visual interestingness preservation", "visual interestingness distribution", "temporal retargeting consistency", "perceptual importance", "human response", "volume retargeting cost metric", "optimization problem", "graph representation", "dynamic programming", "nonlinear fusion based attention model", "image rendering"]}, {"type": "Author Keywords ", "kwd": ["video retargeting", "Attention modeling", "confidence interval analysis", "dynamic programming", "subjective test"]}],"citations":[{"ieee-citations":[{"authors":["Zhi Liu","Xiang Zhang","Shuhua Luo","Olivier Le Meur"],"article name":"Superpixel-Based Spatiotemporal Saliency Detection","Journal Name":"Circuits and Systems for Video Technology IEEE Transactions on","vol.": "24","pp.": "1522-1540","Year": "2014","ISSN": "1051-8215","ISBN":"none"},{"authors":["Zhi Liu","Junhao Li","Linwei Ye","Guangling Sun","Liquan Shen"],"article name":"Saliency Detection for Unconstrained Videos Using Superpixel-Level Graph and Spatiotemporal Propagation","Journal Name":"Circuits and Systems for Video Technology IEEE Transactions on","vol.": "27","pp.": "2527-2542","Year": "2017","ISSN": "1051-8215","ISBN":"none"},{"authors":["Shih-Syun Lin","Chao-Hung Lin","Yu-Hsuan Kuo","Tong-Yee Lee"],"article name":"Consistent Volumetric Warping Using Floating Boundaries for Stereoscopic Video Retargeting","Journal Name":"Circuits and Systems for Video Technology IEEE Transactions on","vol.": "26","pp.": "801-813","Year": "2016","ISSN": "1051-8215","ISBN":"none"},{"authors":["Bo Yan","Binhang Yuan","Bo Yang"],"article name":"Effective Video Retargeting With Jittery Assessment","Journal Name":"Multimedia IEEE Transactions on","vol.": "16","pp.": "272-277","Year": "2014","ISSN": "1520-9210","ISBN":"none"},{"authors":["Bo Yan","Ke Li","Xiaochu Yang","Tingxiao Hu"],"article name":"Seam Searching-Based Pixel Fusion for Image Retargeting","Journal Name":"Circuits and Systems for Video Technology IEEE Transactions on","vol.": "25","pp.": "15-23","Year": "2015","ISSN": "1051-8215","ISBN":"none"},{"authors":["Shih-Syun Lin","Chao-Hung Lin","Shu-Huai Chang","Tong-Yee Lee"],"article name":"Object-Coherence Warping for Stereoscopic Image Retargeting","Journal Name":"Circuits and Systems for Video Technology IEEE Transactions on","vol.": "24","pp.": "759-768","Year": "2014","ISSN": "1051-8215","ISBN":"none"},{"authors":["Zhiquan Ren","Botao Wang","Yuchen Zhang","Hongkai Xiong"],"article name":"Visual preserving video retargeting with deformable shape consistency","Journal Name":"Multimedia and Expo (ICME) 2013 IEEE International Conference on","vol":"none","pp.": "1-6","Year": "2013","ISSN": "1945-7871","ISBN":"none"},{"authors":["Botao Wang","Hongkai Xiong","Zhiquan Ren","Chang Wen Chen"],"article name":"Deformable Shape Preserving Video Retargeting With Salient Curve Matching","Journal Name":"Emerging and Selected Topics in Circuits and Systems IEEE Journal on","vol.": "4","pp.": "82-94","Year": "2014","ISSN": "2156-3357","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Weimin Tan","Bo Yan"],"article name":"A survey on high coherence visual media retargeting: recent advances and applications","Journal Name":"Frontiers of Computer Science","vol":"none","pp.":"none","Year": "2016","ISSN": "2095-2228","ISBN":"none"},{"authors":["Hai Thanh Nguyen"],"article name":"Stereo Video Retargeting with Representative Seams in a Group of Stereoscopic Frames","Journal Name":"ETRI Journal","vol.": "35","pp.": "980","Year": "2013","ISSN": "1225-6463","ISBN":"none"},{"authors":["Tongbao Wu","Zhi Liu","Xiaofei Zhou","Kai Li"],"article name":"Spatiotemporal salient object detection by integrating with objectness","Journal Name":"Multimedia Tools and Applications","vol":"none","pp.":"none","Year": "2017","ISSN": "1380-7501","ISBN":"none"}]}]}