{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 1, "citationCountPatent": 0, "totalDownloads": 738},"doi": "10.1109/TCSVT.2011.2157194","title": "A Single-Pass-Based Localized Adaptive Interpolation Filter for Video Coding","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "Recently, an efficient coding tool named adaptive interpolation filtering (AIF) has been proposed to hybrid video coding scheme. By introducing Wiener filter into the fractional-pixel interpolation procedure, AIF can reduce the inter-prediction error and improve coding efficiency significantly. However, the training-based Wiener filter mechanism brings AIF an inherent multi-pass encoding structure, which imposes big burdens on the encoder in terms of huge computational complexity and memory access. In this paper, we propose a single-pass-based localized adaptive interpolation filtering (SPL-AIF) algorithm for video coding, which can reduce the complexity of AIF dramatically without sacrifice of its outstanding coding performance. The proposed SPL-AIF algorithm is based on the observation that there is a high correlation among optimal interpolation filters of consecutive frames, and different regions in a frame often possess different statistical characteristics. Accordingly, the proposed algorithm can be designed including two major parts. First, a competitive filter set which includes the optimal interpolation filters of several previous frames as well as the fixed H.264/AVC interpolation filters is built up for the coding of the current frame. Then a rate-distortion optimization criterion is used to select the best one at macroblock (MB) level. In order to reduce overhead, a predictive coding method is used to compress the filter signaling flag for each MB. Experimental results show that, by using the proposed algorithm, the encoding complexity can be reduced significantly while the average coding gain in Bjo&#x0308;ntegaard distortion bit-rate reduction can be improved about 1% compared with the multi-pass AIF. The proposed method has been adopted into the Video Coding Expert Group Key Technology Area software.","authors": [{"name": "Kai Zhang", "affiliation": "Tencent (Beijing), Inc., Beijing, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6121964/5771544/5771544-photo-1-small.gif", "p": ["Kai Zhang was born in Dalian, Liaoning Province, China, in 1981. He received the B.S. degree in computer science and technology from Nankai University, Tianjin, China, in 2004, and the Ph.D. degree in computer science from the Institute of Computing Technology, Chinese Academy of Sciences, Beijing, China, in 2011.", "From July 2008 to December 2010, he was a Research Intern with Mediatek, Inc., Beijing. He is currently a Researcher with Tencent Research, Tencent, Inc., Beijing. His current research interests include video/image coding, processing, and communication."]}}, {"name": "Xun Guo", "affiliation": "MediaTek (Beijing), Inc., Beijing, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6121964/5771544/5771544-photo-2-small.gif", "p": ["Xun Guo (M'10) received the B.S., M.S., and Ph.D. degrees from the Harbin Institute of Technology, Harbin, China, in 1999, 2001, and 2007, respectively, all in computer science.", "Since July 2007, he has been with MediaTek, Inc., Beijing, China, where he is currently the Manager with the Department of Video Coding and Processing, Multimedia Technology Development Division, working in video/image coding and processing areas. Now his team is researching on video coding techniques for the next-generation video coding standard, high efficiency video coding. His current research interests include video coding and processing, image quality enhancement, and computer vision."]}}, {"name": "Jicheng An", "affiliation": "MediaTek (Beijing), Inc., Beijing, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6121964/5771544/5771544-photo-3-small.gif", "p": ["Jicheng An was born in Henan, China, in 1983. He received the B.S. degree in automation in 2006 and the M.S. degree in control science and engineering in 2009, both from Central South University, Changsha, China.", "Since June 2009, he has been with MediaTek, Inc., Beijing, China, where he is currently a Senior Engineer with the Department of Video Coding and Processing, Multimedia Technology Development Division. He is currently researching on video coding techniques for the next-generation video coding standard, high efficiency video coding. His current research interests include video/image coding and video/image processing."]}}, {"name": "Yu-Wen Huang", "affiliation": "MediaTek, Inc., Hsinchu, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6121964/5771544/5771544-photo-4-small.gif", "p": ["Yu-Wen Huang was born in Kaohsiung, Taiwan, in 1978. He received the B.S. degree from the Department of Electrical Engineering, National Taiwan University (NTU), in 2000, and the Ph.D. degree from the Graduate Institute of Electronics Engineering, NTU, in 2004.", "Since December 2004, he has been with MediaTek, Inc., Hsinchu, Taiwan, and is currently the Senior Manager with the Department of Video Coding and Processing, Multimedia Technology Development Division, Corporate Technology Office. His team is responsible for researching video coding techniques for the next-generation video coding standard, high efficiency video coding, and helping product teams to develop software and hardware video encoders and decoders as consultant. He is an active participant in the Joint Collaborative Team on Video Coding meetings held by ISO/IEC MPEG and ITU-T VCEG. His current research interests include video coding, video processing, and associated very large-scale integration architectures."]}}, {"name": "Shawmin Lei", "affiliation": "MediaTek, Inc., Hsinchu, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6121964/5771544/5771544-photo-5-small.gif", "p": ["Shaw-Min Lei (S'87–M'88–SM'95–F'06) received the B.S. and M.S. degrees from the National Taiwan University, Taipei, Taiwan, in 1980 and 1982, respectively, and the Ph.D. degree from the University of California at Los Angeles, Los Angeles, in 1988, all in electrical engineering.", "From August 1988 to October 1995, he was with Bellcore (Bell Communications Research), Red Bank, NJ, where he had worked mostly in the video compression and communication areas and for a short period in wireless communication. From October 1995 to March 2007, he was with Sharp Laboratories of America, Camas, WA, where he was a Manager of the Video Coding and Communication Group. Since March 2007, he has been with MediaTek, Inc., Hsinchu, Taiwan, as a Director in Multimedia Technology Division, working in the video/image coding and processing areas. He has published more than 60 peer-reviewed technical papers and more than 80 contributions to MPEG4, JPEG2000, H.263+, H.264, and High Efficiency Video Coding international standard meetings. He has been awarded more than 40 patents. His current research interests include video/image compression, processing and communication, picture quality enhancement, multimedia communication, and data compression."]}}, {"name": "Wen Gao", "affiliation": "Institute of Digital Media, Peking University, Beijing, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6121964/5771544/5771544-photo-6-small.gif", "p": ["Wen Gao (M'92–SM'05–F'09) received the Ph.D. degree in electronics engineering from the University of Tokyo, Tokyo, Japan, in 1991.", "He is currently a Professor of computer science with Peking University, Beijing, China. Before joining Peking University, he was a Professor of computer science with the Harbin Institute of Technology, Harbin, China, from 1991 to 1995, and a Professor with the Institute of Computing Technology, Chinese Academy of Sciences, Beijing, China. He has published extensively including five books and over 600 technical articles in refereed journals and conference proceedings in the areas of image processing, video coding and communication, pattern recognition, multimedia information retrieval, multimodal interface, and bioinformatics.", "Dr. Gao served or serves on the editorial board for several journals, such as the IEEE Transactions on Circuits and Systems for Video Technology, the IEEE Transactions on Multimedia, the IEEE Transactions on Autonomous Mental Development, the EURASIP Journal of Image Communications, and the Journal of Visual Communication and Image Representation. He chaired a number of prestigious international conferences on multimedia and video signal processing, such as IEEE ICME and ACM Multimedia, and also served on the advisory and technical committees of numerous professional organizations."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Encoding", "Wiener filter", "Interpolation", "Video coding", "Filtering algorithms", "Filtering theory"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["Wiener filters", "encoding", "interpolation", "statistical analysis", "video coding"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["Bjontegaard distortion bit-rate reduction", "single-pass-based localized adaptive interpolation filtering", "video coding", "fractional-pixel interpolation", "interprediction error", "training-based Wiener filter", "multipass encoding structure", "SPL-AIF algorithm", "statistical characteristic", "H.264/AVC interpolation filter", "rate-distortion optimization", "macroblock level", "predictive coding method"]}, {"type": "Author Keywords ", "kwd": ["Wiener filter", "Adaptive interpolation filter", "H264/AVC", "localized filtering", "motion-compensated prediction", "single-pass"]}],"citations":[{"ieee-citations":[{"authors":["Eugen Wige","Gilbert Yammine","Peter Amon","Andreas Hutter"," Kaup"],"article name":"In-Loop Noise-Filtered Prediction for High Efficiency Video Coding","Journal Name":"Circuits and Systems for Video Technology IEEE Transactions on","vol.": "24","pp.": "1142-1155","Year": "2014","ISSN": "1051-8215","ISBN":"none"}]},{"nonieee-citations":[]}]}