{"issn": [{"format": "Print ISSN", "value": "0095-9804"}],"metrics": {"citationCountPaper": 1, "citationCountPatent": 0, "totalDownloads": 46},"doi": "10.1109/JAIEE.1930.6534873","title": "Controlling power flow with phase-shifting equipment","publicationTitle": "Journal of the A.I.E.E.","abstract": "In the operation of an electric power distributing system involving various hinds of networks, a fundamental necessity is that each transforming and transmitting unit carry a reasonable share of the total load. In the case of a single system that has been developed in a coordinated manner the problem of load division has not in general been troublesome and has been solved by judicious selection of parallel circuits, use of reactors, proper system set-up, etc. The advent of inter-company connections has brought together systems of varying characteristics, changed the relation between the basic elements involved, and in some cases has made difficult the control of power flow over tie lines small in comparison to the systems which they unite. It is the purpose of this paper to discuss the case of load control where closed rings or parallel path circuits are involved. After briefly reviewing the principles of voltage phase angle and power flow, a description is given of some actual tests performed on a very large interconnected system with a 250-mi. transmission loop, involving five power companies and a total generator capacity well over 1,000,000 kw. The results of these measurements are analyzed for the purpose of checking theoretical against actual values and forming a basis for the solution of problems of a similar nature.","authors": [{"name": "W. J. Lyman", "affiliation": "Electrical Planning Engineer, Duquesne Light Company, Pittsburgh, Pa."}],"citations":[{"ieee-citations":[{"authors":["K. Udaya Kishore","K. N. Shubhanga"],"article name":"Modeling of FACTS Controllers in power flow programmes to analyze prevention of loop flows","Journal Name":"India Conference (INDICON) 2015 Annual IEEE","vol":"none","pp.": "1-6","Year": "2015","ISSN": "2325-9418","ISBN":"none"}]},{"nonieee-citations":[]}]}