{"issn": [{"format": "Print ISSN", "value": "0095-9804"}],"metrics": {"citationCountPaper": 2, "citationCountPatent": 0, "totalDownloads": 109},"doi": "10.1109/JAIEE.1930.6534884","title": "Abridgment of stability of synchronous machines: Effect of armature circuit resistance","publicationTitle": "Journal of the A.I.E.E.","abstract": "The theory of synchronous machines as developed by Doherty and Nickle<sup>1</sup> has been extended to include a determination of the effect of armature circuit resistance on damping torque. Equations are developed for the damping torque of synchronous machines in general, i. e., both the salient-pole and round rotor types. These equations assume an exciting winding in the direct axis and an amortisseur winding in the quadrature axis, and further assume that all damping is due to currents induced in these two windings. The effect of an amortisseur winding in the direct axis is not considered because its damping action at the low frequency of hunting is small compared to that of the exciting winding. It is shown that the damping torque of any synchronous machine can become negative, giving instability, if the armature resistance is increased beyond a critical limiting value. This fact has been known,<sup>2</sup> but an actual determinination of the value of the critical resistance in terms of constants of the machine has not, to the authors' knowledge, been available. For a salient-pole generator with normal excitation and no amortisseur winding this value, is <tex>$r = x_{q} \\tan \\delta' $</tex> where r is armature circuit resistance,<sup>&#x2020;</sup> x<inf>q</inf> is quadrature synchronous reactance, and &#x03B4;&#x2032; is the steady-state displacement angle. If r is less than the critical limiting value, the damping torque is positive; if greater, negative. The damping of a generator increases in the positive direction with increase in load. Thus a salient-pole generator with amortisseur winding, if stable at no load, will be stable under any steady load within its steady-state power limit. With &#x03B4;&#x2032; &#x003D; 0, and normal excitation, the critical limiting value of armature resistance for a machine with an armotisseur winding is <tex>$r = \\sqrt {b \\, d + {d \\over b}} (x_{d} - a)^{2}$</tex> where x<inf>d</inf> is the direct synchronous reactance and a, b, d are constants depending upon the design of the machine. This formula is useful for determining the constants of an amortisseur winding which would prevent sustained or cumulative oscillations of a generator. The analysis also shows that a round-rotor generator with identical field windings in the direct and quadrature axes may be made unstable by too much resistance in the armature circuits. This fact had been previously established by Dreyfus.<sup>2</sup> The relations for inherent stability in synchronous motors are not so simple as for generators, but definite relations involving armature resistance will be found in the article. The mathematical analysis is checked with laboratory experiments.","authors": [{"name": "C. A. Nickle", "affiliation": "Engineering General Dept. of the General Electric Company, Schenectady, N. Y."}, {"name": "C. A. Pierce", "affiliation": "Engineering General Dept. of the General Electric Company, Schenectady, N. Y."}],"citations":[{"ieee-citations":[{"authors":["none"],"article name":"Electrical Machinery","Journal Name":"American Institute of Electrical Engineers Transactions of the","vol.": "50","pp.": "1499-1512","Year": "1931","ISSN": "0096-3860","ISBN":"none"},{"authors":["Manish Jha","S. Chakrabarti","E. Kyriakides"],"article name":"Estimation of the rotor angle of a synchronous generator by using PMU measurements","Journal Name":"PowerTech 2015 IEEE Eindhoven","vol":"none","pp.": "1-6","Year": "2015","ISSN":"none","ISBN":"none"}]},{"nonieee-citations":[]}]}