{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 4, "citationCountPatent": 0, "totalDownloads": 548},"doi": "10.1109/TCSVT.2012.2189671","title": "Adaptive Frequency Weighting for High-Performance Video Coding","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "The benefits of utilizing the spatial-frequency sensitivity of the human visual system in video coding have been known for decades and are incorporated into video standards, such as MPEG2, MPEG4, and H.264/AVC, as well as into still image-coding standards, such as JPEG and JPEG-2000. However, all of these standards utilize frequency weighting that is adaptive only at the picture level. In contrast with such picture-level adaptive frequency-weighting algorithms, we describe a coding approach in which a macroblock-level adaptive frequency-weighting (MBAFW) algorithm is used. We show that for the bitrate, quality levels, and resolutions typically associated with high-definition video, MBAFW can lead to overall bitrate reductions typically in the 5%-9% range over the methods used in state-of-the-art video-coding standards.","authors": [{"name": "Jianwen Chen", "affiliation": "Department of Electrical Engineering, University of California at Los Angeles, Los Angeles, CA, USA", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6162973/6162973-photo-1-small.gif", "p": ["Jianwen Chen received the Ph.D. degree in electrical engineering from Tsinghua University, Beijing, China, in 2007.", "From 2007 to 2010, he was a Staff Researcher with IBM Research, Beijing, where he conducted research on wireless communications systems and multicore video-coding architectures. Since September 2010, he has been with the Image Communications Laboratory, University of California at Los Angeles, Los Angeles, where he is currently responsible for video signal processing/enhancement, high-efficiency video coding, and high-performance computing architecture and application. His current research interests include signal processing for video and communication systems, and, in particular, video-coding algorithm design, video quality assessment, 3-D video coding, low-complexity video codec optimization, and wireless communication protocols and systems."]}}, {"name": "Jianhua Zheng", "affiliation": "Hisilicon Technologies Company, Ltd., Shenzhen, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6162973/6162973-photo-2-small.gif", "p": ["Jianhua Zheng received the B.S. degree in communication engineering from Northwestern Polytechnical University (NWPU), Fremont, CA, in 1997, and the M.S. and Ph.D. degrees in signal and information processing from NWPU in 2001 and 2005, respectively.", "He is currently with Hisilicon Technologies Company, Ltd., Shenzhen, China. His current research interests include video signal compression and coding, networked media systems, and multiview video coding."]}}, {"name": "Feng Xu", "affiliation": "Department of Electronic Engineering, Tsinghua University, Beijing, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6162973/6162973-photo-3-small.gif", "p": ["Feng Xu received the Ph.D. degree in electrical engineering from Tsinghua University, Beijing, China, in 2007.", "From 2007 to 2008, she was a Post-Doctoral Researcher with the University of Pennsylvania, Philadelphia, PA, where she was involved in medical image and data analysis. From 2009 to 2010, she was a Staff Researcher with Thomson Research, Beijing, where she was involved in novel machine-learning algorithms and visually perceptible models on video-quality-assessment systems. Her current research interests include video coding, video processing and enhancement, and machine learning and pattern recognition."]}}, {"name": "John Villasenor", "affiliation": "Department of Electrical Engineering, University of California at Los Angeles, Los Angeles, CA, USA", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6162973/6162973-photo-4-small.gif", "p": ["John Villasenor is currently a Professor of electrical engineering with the University of California at Los Angeles, Los Angeles, and a Nonresident Senior Fellow in Governance Studies and the Center for Technology Innovation, Brookings Institution, Washington D.C. His current research interests include technology and policy challenges associated with how information is acquired, processed, and delivered in an efficient and secure manner."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Quantization", "Image edge detection", "Video coding", "Visualization", "Standards", "Inductors", "Sensitivity"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video coding", "adaptive signal processing"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["high definition video", "high performance video coding", "spatial-frequency sensitivity", "human visual system", "macroblock level adaptive frequency weighting algorithm", "quality level"]}, {"type": "Author Keywords ", "kwd": ["quantization matrix", "Frequency weighting", "human visual system (HVS)", "perceptual coding"]}],"citations":[{"ieee-citations":[{"authors":["Miaohui Wang","King Ngi Ngan","Hongliang Li","Huanqiang Zeng"],"article name":"Improved block level adaptive quantization for high efficiency video coding","Journal Name":"Circuits and Systems (ISCAS) 2015 IEEE International Symposium on","vol":"none","pp.": "509-512","Year": "2015","ISSN":"none","ISBN":"none"},{"authors":["Xiaozhen Zheng","Jianhua Zheng","Yaocheng Rong","Quanhe Yu","Da An","Xin Tong","Yun He"],"article name":"Overview and performance analysis of AVS mobility features","Journal Name":"Image Processing (ICIP) 2013 20th IEEE International Conference on","vol":"none","pp.": "1510-1514","Year": "2013","ISSN":"none","ISBN":"none"},{"authors":["Jianhua Zheng","Xiaozhen Zheng","Yun He","Yongbing Lin","Jianwen Chen","Wei Yu","Ping Yang"],"article name":"Overview of AVS broadcasting standard for high definition video","Journal Name":"Signal and Information Processing (ChinaSIP) 2013 IEEE China Summit & International Conference on","vol":"none","pp.": "250-254","Year": "2013","ISSN":"none","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Lei Zhang","Qiang Peng","Xiao Wu"],"article name":"Perception-based adaptive quantization for transform-domain Wyner-Ziv video coding","Journal Name":"Multimedia Tools and Applications","vol":"none","pp.":"none","Year": "2016","ISSN": "1380-7501","ISBN":"none"}]}]}