{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 5, "citationCountPatent": 0, "totalDownloads": 1037},"doi": "10.1109/TCSVT.2011.2171209","title": "A Reconfigurable Heterogeneous Multimedia Processor for IC-Stacking on Si-Interposer","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "This paper presents a heterogeneous multimedia processor for embedded media applications such as image processing, vision, 3-D graphics and augmented reality (AR), assuming integrated circuit (IC)-stacking on Si-interposer. This processor embeds reconfigurable output drivers for external memory interface to increase memory bandwidth even in a mobile environment. The implemented output driver reconfigures its driving strength according to channel loss between the implemented processor and the memory, so it enables highspeed data communication while achieving 8&#x00D7; higher memory bandwidth compared to previous embedded media processors. The implemented processor includes three main programmable intellectual properties, mode-configurable vector processing units (MCVPUs), a unified filtering unit (UFU), and a unified shader. MCVPUs have 32 integer (16 bit) cores in order to support dual-mode operations between image-level processing and graphics processing. This mode-configuration enables a frame-level pipelining in AR application, so the proposed processor achieves 1.7&#x00D7; higher frame rate compared to the sequential AR processing. UFU supports 16 types of filtering operations only with a single instruction. Most image-level processing consists of various types of filtering operations, so UFU can improve media processing performance and energy-efficiency. UFU also supports texture filtering which is performance bottleneck of common graphics pipeline. A memory-access-efficient (off-chip memory) texturing algorithm named as an adaptive block selection is proposed to enhance texturing performance in 3-D graphics pipeline. UFU has two-level on-chip memory hierarchies, a 512B level-0 (L0) data buffer, and an 8kB level-1 (L1) static random-access memory (SRAM) cache. The small-sized L0 data buffer limits direct references to the large-sized L1 SRAM cache to reduce energy consumed in on-chip memories. Unified shader consists of four homogeneous scalar processing elements (SPEs) for geometry operations in 3-D graphics. Each SPE has single-precision floating-point data-paths, since precision of geometry operations in 3-D graphics is important in today's handheld devices (high resolution). The proposed media processor is fabricated in 0.13 &#x03BC;m CMOS technology with 4 mm &#x00D7; 4 mm chip size, and dissipates 275 mW for full AR operation.","authors": [{"name": "Hyo-Eun Kim", "affiliation": "Department of Electrical Engineering, Korea Advanced Institute of Science and Technology, Daejeon, Korea", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6051475/6051475-photo-1-small.gif", "p": ["Hyo-Eun Kim (S'09) received the B.S. degree in electrical engineering from the Korea Advanced Institute of Science and Technology (KAIST), Daejeon, Korea, in 2008. He is currently pursuing the Ph.D. degree in electrical engineering from the Department of Electrical Engineering, KAIST.", "Since 2008, he has been involved with the development of embedded multimedia processors. His current research interests include very large-scale integrated implementation of energy-efficient multimedia processors, heterogeneous many-core architectures, and 3-D stacked integrated circuit systems."]}}, {"name": "Jae-Sung Yoon", "affiliation": "SoC Platform Development Team, System LSI, Samsung Electronics Company, Ltd., Gyeonggi-do, Korea", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6051475/6051475-photo-2-small.gif", "p": ["Jae-Sung Yoon (S'06) received the B.S. degree in electronics engineering in 2005 and the Ph.D. degree from KAIST in 2011, both from the Korea Advanced Institute of Science and Technology (KAIST), Daejeon, Korea.", "He is currently involved with the multimedia hardware design at Samsung Electronics Corporation, Seoul, Korea. His current research interests include video codecs, 3-D graphics processors, and low-power mobile multimedia processors."]}}, {"name": "Kyu-Dong Hwang", "affiliation": "Department of Electrical Engineering, Korea Advanced Institute of Science and Technology, Daejeon, Korea", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6051475/6051475-photo-3-small.gif", "p": ["Kyu-Dong Hwang (S'08) received the B.S. degree in electrical and computer engineering from Hanyang University, Seoul, Korea, in 2006, and the M.S. degree in electrical engineering from the Korea Advanced Institute of Science and Technology (KAIST), Daejeon, Korea, in 2009. He is currently pursuing the Ph.D. degree in electrical engineering from the Department of Electrical Engineering, KAIST.", "Currently, he is involved with the design of high-speed and low-power interface circuits. His current research interests include crosstalk, intersymbol interference, micro strip lines, and through-silicon via interface."]}}, {"name": "Young-Jun Kim", "affiliation": "Department of Electrical Engineering, Korea Advanced Institute of Science and Technology, Daejeon, Korea", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6051475/6051475-photo-4-small.gif", "p": ["Young-Jun Kim (S'08) received the B.S. degree in electronics and the M.S. degree in electrical and electronics engineering from Yonsei University, Seoul, Korea, in 1998 and 2000, respectively. He is currently pursuing the Ph.D. degree in electrical engineering from the Korea Advanced Institute of Science and Technology (KAIST), Daejeon, Korea.", "In 2000, he joined Samsung Electronics Corporation, Seoul, Korea, where he was involved in the development of 3-D graphics intellectual properties of application processor products. His current research interests include 3-D graphics and multimedia processor design."]}}, {"name": "Jun-Seok Park", "affiliation": "Department of Electrical Engineering, Korea Advanced Institute of Science and Technology, Daejeon, Korea", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6051475/6051475-photo-5-small.gif", "p": ["Jun-Seok Park (S'10) received the B.S. and M.S. degrees in electrical engineering from the Korea Advanced Institute of Science and Technology (KAIST), Daejeon, Korea, in 2009 and 2011, respectively, where he is currently pursuing the Ph.D. degree.", "Currently, he is involved with the development of parallel processors for computer vision. His current research interests include parallel architecture, dedicated low-power vision system, and very large-scale integrated architecture for intelligent vision processing."]}}, {"name": "Lee-Sup Kim", "affiliation": "Department of Electrical Engineering, Korea Advanced Institute of Science and Technology, Daejeon, Korea", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6051475/6051475-photo-6-small.gif", "p": ["Lee-Sup Kim (M'89–SM'05) received the B.S. degree in electronics engineering from Seoul National University, Seoul, Korea, in 1982, and the M.S. and Ph.D. degrees in electrical engineering from Stanford University, Stanford, CA, in 1986 and 1990, respectively.", "He was a Post-Doctoral Research Fellow with Toshiba Corporation, Kawasaki, Japan, from 1990 to 1993, where he was involved with the design of the high-performance digital signal processor and single-chip MPEG2 decoder. Since March 1993, he has been with the Korea Advanced Institute of Science and Technology (KAIST), Daejeon, Korea, where he became a Professor in September 2002. He is currently with the MVLSI Laboratory, Department of Electrical Engineering, KAIST. In 1998, he was on sabbatical leave with Chromatic Research and SandCraft, Inc., Sunnyvale, CA. His current research interests include 3-D graphics processing unit design and high-speed/low-power mixed-mode integrated circuit design."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Graphics", "Three dimensional displays", "Media", "Filtering", "Hardware", "Pipelines", "Prototypes"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["SRAM chips", "cache storage", "CMOS integrated circuits", "computer graphics", "data communication", "device drivers", "embedded systems", "graphics processing units", "image processing", "integrated circuits", "mobile computing", "multimedia computing", "multiprocessing systems", "pipeline processing", "reconfigurable architectures"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["CMOS technology", "reconfigurable heterogeneous multimedia processor", "IC-stacking", "Si-interposer", "embedded media applications", "integrated circuit-stacking", "reconfigurable output drivers", "external memory interface", "memory bandwidth", "mobile environment", "output driver reconfigures", "channel loss", "highspeed data communication", "embedded media processors", "main programmable intellectual properties", "mode-configurable vector processing units", "MCVPU", "unified filtering unit", "UFU", "unified shader", "dual-mode operations", "image-level processing", "graphics processing", "frame-level pipelining", "AR application", "media processing performance", "energy-efficiency", "texture filtering", "memory-access-efficient texturing algorithm", "off-chip memory texturing algorithm", "adaptive block selection", "3D graphics pipeline", "two-level on-chip memory hierarchies", "data buffer", "static random-access memory", "SRAM cache", "on-chip memories", "scalar processing elements", "floating-point data-paths", "handheld devices", "high resolution"]}, {"type": "Author Keywords ", "kwd": ["Si-interposer", "3-D stacked IC", "augmented reality (AR)", "multimedia processor"]}],"citations":[{"ieee-citations":[{"authors":["Yu-Jung Chen","Chao-Hsien Hsu","Chung-Yao Hung","Chia-Ming Chang","Shan-Yi Chuang","Liang-Gee Chen","Shao-Yi Chien"],"article name":"A 130.3 mW 16-Core Mobile GPU With Power-Aware Pixel Approximation Techniques","Journal Name":"Solid-State Circuits IEEE Journal of","vol.": "50","pp.": "2212-2223","Year": "2015","ISSN": "0018-9200","ISBN":"none"},{"authors":["Hyo-Eun Kim","Jun-Seok Park","Jae-Sung Yoon","Seok-Hoon Kim","Lee-Sup Kim"],"article name":"A 1 mJ/Frame Unified Media Application Processor With Dynamic Analog-Digital Mode Reconfiguration for Embedded 3D-Media Contents Processing","Journal Name":"Solid-State Circuits IEEE Journal of","vol.": "48","pp.": "1970-1985","Year": "2013","ISSN": "0018-9200","ISBN":"none"},{"authors":["Peng Ouyang","Shouyi Yin","Leibo Liu","Shaojun Wei"],"article name":"Energy Management on Battery-Powered Coarse-Grained Reconfigurable Platforms","Journal Name":"Very Large Scale Integration (VLSI) Systems IEEE Transactions on","vol.": "23","pp.": "3085-3098","Year": "2015","ISSN": "1063-8210","ISBN":"none"}]},{"nonieee-citations":[]}]}