{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 0, "citationCountPatent": 0, "totalDownloads": 276},"doi": "10.1109/TCSVT.2012.2189795","title": "Visual Workflow Recognition Using a Variational Bayesian Treatment of Multistream Fused Hidden Markov Models","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "In this paper, we provide a variational Bayesian (VB) treatment of multistream fused hidden Markov models (MFHMMs), and apply it in the context of active learning-based visual workflow recognition (WR). Contrary to training methods yielding point estimates, such as maximum likelihood or maximum a posteriori training, the VB approach provides an estimate of the posterior distribution over the MFHMM parameters. As a result, our approach provides an elegant solution toward the amelioration of the overfitting issues of point estimate-based methods. Additionally, it provides a measure of confidence in the accuracy of the learned model, thus allowing for the easy and cost-effective utilization of active learning in the context of MFHMMs. Two alternative active learning algorithms are considered in this paper: query by committee, which selects unlabeled data that minimize the classification variance, and a maximum information gain method that aims to maximize the alteration in model variance by proper data labeling. We demonstrate the efficacy of the proposed treatment of MFHMMs by examining two challenging WR scenarios, and show that the application of active learning, which is facilitated by our VB approach, allows for a significant reduction of the MFHMM training costs.","authors": [{"name": "Sotirios P. Chatzis", "affiliation": "Department of Electrical and Electronic Engineering, Imperial College London, London, U.K.", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6164251/6164251-photo-1-small.gif", "p": ["Sotirios P. Chatzis received the M.Sc. (five-year Diploma) degree in electrical and computer engineering from the National Technical University of Athens, Athens, Greece, in 2005, and the Ph.D. degree in machine learning from the National Technical University of Athens in 2008.", "From January 2009 to June 2010, he was a Post-Doctoral Researcher with the University of Miami, Coral Gables, FL. He is currently a Post-Doctoral Researcher with the Department of Electrical and Electronic Engineering, Imperial College London, London, U.K. His current research interests include machine learning theory and methodologies with a special focus on hierarchical Bayesian models, reservoir computing, robot learning by demonstration, copulas, quantum statistics, Bayesian nonparametrics, and artificial creativity.", "Dr. Chatzis first authored 28 journal papers in the most prestigious journals of his research field by the age of 28 years. His Ph.D. research was supported by the Bodossaki Foundation, Greece, and the Greek Ministry for Economic Development, while he received the Dean's Scholarship for Ph.D. Studies, being the Best Performing Ph.D. Student of his class."]}}, {"name": "Dimitrios Kosmopoulos", "affiliation": "University of Texas, Arlington, TX, USA", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6164251/6164251-photo-2-small.gif", "p": ["Dimitrios Kosmopoulos received the Ph.D. degree in electrical and computer engineering from the National Technical University of Athens, Athens, Greece, in 2001.", "Since then, he has collaborated with the National Center for Scientific Research “Demokritos,” Athens, the National Technical University of Athens, the University of Central Greece, Lamia, Greece, and the Technical Educational Institute of Athens, Athens. He is currently a Visiting Assistant Professor with the University of Texas, Arlington. His current research interests include computer vision, robotics, and machine learning. He has published more than 50 papers in these fields and has participated in several industrial and scientific projects as a developer, consultant, or technical coordinator."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Hidden Markov models", "Bayesian methods", "Data models", "Computational modeling", "Training", "Couplings", "Sensors"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video surveillance", "Bayes methods", "hidden Markov models", "image sequences", "learning (artificial intelligence)", "video streaming"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["data labeling", "variational Bayesian treatment", "multistream fused hidden Markov models", "active learning-based visual workflow recognition", "training methods", "maximum likelihood training", "maximum a posteriori training", "posterior distribution", "MFHMM parameters", "overfitting issues", "point estimate-based methods", "learned model", "unlabeled data", "classification variance", "maximum information gain method", "model variance"]}, {"type": "Author Keywords ", "kwd": ["workflow recognition", "Active learning", "hidden Markov models", "multistream fusion"]}],"citations":[null]}