{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 8, "citationCountPatent": 0, "totalDownloads": 812},"doi": "10.1109/TCSVT.2012.2190474","title": "3-D Head Tracking via Invariant Keypoint Learning","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "Keypoint matching is a standard tool to solve the correspondence problem in vision applications. However, in 3-D face tracking, this approach is often deficient because the human face complexities, together with its rich viewpoint, nonrigid expression, and lighting variations in typical applications, can cause many variations impossible to handle by existing keypoint detectors and descriptors. In this paper, we propose a new approach to tailor keypoint matching to track the 3-D pose of the user head in a video stream. The core idea is to learn keypoints that are explicitly invariant to these challenging transformations. First, we select keypoints that are stable under randomly drawn small viewpoints, nonrigid deformations, and illumination changes. Then, we treat keypoint descriptor learning at different large angles as an incremental scheme to learn discriminative descriptors. At matching time, to reduce the ratio of outlier correspondences, we use second-order color information to prune keypoints unlikely to lie on the face. Moreover, we integrate optical flow correspondences in an adaptive way to remove motion jitter efficiently. Extensive experiments show that the proposed approach can lead to fast, robust, and accurate 3-D head tracking results even under very challenging scenarios.","authors": [{"name": "Haibo Wang", "affiliation": "Shandong University, Jinan, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6255841/6166872/6166872-photo-1-small.gif", "p": ["Haibo Wang received the joint Ph.D. degree from the University of Sciences and Technology, Lille, France, in 2010, and the Ph.D. degree from the Institute of Automation, Chinese Academy of Sciences, Beijing, China, in 2011.", "Since January 2012, he has been an Assistant Professor with Shandong University, Jinan, China. His current research interests include 3-D head pose tracking, 3-D modeling, object detection, and 3-D reconstruction."]}}, {"name": "Franck Davoine", "affiliation": "LIAMA MPR Project-Team, Centre National de la Recherche Scientifique, Peking University, Beijing, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6255841/6166872/6166872-photo-2-small.gif", "p": ["Franck Davoine received the Ph.D. degree from the Grenoble Institute of Technology, Grenoble, France, in 1995.", "After working 18 months as a Post-Doctoral Researcher with the University of Linkoping, Linkoping, Sweden, he joined the Compiegne University of Technology, Compiegne, France, in 1997 as an Associate Professor with the HEUDIASYC Joint Research Unit and in 2002 as a Permanent Researcher with the Centre National de la Recherche Scientifique (CNRS). He has been involved in European and French projects on image coding and watermarking, and on facial feature analysis for visual communications and human–machine interaction. Since 2008, he has been on leave from the LIAMA Sino-French Laboratory, Beijing, China, and since 2011, he has been a Principal Investigator with the LIAMA MPR Project-Team, CNRS, Peking University, Beijing, on multisensor-based perception and reasoning for intelligent vehicles. His current research interests include computer vision for visual object tracking and recognition with applications to human faces and gestures, and to outdoor scene analysis."]}}, {"name": "Vincent Lepetit", "affiliation": "Ecole Polytechnique F&#x00E9;d&#x00E9;rale de Lausanne, Lausanne, Switzerland", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6255841/6166872/6166872-photo-3-small.gif", "p": ["Vincent Lepetit received the Engineering and M.S. degrees in computer science from the cole Suprieure d'Informatique et Applications de Lorraine, Nancy, France, in 1996, and the Ph.D. degree in computer vision from the University of Nancy, Nancy, in 2001.", "He was with the ISA INRIA Team, Nancy. He joined the Virtual Reality Laboratory, Ecole Polytechnique Fédérale de Lausanne (EPFL), Lausanne, Switzerland, as a Post-Doctoral Fellow, and became a Founding Member of the Computer Vision Laboratory. He is currently a Senior Researcher with the Computer Vision Laboratory, EPFL. His current research interests include vision-based augmented reality, 3-D camera tracking, object recognition, and 3-D reconstruction."]}}, {"name": "Christophe Chaillou", "affiliation": "LIFL Laboratory, Lille University of Sciences and Technology, Lille, France", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6255841/6166872/6166872-photo-4-small.gif", "p": ["Christophe Chaillou received the Ph.D. degree in graphic hardware from the Lille University of Sciences and Technology, Lille, France, in 1991.", "He is currently a Professor with the LIFL Laboratory, Lille University of Sciences and Technology. He was an Associate Professor with Telecom Lille, Lille, from 1991 to 1996, and has been a Professor with Polytech-Lille, Lille, since 1996. His current research interests include haptics, tactile devices, interaction in complex virtual environments, and remote cooperative activities."]}}, {"name": "Chunhong Pan", "affiliation": "National Laboratory of Pattern Recognition, Institute of Automation, Chinese Academy of Sciences, Beijing, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6255841/6166872/6166872-photo-5-small.gif", "p": ["Chunhong Pan received the B.S. degree in automation from Tsinghua University, Beijing, China, in 1987, the M.S. degree from the Shanghai Institute of Optics and Fine Mechanics, Chinese Academy of Sciences, Beijing, in 1990, and the Ph.D. degree from the Institute of Automation, Chinese Academy of Sciences (CASIA), in 2000.", "He is currently a Professor with the National Laboratory of Pattern Recognition, CASIA. His current research interests include computer vision, image processing, computer graphics, and remote sensing."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Three dimensional displays", "Face", "Image color analysis", "Lighting", "Optical imaging", "Nonlinear distortion"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video signal processing", "computer vision", "image colour analysis", "image matching", "image motion analysis", "image sequences", "jitter", "learning (artificial intelligence)", "lighting", "object tracking", "pose estimation"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["motion jitter removal", "3D head tracking", "invariant keypoint learning", "keypoint matching", "vision applications", "3D face tracking", "nonrigid expression", "lighting variations", "keypoint detector", "3D pose tracking", "video stream", "nonrigid deformations", "illumination changes", "keypoint descriptor learning", "incremental learning", "discriminative descriptor learning", "matching time", "outlier correspondences ratio reduction", "second-order color information", "optical flow correspondences"]}, {"type": "Author Keywords ", "kwd": ["pose estimation", "3-D head tracking", "keypoint-based tracking"]}],"citations":[{"ieee-citations":[{"authors":["Fakhreddine Ababsa","Ngoc-Trung Tran","Maurice Charbit"],"article name":"Challenging 3D Head Tracking and Evaluation Using Unconstrained Test Data Set","Journal Name":"Information Visualisation (IV) 2017 21st International Conference","vol":"none","pp.": "205-210","Year": "2017","ISSN": "2375-0138","ISBN":"none"},{"authors":[" Adam Herout","n"],"article name":"Usability of Pilot's Gaze in Aeronautic Cockpit for Safer Aircraft","Journal Name":"Intelligent Transportation Systems (ITSC) 2015 IEEE 18th International Conference on","vol":"none","pp.": "1545-1550","Year": "2015","ISSN": "2153-0017","ISBN":"none"},{"authors":["Athi Narayanan","Ramachandra Mathava Kaimal","Kamal Bijlani"],"article name":"Yaw Estimation Using Cylindrical and Ellipsoidal Face Models","Journal Name":"Intelligent Transportation Systems IEEE Transactions on","vol.": "15","pp.": "2308-2320","Year": "2014","ISSN": "1524-9050","ISBN":"none"},{"authors":["Zhenbao Liu","Jinxin Huang","Junwei Han","Shuhui Bu","Jianfeng Lv"],"article name":"Human Motion Tracking by Multiple RGBD Cameras","Journal Name":"Circuits and Systems for Video Technology IEEE Transactions on","vol.": "27","pp.": "2014-2027","Year": "2017","ISSN": "1051-8215","ISBN":"none"},{"authors":["Athi Narayanan","Ramachandra Mathava Kaimal","Kamal Bijlani"],"article name":"Estimation of Driver Head Yaw Angle Using a Generic Geometric Model","Journal Name":"Intelligent Transportation Systems IEEE Transactions on","vol.": "17","pp.": "3446-3460","Year": "2016","ISSN": "1524-9050","ISBN":"none"},{"authors":["Shaoguo Liu","Haibo Wang","Ying Wang","Jixia Zhang","Chunhong Pan"],"article name":"Maximum correntropy criterion based 3D head tracking with commodity depth camera","Journal Name":"Image Processing (ICIP) 2013 20th IEEE International Conference on","vol":"none","pp.": "2782-2786","Year": "2013","ISSN":"none","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Ngoc-Trung Tran","Fakhreddine Ababsa","Maurice Charbit"],"article name":"A robust framework for tracking simultaneously rigid and non-rigid face using synthesized data","Journal Name":"Pattern Recognition Letters","vol":"none","pp.":"none","Year": "2015","ISSN": "01678655","ISBN":"none"},{"authors":["Stefania Cristina","Kenneth P. Camilleri"],"article name":"Model-free non-rigid head pose tracking by joint shape and pose estimation","Journal Name":"Machine Vision and Applications","vol":"none","pp.":"none","Year": "2016","ISSN": "0932-8092","ISBN":"none"}]}]}