{"issn": [{"format": "Print ISSN", "value": "0095-9804"}],"metrics": {"citationCountPaper": 0, "citationCountPatent": 0, "totalDownloads": 6},"doi": "10.1109/JAIEE.1930.6538553","title": "Abridgment of recent developments in toll telephone service","publicationTitle": "Journal of the A.I.E.E.","abstract": "This paper deals principally with the physical and technical phases of the development in recent years of &#x201C;toll&#x201D; telephone service in this country, with particular emphasis on the longer haul or &#x201C;long distance&#x201D; traffic. The very rapid growth in toll telephone business has required a rapid extension of toll plant, including outside plant, buildings, and switchboard and other equipment. The most striking developments in the outside plant are very great growth in toll cable networks and the rapid extension of the carrier telephone systems. The factors involved in the relative use of these various types of plant are discussed. An outline is given of the advance planning and study necessary to insure that these annual programs are properly engineered so that as closely as possible they will effectively anticipate future requirements and extensions in a most suitable and practicable manner. The more important limitations affecting the design of toll plant from the standpoints of the efficiency, quality, speed, and length of telephone transmission, and the specific treatments of each, are generally discussed in the paper. These include such matters as the use of loading coils, vacuum tube repeaters, equalizers for attenuation and phase distortion, and means for reducing the effects of echoes and time lag or delay in the circuits. Mention is also made of modifications of the open wire plant to effect material reductions in crosstalk, and to permit thereby a substantial increase in the use of carrier telephone facilities. The paper discusses the extension of loll service to include connection with the telephone networks in other countries, including Canada, Mexico, Europe, Cuba, and South America.","authors": [{"name": "W. H. Harrison", "affiliation": "American Telephone &#x0026; Telegraph Company, New York, N. Y."}],"citations":[null]}