{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 8, "citationCountPatent": 3, "totalDownloads": 718},"doi": "10.1109/TCSVT.2012.2189791","title": "The MPEG-7 Video Signature Tools for Content Identification","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "This paper presents the core technologies of the video signature tools recently standardized by ISO/IEC Moving Picture Experts Group (MPEG) as an amendment to the MPEG-7 Standard (ISO/IEC 15938). The video signature is a high-performance content fingerprint that is suitable for desktop scale to web-scale deployment and provides high levels of robustness to common video editing operations and high temporal localization accuracy at extremely low false alarm rates, achieving a detection rate in the order of 96% at a false alarm rate in the order of five false matches per million comparisons. The applications of the video signature are numerous and include rights management and monetization, distribution management, usage monitoring, metadata association, and corporate or personal database management. In this paper, we review the prior work in the field, explain the standardization process and status, and provide details and evaluation results for the video signature tools.","authors": [{"name": "Stavros Paschalakis", "affiliation": "Visual Atoms, Ltd., Guildford, Surrey, U.K.", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6164253/6164253-photo-1-small.gif", "p": ["Stavros Paschalakis (M'01) received the B.Eng. degree in computer systems engineering (first class hons.) in 1996 and the Ph.D. degree in electronics engineering in 2002, both from the University of Kent, Kent, U.K.", "He was a Research Associate with the University of Kent from 1997 to 1999. After receiving the Ph.D. degree, he joined the Mitsubishi Electric R&D Centre Europe, Guildford, Surrey, U.K., as a Research Engineer, and later became a Research and Development Manager and a Multimedia Technologies Team Leader. In 2011, he cofounded Visual Atoms, Ltd., Guildford, a U.K.-based independent R&D and technology consulting company. He is the author of over 40 technical papers and patents. His current research interests include image and video processing, video coding, multimedia databases, computer vision, and hardware implementation of vision algorithms.", "Dr. Paschalakis is a Project Editor of the MPEG-7 Video Signature Tools Standard and a Chair of the MPEG-7 Visual Group."]}}, {"name": "Kota Iwamoto", "affiliation": "Information and Media Processing Laboratories, NEC Corporation, Kawasaki, Kanagawa, Japan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6164253/6164253-photo-2-small.gif", "p": ["Kota Iwamoto received the B.E. and M.E. degrees in electronics, information, and communication engineering from Waseda University, Tokyo, Japan, in 2001 and 2003, respectively.", "He joined NEC Corporation, Kawasaki, Kanagawa, Japan, in 2003, and is currently an Assistant Manager with the Information and Media Processing Laboratories. His current research interests include image processing, image/video indexing and retrieval, image classification, and their applications.", "Mr. Iwamoto has been involved in the activities of the ISO/IEC JTC1/SC29/WG11 (MPEG) on the development of MPEG-7 Video Signature Tools Standard as an ISO Project Editor."]}}, {"name": "Paul Brasnett", "affiliation": "Imagination Technologies, Ltd., Kings Langley, Hertfordshire, U.K.", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6164253/6164253-photo-3-small.gif", "p": ["Paul Brasnett received the M.Eng. degree in mathematics for intelligent systems in 2002 and the Ph.D. degree in electrical and electronics engineering in 2006, both from the University of Bristol, Bristol, U.K.", "In 2005, he joined the Mitsubishi Electric R&D Centre Europe, Guildford, Surrey, U.K., first as a Research Engineer and then as a Senior Research Engineer. In 2010, he joined the PowerVR Research Group, Imagination Technologies, Ltd., Kings Langley, Hertfordshire, U.K., as a Senior Research Engineer. He is an author of over 20 peer-reviewed technical papers and patents. His current research interests include image and video processing, image and video coding, computer vision, machine learning, and algorithms for general-purpose graphics processing unit computing.", "Dr. Brasnett was the Co-Chair of the MPEG-7 Visual Group from 2007 to 2010."]}}, {"name": "Nikola Sprljan", "affiliation": "Maxeler, London, U.K.", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6164253/6164253-photo-4-small.gif", "p": ["Nikola Sprljan received the B.Eng. degree in electrical engineering from the Faculty of Electrical Engineering and Computing, University of Zagreb, Zagreb, Croatia, in 2001, and the Ph.D. degree in electronics engineering from the Queen Mary University of London, London, U.K., in 2006.", "He joined the Mitsubishi Electric R&D Centre Europe, Guildford, Surrey, U.K., in 2006 as a Research Engineer. In 2011, he joined Visual Atoms, Ltd., Guildford, as a Senior Research Engineer, and then he joined Maxeler, London, as an Acceleration Architect. His current research interests include image and video representation, media compression, streaming and robust transmission, as well as multimedia databases and retrieval."]}}, {"name": "Ryoma Oami", "affiliation": "Information and Media Processing Laboratories, NEC Corporation, Kawasaki, Kanagawa, Japan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6164253/6164253-photo-5-small.gif", "p": ["Ryoma Oami (M'94) received the B.S. and M.S. degrees from the University of Tokyo, Tokyo, Japan, in 1993 and 1995, respectively.", "He joined NEC Corporation, Kawasaki, Kanagawa, Japan, in 1995, and is currently a Principal Researcher with the Information and Media Processing Laboratories. His current research interests include image and video processing and analysis for understanding visual contents.", "Mr. Oami has been involved in the standardization activities in ISO/IEC JTC1/SC29/WG11 (MPEG) since 2006 and contributed to developing several MPEG-7 and MPEG-A standards as an ISO Project Editor."]}}, {"name": "Toshiyuki Nomura", "affiliation": "Information and Media Processing Laboratories, NEC Corporation, Kawasaki, Kanagawa, Japan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6164253/6164253-photo-6-small.gif", "p": ["Toshiyuki Nomura (M'97) received the B.S. and M.S. degrees from Nagoya University, Nagoya, Japan, in 1990 and 1992, respectively.", "He joined NEC Corporation, Kawasaki, Kanagawa, Japan, in 1992, where he is currently a Research Engineer with the Media and Information Research Laboratories. His current research interests include multimedia signal processing such as coding, analysis, and understanding.", "Mr. Nomura has been involved in the activities of the Audio Subgroup, ISO/IEC JTC1/SC29/WG11 (known as MPEG/Audio) for international standardization of speech and audio coding. He received the 1998 Shinohara Memorial Academic Encouragement Award from IEICE, and the 2005 Ohm Technology Award. He is a Project Editor of ISO/IEC 14496-3:2001 and ISO/IEC 14496-5:2000."]}}, {"name": "Akio Yamada", "affiliation": "Information and Media Processing Laboratories, NEC Corporation, Kawasaki, Kanagawa, Japan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6164253/6164253-photo-7-small.gif", "p": ["Akio Yamada received the Ph.D. degree in information electronics science from Nagoya University, Nagoya, Japan, in 1993.", "He joined NEC Corporation, Kawasaki, Kanagawa, Japan, in 1993, and is currently a Senior Research Manager with the Information and Media Processing Laboratories. His current research interests include visual communication systems, multimedia signal processing such as coding, analysis and understanding, and various media service developments.", "Dr. Yamada has been a participant of the MPEG and JPEG Groups since 1999, where he has been active in the development of MPEG-7, MPEG-A, and JPSearch Standards as an ISO Project Editor. He received the ITE Niwa-Takayanagi Best Paper Award and the IEICE Yong Researcher Award in 1994 and 1996, respectively."]}}, {"name": "Miroslaw Bober", "affiliation": "University of Surrey, Guildford, Surrey, U.K.", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6227366/6164253/6164253-photo-8-small.gif", "p": ["Miroslaw Bober (M'97) received the M.Sc. degree (distinction) in electrical engineering from the AGH University of Science and Technology, Cracow, Poland, in 1990, and another M.Sc. degree (distinction) in signal processing and artificial intelligence in 1991 and the Ph.D. degree in 1995, both from the University of Surrey, Guildford, Surrey, U.K.", "He is currently a Professor of video processing with the University of Surrey. In 2011, he cofounded Visual Atoms, Ltd., Guildford, a U.K.-based independent research and development and technology consulting company. From 1997 to 2011, he was with the Mitsubishi Electric R&D Centre Europe, Guildford (MERCE-U.K.), first as a Chief Scientist and later as a General Manager. Before joining MERCE-U.K., he was with the University of Surrey, first as a Research Scientist and then as a Lecturer and Leader with the Image Communication and Multimedia Systems Group. He is an inventor of over 70 patents and an author of over 80 refereed publications, including three books and book chapters. His current research interests include various aspects of image processing, computer vision, and pattern recognition.", "Dr. Bober has been involved in the development of MPEG-7 for over 10 years, chairing the MPEG-7 Visual Group."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Decoding", "Sorting", "Encoding", "Hardware", "Image coding", "Throughput", "Heuristic algorithms"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video coding", "telecommunication standards"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["personal database management", "moving picture experts group", "MPEG-7 video signature tools", "content identification", "ISO/IEC 15938", "high-performance content fingerprint", "desktop scale deployment", "web-scale deployment", "video editing", "rights management", "monetization", "distribution management", "usage monitoring", "metadata association", "corporate database management"]}, {"type": "Author Keywords ", "kwd": ["video signature", "Content description", "content fingerprint", "content identification", "content localization", "MPEG", "video fingerprint", "video identification"]}],"citations":[{"ieee-citations":[{"authors":["Peerapon Chantharainthron","Sasipa Panthuwadeethorn","Suphakant Phimoltares"],"article name":"Robust video editing detection using Scalable Color and Color Layout Descriptors","Journal Name":"Computer Science and Software Engineering (JCSSE) 2017 14th International Joint Conference on","vol":"none","pp.": "1-6","Year": "2017","ISSN":"none","ISBN":"none"},{"authors":["Markus Schoeler","tter","Mohamad Javad Aein","Tomas Kulvicius"],"article name":"Automated generation of training sets for object recognition in robotic applications","Journal Name":"Robotics in Alpe-Adria-Danube Region (RAAD) 2014 23rd International Conference on","vol":"none","pp.": "1-7","Year": "2014","ISSN":"none","ISBN":"none"},{"authors":["Mariko Tsurusaki","Daiki Kudo","Hironobu Abe","Hirofumi Nishikawa"],"article name":"An efficient recording method for video recorders using the video signature tools","Journal Name":"Consumer Electronics (ICCE) 2014 IEEE International Conference on","vol":"none","pp.": "528-529","Year": "2014","ISSN": "2158-3994","ISBN":"none"},{"authors":["Yasuo Matsuyama","Akihiro Shikano","Hiromichi Iwase","Teruki Horie"],"article name":"Order-aware exemplars for structuring video sets: Clustering aligned matching and retrieval by similarity","Journal Name":"Neural Networks (IJCNN) 2015 International Joint Conference on","vol":"none","pp.": "1-10","Year": "2015","ISSN": "2161-4407","ISBN":"none"},{"authors":["Kota Iwamoto","Takami Sato","Ryoma Oami","Toshiyuki Nomura"],"article name":"Visual duplicate based topic linking using a robust video signature","Journal Name":"Consumer Electronics (ICCE) 2013 IEEE International Conference on","vol":"none","pp.": "280-283","Year": "2013","ISSN": "2158-3994","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Adriana Garboan","Mihai Mitrea"],"article name":"Live camera recording robust video fingerprinting","Journal Name":"Multimedia Systems","vol":"none","pp.":"none","Year": "2015","ISSN": "0942-4962","ISBN":"none"},{"authors":["Kota IWAMOTO","Ryoma OAMI","Takami SATO","Toshiyuki NOMURA"],"article name":"Video Signature Robust to Modifications for Large-scale Video Identification","Journal Name":"Journal of the Japan Society for Precision Engineering","vol.": "79","pp.": "1089","Year": "2013","ISSN": "0912-0289","ISBN":"none"},{"authors":["Jeongsoo Yu","Jaesug Ryu","Jongho Nang"],"article name":"Analyzing Performance of MPEG-7 Video Signature for Video Copy Detection","Journal Name":"KIISE Transactions on Computing Practices","vol.": "20","pp.": "586","Year": "2014","ISSN": "2383-6318","ISBN":"none"}]}]}