{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 11, "citationCountPatent": 0, "totalDownloads": 714},"doi": "10.1109/TCSVT.2011.2171262","title": "Improved Estimation of Transmission Distortion for Error-Resilient Video Coding","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "This paper presents an improved technique for estimating the end-to-end distortion, which includes both a quantization error after encoding and a random transmission error, after transmission in video communication systems. The proposed technique mainly differs from most existing techniques in that it takes into account filtering operations, e.g., interpolation in subpixel motion compensation, as introduced in advanced video codecs. The distortion estimation for pixels or subpixels under filtering operations requires the computation of the second moment of a weighted sum of random variables. In this paper, we prove a proposition for calculating the second moment of a weighted sum of correlated random variables without requiring knowledge of their probability distribution. Then, we apply the proposition to extend our previous error-resilient algorithm for prediction mode decision without significantly increasing complexity. Experimental results using an H.264/AVC codec show that our new algorithm provides an improvement in both rate-distortion performance and subjective quality over existing algorithms. Our algorithm can also be applied in the upcoming high-efficiency video coding standard, where additional filtering techniques are under consideration.","authors": [{"name": "Zhifeng Chen", "affiliation": "Interdigital, Inc., San Diego, CA, USA", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6041018/6041018-photo-1-small.gif", "p": ["Zhifeng Chen received the Ph.D. degree in electrical and computer engineering from the University of Florida, Gainesville, in 2010.", "From 2002 to 2003, he was an Engineer with EPSON, Beijing, China, and from 2003 to 2006, he was a Senior Engineer with Philips, Shanghai, China, working on mobile phone system solution design. He joined Interdigital, Inc., San Diego, CA, in 2010, where he is currently a Staff Engineer working on video coding research."]}}, {"name": "Peshala V. Pahalawatta", "affiliation": "Image Technology Group, Dolby Laboratories, Inc., Burbank, CA, USA", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6041018/6041018-photo-2-small.gif", "p": ["Peshala V. Pahalawatta received the Ph.D. degree in electrical engineering from Northwestern University, Evanston, IL, in 2007.", "He is currently a Staff Engineer with the Image Technology Group, Dolby Laboratories, Inc., Burbank, CA. His current research interests include image and video compression and transmission, image and video quality evaluation, and computer vision."]}}, {"name": "Alexis Michael Tourapis", "affiliation": "Magnum Semiconductor, Inc., Milpitas, CA, USA", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6041018/6041018-photo-3-small.gif", "p": ["Alexis Michael Tourapis (S'99–M'01–SM'07) received the Diploma degree in electrical and computer engineering from the National Technical University of Athens, Athens, Greece, in 1995, and the Ph.D. degree in electrical and electronic engineering from the Hong Kong University of Science and Technology, Clear Water Bay, Hong Kong, in 2001.", "He was on various research and development positions with companies such as Microsoft, Beijing, China, Thomson, Princeton, NJ, DoCoMo Laboratories, Santa Clara, CA, and Dolby Laboratories, Burbank, CA. He is currently with Magnum Semiconductor, Inc., Milpitas, CA, as a Senior Director of Video Algorithm Engineering focusing on the development of next-generation video processing and compression hardware system designs. He currently holds seven U.S. patents and has more than 90 U.S. and international patents pending. He has made contributions to several video coding standards, and in particular to H.264/MPEG-4 AVC, on a variety of topics, such as motion estimation and compensation, rate distortion optimization, rate control, and others.", "Dr. Tourapis received the IEEE HK Section Best Postgraduate Student Paper Award for his work in 2000, and was acknowledged as one of ten most outstanding reviewers by the IEEE Transactions on Image Processing in 2006. Currently, he is a Co-Chair of the development activity on the H.264 Joint Model (JM) reference software. He is a member of the ACM, SPIE, and SMPTE."]}}, {"name": "Dapeng Wu", "affiliation": "Department of Electrical and Computer Engineering, University of Florida, Gainesville, FL, USA", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6041018/6041018-photo-4-small.gif", "p": ["Dapeng Wu (S'98–M'04–SM'06) received the Ph.D. degree in electrical and computer engineering from Carnegie Mellon University, Pittsburgh, PA, in 2003.", "Currently, he is a Professor with the Department of Electrical and Computer Engineering, University of Florida, Gainesville."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Decoding", "Approximation methods", "Random variables", "Estimation", "Quantization", "Prediction algorithms", "Algorithm design and analysis"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video communication", "statistical distributions", "video codecs", "video coding"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["video coding standard", "transmission distortion estimation", "error-resilient video coding", "end-to-end distortion", "quantization error", "encoding", "random transmission error", "video communication system", "interpolation", "subpixel motion compensation", "advanced video codecs", "correlated random variables", "probability distribution", "error-resilient algorithm", "prediction mode decision", "H.264/AVC codec", "rate-distortion performance"]}, {"type": "Author Keywords ", "kwd": ["wireless video", "ERMPC", "error-resilient rate-distortion optimization (ERRDO)", "filtering", "fractional motion estimation", "mode decision", "subpixel-level distortion estimation"]}],"citations":[{"ieee-citations":[{"authors":["Sina Zamani","Tejaswi Nanjundaswamy","Kenneth Rose"],"article name":"Recursive end-to-end distortion estimation for error-resilient adaptive predictive compression systems","Journal Name":"Statistical Signal Processing Workshop (SSP) 2016 IEEE","vol":"none","pp.": "1-5","Year": "2016","ISSN":"none","ISBN":"none"},{"authors":["Zhifeng Chen","Dapeng Wu"],"article name":"Prediction of Transmission Distortion for Wireless Video Communication: Analysis","Journal Name":"Image Processing IEEE Transactions on","vol.": "21","pp.": "1123-1137","Year": "2012","ISSN": "1057-7149","ISBN":"none"},{"authors":["Pan Gao","Wei Xiang","John Billingsley","Yongbing Zhang"],"article name":"Error-resilient multi-view video coding for next generation 3-D video broadcasting","Journal Name":"ICT Convergence (ICTC) 2013 International Conference on","vol":"none","pp.": "1022-1026","Year": "2013","ISSN":"none","ISBN":"none"},{"authors":["Qin Cheng","Dimitris Agrafiotis"],"article name":"End to end video distortion estimation with advanced error concealment considerations","Journal Name":"Visual Communications and Image Processing Conference 2014 IEEE","vol":"none","pp.": "303-306","Year": "2014","ISSN":"none","ISBN":"none"},{"authors":["Pinghua Zhao","Yanwei Liu","Jinxia Liu","Ruixiao Yao","Song Ci"],"article name":"SSIM-based cross-layer optimized video streaming over LTE downlink","Journal Name":"Global Communications Conference (GLOBECOM) 2014 IEEE","vol":"none","pp.": "1394-1399","Year": "2014","ISSN":"none","ISBN":"none"},{"authors":["Pan Gao","Wei Xiang"],"article name":"Rate-Distortion Optimized Mode Switching for Error-Resilient Multi-View Video Plus Depth Based 3-D Video Coding","Journal Name":"Multimedia IEEE Transactions on","vol.": "16","pp.": "1797-1808","Year": "2014","ISSN": "1520-9210","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Hanzhang Wang","Xiaodong Wang"],"article name":"Important macroblock distinction model for multi-view plus depth video transmission over error-prone network","Journal Name":"Multimedia Tools and Applications","vol":"none","pp.":"none","Year": "2016","ISSN": "1380-7501","ISBN":"none"},{"authors":["Dong Zhang","Jie Liang"," Singh"],"article name":"Fast transmission distortion estimation and adaptive error protection for H.264/AVC-based embedded video conferencing systems","Journal Name":"Signal Processing: Image Communication","vol.": "28","pp.": "417","Year": "2013","ISSN": "09235965","ISBN":"none"},{"authors":["Pinghua Zhao","Yanwei Liu","Jinxia Liu","Antonios Argyriou","Song Ci"],"article name":"SSIM-based error-resilient cross-layer optimization for wireless video streaming","Journal Name":"Signal Processing: Image Communication","vol.": "40","pp.": "36","Year": "2016","ISSN": "09235965","ISBN":"none"},{"authors":["Enrico Masala","Fabio De Vito","Juan Carlos De Martin"],"article name":"On the effects of sender-receiver concealment mismatch on multimedia communication optimization","Journal Name":"Multimedia Tools and Applications","vol.": "74","pp.": "2879","Year": "2015","ISSN": "1380-7501","ISBN":"none"},{"authors":["Pan Gao","Wei Xiang","Qiang Peng","John Billingsley"],"article name":"A Rate–Distortion Optimized Error-Resilient Algorithm for Multi-view Video Coding","Journal Name":"Circuits Systems and Signal Processing","vol":"none","pp.":"none","Year": "2015","ISSN": "0278-081X","ISBN":"none"}]}]}