{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 5, "citationCountPatent": 0, "totalDownloads": 992},"doi": "10.1109/TCSVT.2011.2171212","title": "Two-Layer Directional Transform for High Performance Video Coding","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "This paper presents a directional transform scheme for coding interprediction errors in block-based hybrid video coding. It proposes a two-layer transform structure, where the first layer uses discrete wavelet transform to compact the residue energy to the LL band and then the second layer uses 2-D nonseparable directional transforms to deal with the arbitrary edge directions in the four subbands. By doing this, the edges in a macroblock are efficiently compacted to a few coefficients and at the same time the overhead used to indicate the transform directions is affordable. Experimental results show that the proposed scheme provides peak signal-to-noise ratio gain up to 0.46 dB, compared with H.264/AVC High Profile.","authors": [{"name": "Jie Dong", "affiliation": "Office of the Chief Technical Officer, InterDigital Communications, San Diego, CA, USA", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6041016/6041016-photo-1-small.gif", "p": ["Jie Dong (S'07–M'10) received the B.E. and M.E. degrees in information engineering from Zhejiang University, Hangzhou, China, in 2002 and 2005, respectively, and the Ph.D. degree in electronic engineering from the Chinese University of Hong Kong, Shatin, Hong Kong, in 2009.", "In 2010, she was a Post-Doctoral Research Fellow with the Chinese University of Hong Kong. In 2011, she joined the Office of the Chief Technical Officer, InterDigital Communications, San Diego, CA, as a Staff Engineer. Her current research interests include high-efficiency video coding and real-time high-definition video processing."]}}, {"name": "King Ngi Ngan", "affiliation": "Department of Electronic Engineering, Chinese University of Hong Kong, Shatin, Hong Kong", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6041016/6041016-photo-2-small.gif", "p": ["King Ngi Ngan (F'00) received the Ph.D. degree in electrical engineering from Loughborough University, Loughborough, U.K.", "He is currently a Chair Professor with the Department of Electronic Engineering, Chinese University of Hong Kong, Shatin, Hong Kong. He was previously a Full Professor with the Nanyang Technological University, Singapore, and the University of Western Australia, Crawley, Australia. He holds honorary and visiting professorships of numerous universities in China, Australia, and South East Asia. He has published extensively including three authored books, six edited volumes, and over 300 refereed technical papers, and also edited nine special issues in journals. In addition, he holds ten patents in the areas of image/video coding and communications.", "Prof. Ngan was an Associate Editor of the Journal on Visual Communications and Image Representation, and an Area Editor of the EURASIP Journal of Signal Processing: Image Communication. He was an Associate Editor of the IEEE Transactions on circuits and systems for video technology and the Journal of Applied Signal Processing. He chaired a number of prestigious international conferences on video signal processing and communications, and served on the advisory and technical committees of numerous professional organizations. He co-chaired the IEEE International Conference on Image Processing held in Hong Kong in September 2010. He is a fellow of IET (U.K.) and IEAust (Australia), and was an IEEE Distinguished Lecturer from 2006 to 2007."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Discrete wavelet transforms", "Encoding", "Image edge detection", "Discrete cosine transforms", "Correlation", "Filter banks"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video coding", "discrete wavelet transforms"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["signal-to-noise ratio", "two-layer directional transform", "high performance video coding", "interprediction error coding", "block-based hybrid video coding", "two-layer transform structure", "discrete wavelet transform", "residue energy", "LL band", "2D nonseparable directional transform", "arbitrary edge direction", "macroblock", "transform direction"]}, {"type": "Author Keywords ", "kwd": ["transform", "AVC", "H.264", "HEVC"]}],"citations":[{"ieee-citations":[{"authors":["Miaohui Wang","Qilin Bi","Yulong Zhu"],"article name":"Video compression: A jointly optimized transform-quantization method","Journal Name":"Signal Processing Communications and Computing (ICSPCC) 2017 IEEE International Conference on","vol":"none","pp.": "1-5","Year": "2017","ISSN":"none","ISBN":"none"},{"authors":["Burcu Karasoy","Fatih Kamisli"],"article name":"Transforms for the disparity-compensated prediction residuals","Journal Name":"Signal Processing and Communications Applications Conference (SIU) 2014 22nd","vol":"none","pp.": "168-171","Year": "2014","ISSN":"none","ISBN":"none"},{"authors":["Miaohui Wang","King Ngi Ngan","Long Xu"],"article name":"Efficient H.264/AVC Video Coding with Adaptive Transforms","Journal Name":"Multimedia IEEE Transactions on","vol.": "16","pp.": "933-946","Year": "2014","ISSN": "1520-9210","ISBN":"none"},{"authors":["Miaohui Wang","King Ngi Ngan","Huanqiang Zeng"],"article name":"A rate distortion optimized transform for motion compensation residual","Journal Name":"Picture Coding Symposium (PCS) 2013","vol":"none","pp.": "13-16","Year": "2013","ISSN":"none","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Burcu Karasoy","Fatih Kamisli"],"article name":"Multiview video compression with 1-D transforms","Journal Name":"Signal Processing: Image Communication","vol.": "33","pp.": "14","Year": "2015","ISSN": "09235965","ISBN":"none"}]}]}