{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 3, "citationCountPatent": 0, "totalDownloads": 448},"doi": "10.1109/TCSVT.2011.2158341","title": "Parametric OBMC for Pixel-Adaptive Temporal Prediction on Irregular Motion Sampling Grids","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "This paper adapts overlapped block motion compensation (OBMC) to suit variable block-size motion partitioning. The motion vectors (MVs) for various partitions are formalized as motion samples taken on an irregular grid. From this viewpoint, determining OBMC weights to associate with these samples becomes an under-determined problem since a distinct solution has to be sought for each prediction pixel. In this paper, we tackle this problem by expressing the optimal weights in closed form based on parametric signal assumptions. In particular, the computation of this solution requires only the geometric relations between the prediction pixel and its nearby block centers, leading to a generic framework capable of reconstructing temporal predictors from any irregularly sampled MVs. A modified implementation is also proposed to address the MV location uncertainty and to reduce computational complexity. Experimental results demonstrate that our scheme performs better than similar previous works, and when compared to the recently proposed Quadtree-based adaptive loop filter and enhanced adaptive interpolation filter, show a comparable gain. Furthermore, the combination of it with either of them gives a combined effect that is almost the sum of their separate improvements.","authors": [{"name": "Yi-Wen Chen", "affiliation": "Department of Computer Science, National Chiao Tung University, Hsinchu, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6121964/5782943/5782943-photo-1-small.gif", "p": ["Yi-Wen Chen was born in Taichung, Taiwan, in 1979. He received the B.S. and M.S. degrees in computer science and information engineering from National Chiao Tung University, Hsinchu, Taiwan, in 2001 and 2003, respectively. Currently, he is pursing the Ph.D. degree in computer science and information engineering from National Chiao Tung University.", "He is a Moving Picture Expert Group (MPEG) Delegate. Since 2006, he has actively participated in ISO's MPEG digital video coding standardization process and contributed to the development of the MPEG-4 Part 10 AVC Amd.2 multiview video coding standard. He is currently devoting himself to the development of high efficiency video coding, the next-generation video coding standard. His current research interests include video/image compression, computer vision, video signal processing, content-based video indexing and retrieval, and multimedia information systems."]}}, {"name": "Wen-Hsiao Peng", "affiliation": "Department of Computer Science, National Chiao Tung University, Hsinchu, Taiwan", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6121964/5782943/5782943-photo-2-small.gif", "p": ["Wen-Hsiao Peng was born in Hsinchu, Taiwan, in 1975. He received the B.S., M.S., and Ph.D. degrees in electronics engineering from National Chiao Tung University (NCTU), Hsinchu, in 1997, 1999, and 2005, respectively.", "From 2000 to 2001, he was with the Intel Microprocessor Research Laboratory, Santa Clara, CA, where he developed the first real-time MPEG-4 fine granularity scalability codec and demonstrated its application in 3-D, peer-to-peer video conferencing. In 2005, he joined the Department of Computer Science, NCTU, where he is currently an Assistant Professor. Since 2003, he has actively participated in the International Organization for Standardization Moving Picture Expert Group (MPEG) digital video coding standardization process and contributed to the development of the MPEG-4 Part 10 AVC Amd.3 scalable video coding standard. He has published more than 30 technical papers in the field of video and signal processing. His current research interests include high-efficiency video coding, scalable video coding, video codec optimization, and platform-based architecture design for video compression.", "Dr. Peng is currently a Technical Committee Member for the Visual Signal Processing and Communications and Multimedia Systems and Application tracks for the IEEE Circuits and Systems Society. He organized two special sessions on high-efficiency video coding in ICME 2010 and APSIPA ASC 2010, and was a Technical Program Co-Chair for VCIP 2011."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Pixel", "Uncertainty", "Interpolation", "Motion compensation", "Adaptive filters", "Shape"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video coding", "motion compensation"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["enhanced adaptive interpolation filter", "parametric OBMC", "pixel-adaptive temporal prediction", "irregular motion sampling grids", "overlapped block motion compensation", "variable block-size motion partitioning", "motion vectors", "irregular grid", "prediction pixel", "parametric signal assumption", "generic framework", "temporal predictors", "computational complexity", "quadtree-based adaptive loop filter"]}, {"type": "Author Keywords ", "kwd": ["video coding", "Overlapped block motion compensation (OBMC)", "parametric window design", "variable block size motion compensation (VBSMC)"]}],"citations":[{"ieee-citations":[{"authors":["Jian-Liang Lin","Yi-Wen Chen","Yu-Wen Huang","Shaw-Min Lei"],"article name":"Motion Vector Coding in the HEVC Standard","Journal Name":"Selected Topics in Signal Processing IEEE Journal of","vol.": "7","pp.": "957-968","Year": "2013","ISSN": "1932-4553","ISBN":"none"},{"authors":["Wen-Hsiao Peng","Chun-Chi Chen"],"article name":"An Interframe Prediction Technique Combining Template Matching Prediction and Block-Motion Compensation for High-Efficiency Video Coding","Journal Name":"Circuits and Systems for Video Technology IEEE Transactions on","vol.": "23","pp.": "1432-1446","Year": "2013","ISSN": "1051-8215","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Hyo-Song Kim","Rae-Hong Park"],"article name":"Multilevel Residual Motion Compensation for High Efficiency Video Coding","Journal Name":"Journal of Signal Processing Systems","vol":"none","pp.":"none","Year": "2016","ISSN": "1939-8018","ISBN":"none"}]}]}