{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 5, "citationCountPatent": 0, "totalDownloads": 504},"doi": "10.1109/TCSVT.2011.2179453","title": "Error-Resilient and Error Concealment 3-D SPIHT for Multiple Description Video Coding With Added Redundancy","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "In this paper, we present a multiple description video coding algorithm based on error-resilient and error concealment set partitioning in hierarchical trees (ERC-SPIHT). In this proposed approach, additional redundancy is generated by wavelet decomposing the spatial root subband and such redundancy is then intentionally inserted into the substreams. As a result, the novelty of the proposed approach is that the root subband coefficients lost during transmission in any substream can be reconstructed by exploiting both inherent redundancy and inserted redundancy. This reconstruction procedure is implemented in two steps, first by using existing 2-D error concealment techniques, and second with the proposed root subband recovery approach. The former step is used to estimate the missing coefficients in the spatial root and high frequency subbands by exploiting the inherent redundancy, while the latter attempts to utilize the inserted redundancy to further improve the precision in the estimation of the missing spatial root subband coefficients. The proposed root subband recovery method can be iteratively applied and accuracy of the reconstruction can be gradually increased with each iteration. Experimental results on different video sequences show that the proposed method maintains error-resilience with high coding efficiency. In particular, our results demonstrate that the proposed algorithm achieves a significant improvement on video quality by up to 2.5753 dB in the presence of a substream loss compared to ERC-SPIHT.","authors": [{"name": "Jie Zhu", "affiliation": "Department of Systems and Computer Engineering, Carleton University, Ottawa, Canada", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6209393/6101565/6101565-photo-1-small.gif", "p": ["Jie Zhu received the M. A. Sc. degree in electrical and computer engineering from the Department of Systems and Computer Engineering, Carleton University, Ottawa, ON, Canada, in 2004, where she is currently pursuing the Ph.D. degree.", "From 2004 to 2006, she was a Systems Engineer with ZTE Corporation, Toronto, ON. Her current research interests include image and video processing, coding, and transmission."]}}, {"name": "Richard M. Dansereau", "affiliation": "Department of Systems and Computer Engineering, Carleton University, Ottawa, Canada", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6209393/6101565/6101565-photo-2-small.gif", "p": ["Richard M. Dansereau (S'96–M'01–SM'10) received the B.S. and Ph.D. degrees in computer engineering from the Department of Electrical and Computer Engineering, University of Manitoba, Winnipeg, MB, Canada, in 1995 and 2001, respectively.", "From 1996 to 2000, he was a Researcher with Telecommunications Research Laboratories, Winnipeg, dealing with wavelet and fractal image analysis. From 1999 to 2000, he was with SpectraWorks, Inc., Winnipeg, developing MPEG-DB satellite communication systems. From 2000 to 2001, he was an Instructor and Research Engineer with the Department of Electrical and Computer Engineering, Georgia Institute of Technology, Atlanta, and was also part of the Center for Signal and Image Processing, Georgia Institute of Technology. In September 2001, he joined the Department of Systems and Computer Engineering, Carleton University, Ottawa, ON, Canada, where he is currently an Associate Professor."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Redundancy", "Wavelet transforms", "Encoding", "Decoding", "Video coding", "Optical fibers"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["wavelet transforms", "video coding"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["video sequences", "error-resilient", "error concealment 3D SPIHT", "multiple description video coding algorithm", "added redundancy", "error concealment set partitioning", "hierarchical trees", "ERC-SPIHT", "wavelet decomposing", "spatial root subband", "reconstruction procedure", "2D error concealment technique", "high coding efficiency"]}, {"type": "Author Keywords ", "kwd": ["set partitioning in hierarchical trees (SPIHT)", "Error concealment", "error-resilience multiple description coding"]}],"citations":[{"ieee-citations":[{"authors":["nguez","nchez","Osslan Osiris Vergara Villegas"],"article name":"Improved SPIHT Algorithm","Journal Name":"Signal-Image Technology and Internet-Based Systems (SITIS) 2014 Tenth International Conference on","vol":"none","pp.": "152-156","Year": "2014","ISSN":"none","ISBN":"none"},{"authors":["Muhammad Usman","Xiangjian He","Min Xu","Kin Man Lam"],"article name":"Survey of Error Concealment techniques: Research directions and open issues","Journal Name":"Picture Coding Symposium (PCS) 2015","vol":"none","pp.": "233-238","Year": "2015","ISSN":"none","ISBN":"none"},{"authors":["Muhammad Usman","Xiangjian He","Kin-Man Lam","Min Xu","Syed Mohsin Matloob Bokhari","Jinjun Chen"],"article name":"Frame Interpolation for Cloud-Based Mobile Video Streaming","Journal Name":"Multimedia IEEE Transactions on","vol.": "18","pp.": "831-839","Year": "2016","ISSN": "1520-9210","ISBN":"none"},{"authors":["Evgeny Belyaev","ren Forchhammer","Marian Codreanu"],"article name":"Error Concealment for 3-D DWT Based Video Codec Using Iterative Thresholding","Journal Name":"Communications Letters IEEE","vol.": "21","pp.": "1731-1734","Year": "2017","ISSN": "1089-7798","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Kotoku OMURA","Shoichiro YAMASAKI","Tomoko K. MATSUSHIMA","Hirokazu TANAKA","Miki HASEYAMA"],"article name":"Performance Improvement of Error-Resilient 3D DWT Video Transmission Using Invertible Codes","Journal Name":"IEICE Transactions on Fundamentals of Electronics Communications and Computer Sciences","vol.": "E99","pp.": "2256","Year": "2016","ISSN": "0916-8508","ISBN":"none"}]}]}