{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 3, "citationCountPatent": 0, "totalDownloads": 482},"doi": "10.1109/TCSVT.2012.2197079","title": "Efficient Recurrent Pattern Matching Video Coding","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "In this paper, we propose a pattern-matching-based algorithm for video compression. This algorithm, named multidimensional multiscale parser (MMP)-Video, is based on the H.264/AVC video encoder, but uses a pattern-matching paradigm instead of the state-of-the-art transform-quantization-entropy encoding approach. The proposed method adopts the use of multiscale recurrent patterns to compress both spatial and temporal prediction residues, totally replacing the use of transforms and quantization. Experimental results show that the coding performance of MMP-Video is better than the one of H.264/AVC high profile, especially for medium to high bit-rates. The gains range up to 0.7 dB, showing that, in spite of its larger computational complexity, the use of multiscale recurrent pattern matching paradigm deserves being investigated as an alternative for video compression.","authors": [{"name": "Nelson C. Francisco", "affiliation": "Instituto de Telecomunica&#x00E7;&#x00F5;es, Leiria, Portugal", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6255841/6193166/6193166-photo-1-small.gif", "p": ["Nelson C. Francisco (M'10) was born in Paris, France, in 1983. He graduated in electrical engineering from the Escola Superior de Tecnologia e Gestão, Instituto Politécnico de Leiria, Leiria, Portugal, in 2007, and received the M. Sc. degree in electrical engineering from the Universidade de Trás-os-Montes e Alto Douro, Vila Real, Portugal, in 2008. He is currently pursuing the Ph.D. degree with the Universidade Federal do Rio de Janeiro, Rio de Janeiro, Brazil, in collaboration with the Instituto de Telecomunicações, Lisbon, Portugal.", "Since 2008, he has been a Researcher with the Instituto de Telecomunicações. Since 2010, he has also been with the Department of Electrical Engineering, Escola Superior de Tecnologia e Gestão, Instituto Politécnico de Leiria. His current research interests include digital signal and image processing, namely, image and video compression."]}}, {"name": "Nuno M. M. Rodrigues", "affiliation": "Instituto de Telecomunica&#x00E7;&#x00F5;es, Leiria, Portugal", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6255841/6193166/6193166-photo-2-small.gif", "p": ["Nuno M. M. Rodrigues (M'99) graduated in electrical engineering in 1997, and received the M. Sc. degree from the Universidade de Coimbra, Coimbra, Portugal, in 2000, and the Ph.D. degree from the Universidade de Coimbra, in 2009, in collaboration with the Universidade Federal do Rio de Janeiro, Rio de Janeiro, Brazil.", "Since 1997, he has been with the Department of Electrical Engineering, Escola Superior de Tecnologia e Gestão, Instituto Politécnico de Leiria, Leiria, Portugal. Since 1998, he has been a Researcher with the Instituto de Telecomunicações, Lisbon, Portugal. He is currently involved as a Coordinator as well as a Researcher in various national and international funded projects. His current research interests include digital signal and image processing, namely, image and video compression, as well as stereoscopic image and video compression."]}}, {"name": "Eduardo A. B. da Silva", "affiliation": "Program of Electrical Engineering, COPPE, Universidade Federal do Rio de Janeiro, Rio de Janeiro, Brazil", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6255841/6193166/6193166-photo-3-small.gif", "p": ["Eduardo A. B. da Silva (M'95–SM'05) was born in Rio de Janeiro, Brazil. He received the Electronics Engineering degree from the Instituto Militar de Engenharia (IME), Rio de Janeiro, in 1984, the M. Sc. degree in electrical engineering from the Universidade Federal do Rio de Janeiro (COPPE/UFRJ), Rio de Janeiro, in 1990, and the Ph.D. degree in electronics from the University of Essex, Essex, U.K., in 1995.", "In 1987 and 1988, he was with the Department of Electrical Engineering, IME. Since 1989, he has been with the Department of Electronics Engineering (the undergraduate department), UFRJ. He has also been with the Department of Electrical Engineering (the graduate studies department), COPPE/UFRJ, since 1996. He was the Head of the Department of Electrical Engineering, COPPE/UFRJ, in 2002. In 2007, he was a Visiting Professor with the University of Nice Sophia-Antipolis, Nice, France. He is a co-author of the book, Digital Signal Processing—System Analysis and Design (Cambridge University Press, 2002), which has also been translated into the Portuguese and Chinese languages. He was part of the team that worked on the development of the Brazilian Digital Television System. He has given training and consultancy to several Brazilian cable and satellite television companies on digital television. He has published over 160 peer-reviewed papers in digital signal, image and video processing. His teaching and research interests include digital signal, image and video processing, especially signal compression, digital television, 3-D videos, image quality evaluation, wavelet transforms, mathematical morphology, and applications to telecommunications.", "Dr. da Silva won the British Telecom Postgraduate Publication Prize in 1995 for his paper in aliasing cancelation in subband coding. He served as an Associate Editor of the IEEE Transactions on Circuits and Systems Part I, in 2002, 2003, 2008, and 2009, the IEEE Transactions on Circuits and Systems Part II, in 2006 and 2007, and Multidimensional, Systems and Signal Processing from 2006 to 2011. He was a Distinguished Lecturer of the IEEE Circuits and Systems Society in 2003 and 2004. He was the Technical Program Co-Chair of ISCAS2011."]}}, {"name": "Murilo Bresciani de Carvalho", "affiliation": "Department of Telecommunications Engineering, Universidade Federal Fluminense, Niter&#x00F3;i, Brazil", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6255841/6193166/6193166-photo-4-small.gif", "p": ["Murilo Bresciani de Carvalho was born in Petrópolis, Brazil, in 1964. He received the B.E. degree in electrical engineering from Universidade Federal Fluminense (UFF), Niterói, Brazil, in 1986, the M. Sc. degree in telecommunications from the Pontifícia Universidade Católica do Rio de Janeiro, Rio de Janeiro, Brazil, in 1994, and the D. Sc. degree in signal processing from the Universidade Federal do Rio de Janeiro, Rio de Janeiro, in 2001.", "Since 1994, he has been with the Department of Telecommunications Engineering, UFF. His current research interests include digital image/video processing, source/channel coding, and digital signal processing."]}}, {"name": "S&#x00E9;rgio M. M. de Faria", "affiliation": "Instituto de Telecomunica&#x00E7;&#x00F5;es, Leiria, Portugal", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6255841/6193166/6193166-photo-5-small.gif", "p": ["Sérgio M. M. de Faria (M'93–SM'08) was born in Portugal, in 1965. He received the Engineering degree in electrical engineering from the Universidade de Coimbra, Coimbra, Portugal, in 1988, the M. Sc. degree in electrical engineering from the Universidade de Coimbra, in 1992, and the Ph.D. degree in electronics and telecommunications from the University of Essex, Essex, U.K., in 1996.", "In 1988 and 1989, he was with the Department of Electrical Engineering, Universidade de Coimbra, having a scholarship from INIC. Since 1990, he has been with the Department of Electrical Engineering, Escola Superior de Tecnologia e Gestão, Instituto Politécnico de Leiria, Leiria, Portugal. He also collaborates in master courses with the Universidade de Coimbra. Since 1996, he has been a Researcher with the Instituto de Telecomunicações, Lisbon, Portugal. He has edited two books and is the author of five book chapters and nine journal papers. He holds two patents. He has more than 70 papers published in international conferences. He has been involved in various funded projects, national and international, and is responsible for various funded projects. He served as an editor of the International Conference on Signal Processing and Multimedia Applications proceedings in 2006 and 2007. His current research interests include digital signal and image processing, namely, image and video compression, motion representation, and 3DTV."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Dictionaries", "Encoding", "Image coding", "Pattern matching", "Vectors", "Training", "Prediction algorithms"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video coding", "data compression", "entropy codes", "pattern matching", "quantisation (signal)"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["multiscale recurrent patterns", "efficient recurrent pattern matching video coding", "pattern matching based algorithm", "video compression", "multidimensional multiscale parser Video", "H.264/AVC video encoder", "transform quantization- entropy encoding"]}, {"type": "Author Keywords ", "kwd": ["video coding", "Dictionary-based coding", "recurrent pattern matching", "vector quantization"]}],"citations":[{"ieee-citations":[{"authors":["Nelson C. Francisco","Nuno M. M. Rodrigues","Eduardo A. B. da Silva","Murilo B. de Carvalho","rgio M. M. de Faria"],"article name":"Video compression using 3D multiscale recurrent patterns","Journal Name":"Circuits and Systems (ISCAS) 2013 IEEE International Symposium on","vol":"none","pp.": "1412-1415","Year": "2013","ISSN": "0271-4302","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Yitao Ma","Sadahiko Miura","Hiroaki Honjo","Shoji Ikeda","Takahiro Hanyu","Hideo Ohno","Tetsuo Endoh"],"article name":"A spin transfer torque magnetoresistance random access memory-based high-density and ultralow-power associative memory for fully data-adaptive nearest neighbor search with current-mode similarity evaluation and time-domain minimum searching","Journal Name":"Japanese Journal of Applied Physics","vol.": "56","pp.": "04CF08","Year": "2017","ISSN": "0021-4922","ISBN":"none"},{"authors":["Yitao Ma","Sadahiko Miura","Hiroaki Honjo","Shoji Ikeda","Takahiro Hanyu","Hideo Ohno","Tetsuo Endoh"],"article name":"A 600-µW ultra-low-power associative processor for image pattern recognition employing magnetic tunnel junction-based nonvolatile memories with autonomic intelligent power-gating scheme","Journal Name":"Japanese Journal of Applied Physics","vol.": "55","pp.": "04EF15","Year": "2016","ISSN": "0021-4922","ISBN":"none"}]}]}