{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 8, "citationCountPatent": 0, "totalDownloads": 900},"doi": "10.1109/TCSVT.2012.2186740","title": "Distributed Robust Optimization for Scalable Video Multirate Multicast Over Wireless Networks","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "This paper proposes a distributed robust optimization scheme to jointly optimize overall video quality and traffic performance for scalable video multirate multicast over practical wireless networks. In order to guarantee layered utility maximization, the initial nominal joint source and network optimization is defined, where each scalable layer is tailored in an incremental order and finds jointly optimal multicast paths and associated rates with network coding. To enhance the robustness of the nominal convex optimization formulation with nonlinear constraints, we reserve partial bandwidth for backup paths disjoint from the primal paths. It considers the path-overlapping allocation of backup paths for different receivers to take advantage of network coding, and takes into account the robust multipath rate-control and bandwidth reservation problem for scalable video multicast streaming when possible link failures of primary paths exist. Specifically, an uncertainty set of the wireless medium capacity is introduced to represent the uncertain and time-varying property of parameters related to the wireless channel. The targeted uncertainty in the robust optimization problem is studied in a form of protection functions with nonlinear constraints, to analyze the tradeoff between robustness and distributedness. Using the dual decomposition and primal-dual update approach, we develop a fully decentralized algorithm with regard to communication overhead. Through extensive experimental results under critical performance factors, the proposed algorithm could converge to the optimal steady-state more quickly, and adapt the dynamic network changes in an optimal tradeoff between optimization performance and robustness than existing optimization schemes.","authors": [{"name": "Chenglin Li", "affiliation": "Department of Electronic Engineering, Shanghai Jiao Tong University, Shanghai, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6209393/6145629/6145629-photo-1-small.gif", "p": ["Chenglin Li received the B.S. and M.S. degrees in electronic engineering from Shanghai Jiao Tong University, Shanghai, China, in 2007 and 2009, respectively, where he is currently pursuing the Ph.D. degree.", "His current research interests include network-oriented image/video processing and communication, and the network-based optimization for video sources."]}}, {"name": "Hongkai Xiong", "affiliation": "Department of Electronic Engineering, Shanghai Jiao Tong University, Shanghai, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6209393/6145629/6145629-photo-2-small.gif", "p": ["Hongkai Xiong (M'01–SM'10) received the Ph.D. degree in communication and information systems from Shanghai Jiao Tong University (SJTU), Shanghai, China, in 2003.", "Since 2003, he has been with the Department of Electronic Engineering, SJTU, where he is currently an Associate Professor. From December 2007 to December 2008, he was a Research Scholar with the Department of Electrical and Computer Engineering, Carnegie Mellon University, Pittsburgh, PA. At SJTU, he directs the Image, Video, and Multimedia Communications Laboratory and the Multimedia Communication Division of the Key Laboratory of the Ministry of Education of China, Intelligent Computing and Intelligent System, which is also co-granted by Microsoft Research. He has published over 90 refereed journal and conference papers. His current research interests include source coding/network information theory, signal processing, computer vision and graphics, and statistical machine learning.", "Dr. Xiong was the recipient of the Top 10% Paper Award for “Super-resolution reconstruction with prior manifold on primitive patches for video compression” at the 2011 IEEE International Workshop on Multimedia Signal Processing, the SMC-A Excellent Young Faculty Award of SJTU, in 2010, and the New Century Excellent Talents in University Award from the Ministry of Education of China, in 2009. He a Technical Program Committee Member of several IEEE conferences. He currently is a Technical Committee Member of Signal Processing of the Shanghai Institute of Electronics."]}}, {"name": "Junni Zou", "affiliation": "School of Communication and Information Engineering, Shanghai University, Shanghai, China", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6209393/6145629/6145629-photo-3-small.gif", "p": ["Junni Zou (M'06) received the M.S. and Ph.D. degrees in communication and information systems from Shanghai University, Shanghai, China, in 2004 and 2006, respectively.", "Since 2006, she has been with the School of Communication and Information Engineering, Shanghai University, where she is an Associate Professor. Currently, she is a Research Scholar with the Department of Electrical and Computer Engineering, University of California at San Diego, San Diego. She has published over 30 refereed journal and conference papers. Her current research interests include distributed resource allocation, multimedia communication, and network information theory.", "Dr. Zou was a recipient of the Shanghai Rising-Star Award in 2011. She is a Technical Committee Member of Signal Processing with the Shanghai Institute of Electronics."]}}, {"name": "Chang Wen Chen", "affiliation": "Department of Computer Science and Engineering, State University of New York, Buffalo, NY, USA", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6209393/6145629/6145629-photo-4-small.gif", "p": ["Chang Wen Chen (F'04) received the B.S. degree from the University of Science and Technology of China, Hefei, Anhui, China, in 1983, the M.S.E.E. degree from the University of Southern California, Los Angeles, in 1986, and the Ph.D. degree from the University of Illinois at Urbana-Champaign, Urbana, in 1992.", "Since 2008, he has been a Professor of computer science and engineering with the State University of New York, Buffalo. From 2003 to 2007, he was an Allen S. Henry Distinguished Professor with the Department of Electrical and Computer Engineering, Florida Institute of Technology, Melbourne. He was on the Faculty of Electrical and Computer Engineering, University of Missouri-Columbia, Columbia, from 1996 to 2003, and with the University of Rochester, Rochester, NY, from 1992 to 1996. From 2000 to 2002, he was the Head of the Interactive Media Group, David Sarnoff Research Laboratories, Princeton, NJ. He has also consulted with Kodak Research Laboratories, Microsoft Research, Beijing, China, Mitsubishi Electric Research Laboratories, Cambridge, MA, NASA Goddard Space Flight Center, Greenbelt, MD, and the U.S. Air Force Rome Laboratories, Rome, NY.", "Dr. Chen was the Editor-in-Chief of the IEEE Transactions on Circuits and Systems for Video Technology from January 2006 to December 2009. He was an Editor of the Proceedings of the IEEE, the IEEE Transactions on Multimedia, the IEEE Journal on Selected Areas in Communications, the IEEE Multimedia, the Journal of Wireless Communication and Mobile Computing, the EUROSIP Journal of Signal Processing: Image Communications, and the Journal of Visual Communication and Image Representation. He has also chaired and served on numerous technical program committees for the IEEE and other international conferences. He was elected a fellow of the SPIE for his contributions in electronic imaging and visual communications."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Robustness", "Optimization", "Uncertainty", "Static VAr compensators", "Network coding", "Wireless networks"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["wireless channels", "bandwidth allocation", "convex programming", "multicast communication", "network coding", "radio networks", "telecommunication traffic", "time-varying channels", "video streaming"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["video quality optimization", "distributed robust optimization", "scalable video multirate multicast", "wireless network", "decentralized algorithm", "primal-dual update approach", "dual decomposition", "protection functions", "robust optimization problem", "wireless channel", "time-varying property", "wireless medium capacity", "scalable video multicast streaming", "bandwidth reservation problem", "multipath rate-control", "path-overlapping allocation", "backup paths disjoint", "partial bandwidth", "nonlinear constraints", "nominal convex optimization formulation", "network coding", "network optimization", "layered utility maximization", "traffic performance optimization"]}, {"type": "Author Keywords ", "kwd": ["scalable video coding", "Multirate multicast", "network coding", "rate-distortion", "robust optimization"]}],"citations":[{"ieee-citations":[{"authors":["Chamitha de Alwis","H. Kodikara Arachchi","Anil Fernando","Mahsa Pourazad"],"article name":"Content and network-aware multicast over wireless networks","Journal Name":"Heterogeneous Networking for Quality Reliability Security and Robustness (QShine) 2014 10th International Conference on","vol":"none","pp.": "122-128","Year": "2014","ISSN":"none","ISBN":"none"},{"authors":["Alessandro Floris","Luigi Atzori","Giaime Ginesu","Daniele D. Giusto"],"article name":"Reduced-reference quality estimation for rate control in 3D video multicasting","Journal Name":"Quality of Multimedia Experience (QoMEX) 2013 Fifth International Workshop on","vol":"none","pp.": "32-33","Year": "2013","ISSN":"none","ISBN":"none"},{"authors":["Changqiao Xu","Zhuofeng Li","Jinglin Li","Hongke Zhang","Gabriel-Miro Muntean"],"article name":"Cross-Layer Fairness-Driven Concurrent Multipath Video Delivery Over Heterogeneous Wireless Networks","Journal Name":"Circuits and Systems for Video Technology IEEE Transactions on","vol.": "25","pp.": "1175-1189","Year": "2015","ISSN": "1051-8215","ISBN":"none"},{"authors":["Chenglin Li","Hongkai Xiong","Junni Zou","Dapeng Oliver Wu"],"article name":"Joint Dynamic Rate Control and Transmission Scheduling for Scalable Video Multirate Multicast Over Wireless Networks","Journal Name":"Multimedia IEEE Transactions on","vol.": "20","pp.": "361-378","Year": "2018","ISSN": "1520-9210","ISBN":"none"},{"authors":["Ayaz Ahmad","Naveed Ul Hassan","Mohamad Assaad","Hamidou Tembine"],"article name":"Joint Power Control and Rate Adaptation for Video Streaming in Wireless Networks With Time-Varying Interference","Journal Name":"Vehicular Technology IEEE Transactions on","vol.": "65","pp.": "6315-6329","Year": "2016","ISSN": "0018-9545","ISBN":"none"},{"authors":["rger","Giuseppe Notarstefano","wer"],"article name":"Distributed robust optimization via Cutting-Plane Consensus","Journal Name":"Decision and Control (CDC) 2012 IEEE 51st Annual Conference on","vol":"none","pp.": "7457-7463","Year": "2012","ISSN": "0743-1546","ISBN":"none"},{"authors":["Chenglin Li","Hongkai Xiong","Junni Zou","Dapeng Oliver Wu"],"article name":"Dynamic rate allocation and opportunistic routing for scalable video multirate multicast over time-varying wireless networks","Journal Name":"Computer Communications Workshops (INFOCOM WKSHPS) 2014 IEEE Conference on","vol":"none","pp.": "275-280","Year": "2014","ISSN":"none","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Bo Zhang","S.-H. Gary Chan"],"article name":"Overlay construction for mobile peer-to-peer video broadcasting","Journal Name":"Peer-to-Peer Networking and Applications","vol":"none","pp.":"none","Year": "2015","ISSN": "1936-6442","ISBN":"none"}]}]}