{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 10, "citationCountPatent": 0, "totalDownloads": 509},"doi": "10.1109/TCSVT.2011.2171211","title": "No-Reference Pixel Video Quality Monitoring of Channel-Induced Distortion","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "Video transmitted over an error-prone network may be received at the decoder with degradations due to packet losses. No-reference quality monitoring algorithms are the most practical way to measure the quality of the received video, since they do not impose any change with respect to the network architecture. Conventionally, these methods assume the availability of the corrupted bitstream. In some situations this is not possible, e.g., because the bitstream is encrypted or processed by third-party decoders, and only the decoded pixel values can be used. The major issue in this scenario is the lack of knowledge about which regions of the video have been actually lost, which is a fundamental ingredient for estimating channel-induced distortion. In this paper, we propose a maximum a posteriori estimation of the pattern of lost macroblocks, which assumes the knowledge of the decoded pixels only. This information can be used as input to a no-reference quality monitoring system, which produces an accurate estimate of the mean-square-error (MSE) distortion introduced by channel errors. The results of the proposed method are well correlated with the MSE distortion computed in full-reference mode, with a linear correlation coefficient equal to 0.9 at frame level and 0.98 at sequence level.","authors": [{"name": "Giuseppe Valenzise", "affiliation": "Telecom ParisTech, Paris, France", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6069853/6069853-photo-1-small.gif", "p": ["Giuseppe Valenzise (S'07) was born in 1982. He received the Masters degree (cum laude) in computer engineering in 2007 and the Ph.D. degree in electrical engineering and computer science in 2011 from the Politecnico di Milano, Milan, Italy.", "He is currently a Post-Doctoral Researcher with Telecom ParisTech, Paris, France. His current research interests include single and multiview video coding, nonnormative tools in video coding standards, multimedia forensics, video quality monitoring, and applications of compressive sensing."]}}, {"name": "Stefano Magni", "affiliation": "Reply, Milan, Italy", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6069853/6069853-photo-2-small.gif", "p": ["Stefano Magni received the Masters degree with honors in computer engineering from the Politecnico di Milano, Milan, Italy, in 2010, with a master thesis entitled “Estimating channel-induced distortion in H.264/AVC video in the absence of bitstream.”", "Since September 2010, he has been a Software Analyst and Consultant with Reply."]}}, {"name": "Marco Tagliasacchi", "affiliation": "Dipartimento di Elettronica e Informazione, Politecnico di Milano, Milan, Italy", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6069853/6069853-photo-3-small.gif", "p": ["Marco Tagliasacchi (M'06) was born in 1978. He received the Laurea degree (cum laude) in computer engineering in 2002 and the Ph.D. degree in electrical engineering and computer science in 2006 from the Politecnico di Milano, Milan, Italy.", "He is currently an Assistant Professor with the Dipartimento di Elettronica e Informazione, Politecnico di Milano. He authored more than 50 scientific papers on international journals and conferences. His current research interests include distributed video coding, scalable video coding, nonnormative tools in video coding standards, applications of compressive sensing, and multimedia forensics."]}}, {"name": "Stefano Tubaro", "affiliation": "Dipartimento di Elettronica e Informazione, Politecnico di Milano, Milan, Italy", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6177735/6069853/6069853-photo-4-small.gif", "p": ["Stefano Tubaro (M'01) was born in Novara, Italy, in 1957. He completed his studies in electronic engineering from the Politecnico di Milano, Milan, Italy, in 1982.", "He then joined the Dipartimento di Elettronica e Informazione, Politecnico di Milano, first as a Researcher with the National Research Council, then as an Associate Professor in November 1991, and since December 2004 as a Full Professor. In the first years of activities, he worked on problems related to speech analysis, motion estimation/compensation for video analysis/coding, and vector quantization applied to hybrid video coding. In the past few years, his research interests have included image and video analysis for the geometric and radiometric modeling of 3-D scenes, advanced algorithms for video coding and sound processing, and multimedia forensics. He has authored more than 150 scientific publications on international journals and congresses. He has co-authored two books on digital processing of video sequences. He is also a co-author of several patents relative to image processing techniques. He coordinates the research activities of the Image and Sound Processing Group, Dipartimento di Elettronica e Informazione, Politecnico di Milano that is involved in several research programs funded by industrial partners, the Italian government, and by the European Commission."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Monitoring", "Vectors", "Decoding", "Measurement", "Video sequences", "Correlation", "Estimation"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["video coding", "cryptography", "decoding", "maximum likelihood estimation", "mean square error methods"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["full-reference mode", "no-reference pixel video quality monitoring", "video transmission", "error-prone network", "network architecture", "bitstream encryption", "third-party decoder", "channel-induced distortion estimation", "maximum a posteriori estimation", "pixel decoding", "mean-square-error distortion"]}, {"type": "Author Keywords ", "kwd": ["quality monitoring", "Channel errors", "no-reference"]}],"citations":[{"ieee-citations":[{"authors":["Xuelong Li","Qun Guo","Xiaoqiang Lu"],"article name":"Spatiotemporal Statistics for Video Quality Assessment","Journal Name":"Image Processing IEEE Transactions on","vol.": "25","pp.": "3329-3342","Year": "2016","ISSN": "1057-7149","ISBN":"none"},{"authors":["Zahid Akhtar","Tiago H. Falk"],"article name":"Audio-Visual Multimedia Quality Assessment: A Comprehensive Survey","Journal Name":"Access IEEE","vol.": "5","pp.": "21090-21117","Year": "2017","ISSN": "2169-3536","ISBN":"none"},{"authors":["Marco Tagliasacchi","Marco Visentini-Scarzanella","Pier Luigi Dragotti","Stefano Tubaro"],"article name":"Transform coder identification","Journal Name":"Acoustics Speech and Signal Processing (ICASSP) 2013 IEEE International Conference on","vol":"none","pp.": "5785-5789","Year": "2013","ISSN": "1520-6149","ISBN":"none"},{"authors":["Maria Torres Vega","Emanuele Giordano","Decebal Constantin Mocanu","Dian Tjondronegoro","Antonio Liotta"],"article name":"Cognitive no-reference video quality assessment for mobile streaming services","Journal Name":"Quality of Multimedia Experience (QoMEX) 2015 Seventh International Workshop on","vol":"none","pp.": "1-6","Year": "2015","ISSN":"none","ISBN":"none"},{"authors":["Marco Tagliasacchi","Marco Visentini-Scarzanella","Pier Luigi Dragotti","Stefano Tubaro"],"article name":"Identification of Transform Coding Chains","Journal Name":"Image Processing IEEE Transactions on","vol.": "25","pp.": "1109-1123","Year": "2016","ISSN": "1057-7149","ISBN":"none"},{"authors":["gaard","ren Forchhammer","Jari Korhonen"],"article name":"No-Reference Video Quality Assessment Using Codec Analysis","Journal Name":"Circuits and Systems for Video Technology IEEE Transactions on","vol.": "25","pp.": "1637-1650","Year": "2015","ISSN": "1051-8215","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Muhammad Shahid","Andreas Rossholm","m","rgen Zepernick"],"article name":"No-reference image and video quality assessment: a classification and review of recent approaches","Journal Name":"EURASIP Journal on Image and Video Processing","vol.": "2014","pp.": "40","Year": "2014","ISSN": "1687-5281","ISBN":"none"},{"authors":["Anthony Winterlich","n Hughes","Liam Kilmartin","Martin Glavin","Edward Jones"],"article name":"An oriented gradient based image quality metric for pedestrian detection performance evaluation","Journal Name":"Signal Processing: Image Communication","vol.": "31","pp.": "61","Year": "2015","ISSN": "09235965","ISBN":"none"},{"authors":["Tamer Shanableh"],"article name":"A regression-based framework for estimating the objective quality of HEVC coding units and video frames","Journal Name":"Signal Processing: Image Communication","vol.": "34","pp.": "22","Year": "2015","ISSN": "09235965","ISBN":"none"},{"authors":["Wyllian B. da SILVA","Keiko V. O. FONSECA","Alexandre de A. P. POHL"],"article name":"Objective No-Reference Video Quality Assessment Method Based on Spatio-Temporal Pixel Analysis","Journal Name":"IEICE Transactions on Information and Systems","vol.": "E98","pp.": "1325","Year": "2015","ISSN": "0916-8532","ISBN":"none"}]}]}