{"issn": [{"format": "Print ISSN", "value": "1051-8215"}, {"format": "Electronic ISSN", "value": "1558-2205"}],"metrics": {"citationCountPaper": 11, "citationCountPatent": 0, "totalDownloads": 839},"doi": "10.1109/TCSVT.2011.2158362","title": "View Interpolation for Medical Images on Autostereoscopic Displays","publicationTitle": "IEEE Transactions on Circuits and Systems for Video Technology","abstract": "We present an approach for efficient rendering and transmitting views to a high-resolution autostereoscopic display for medical purposes. Displaying biomedical images on an autostereoscopic display poses different requirements than in a consumer case. For medical usage, it is essential that the perceived image represents the actual clinical data and offers sufficiently high quality for diagnosis or understanding. Autostereoscopic display of multiple views introduces two hurdles: transmission of multi-view data through a bandwidth-limited channel and the computation time of the volume rendering algorithm. We address both issues by generating and transmitting limited set of views enhanced with a depth signal per view. We propose an efficient view interpolation and rendering algorithm at the receiver side based on texture+depth data representation, which can operate with a limited amount of views. We study the main artifacts that occur during rendering-occlusions, and we quantify them first for a synthetic model and then for real-world biomedical data. The experimental results allow us to quantify the peak signal-to-noise ratio for rendered texture and depth as well as the amount of disoccluded pixels as a function of the angle between surrounding cameras.","authors": [{"name": "Svitlana Zinger", "affiliation": "Eindhoven University of Technology, Eindhoven, The Netherlands", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6121964/5782947/5782947-photo-1-small.gif", "p": ["Svitlana Zinger received the M.S. degree in computer science from the Radiophysics Faculty, Dnepropetrovsk State University, Dnepropetrovsk, Ukraine, in 2000, and the Ph.D. degree from the Ecole Nationale Superieure des Telecommunications, Paris, France, in 2004. Her Ph.D. thesis was on interpolation and resampling of 3-D data.", "In 2005, she was a Post-Doctoral Fellow with the Multimedia and Multilingual Knowledge Engineering Laboratory, French Atomic Agency, France, where she worked on creation of a large-scale image ontology for content based image retrieval. From 2006 to 2008, she was a Post-Doctoral Researcher with the Center for Language and Cognition Groningen and an Associate Researcher with the Artificial Intelligence Department, University of Groningen, Groningen, The Netherlands, working on information retrieval from handwritten documents. She is currently a Post-Doctoral Researcher with the Video Coding and Architectures Research Group, Eindhoven University of Technology, Eindhoven, The Netherlands."]}}, {"name": "Daniel Ruijters", "affiliation": "Interventional X-Ray Innovation Department, Philips Healthcare, Best, The Netherlands", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6121964/5782947/5782947-photo-2-small.gif", "p": ["Daniel Ruijters received the Engineering degree from the Aachen University of Technology, Aachen, Germany, and performed his Masters thesis from ENST, Paris, France. He has recently finished a joint Ph.D. thesis from the Katholieke Universiteit Leuven, Leuven, Belgium and the Eindhoven University of Technology, Eindhoven, The Netherlands.", "He has been with Philips Medical Systems, Best, The Netherlands, since 2001. Currently, he is a Senior Scientist in 3-D imaging with the Interventional X-Ray Innovation Department, Philips Healthcare, Best. His current research interests include medical image processing, 3-D visualization, image registration, fast algorithms, and hardware acceleration."]}}, {"name": "Luat Do", "affiliation": "Eindhoven University of Technology, Eindhoven, The Netherlands", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6121964/5782947/5782947-photo-3-small.gif", "p": ["Luat Do received the M.S. degree in electrical engineering from the Eindhoven University of Technology (TU/e), Eindhoven, The Netherlands, in 2009. In September 2009, he joined the Video Coding and Architectures Group, TU/e, as a Ph.D. student and is currently working on free viewpoint interpolation algorithms which is a part of the iGlance Project."]}}, {"name": "Peter H. N. de With", "affiliation": "Eindhoven University of Technology, Eindhoven, The Netherlands", "bio": {"graphic": "/mediastore/IEEE/content/freeimages/76/6121964/5782947/5782947-photo-4-small.gif", "p": ["Peter H. N. de With (M'81–SM'97–F'07) graduated in electrical engineering from the Eindhoven University of Technology, Eindhoven, The Netherlands, and received the Ph.D. degree from the University of Technology, Delft, The Netherlands, in 1992.", "He joined Philips Research Laboratories, Eindhoven, in 1984, where he became a member of the Magnetic Recording Systems Department. From 1985 to 1993, he was involved in several European projects on SDTV and HDTV recording. In this period, he contributed as a principal coding expert to the DV standardization for digital camcording. In 1994, he became a member of the TV Systems Group, Philips Research Eindhoven, Eindhoven, where he was leading the design of advanced programmable video architectures. In 1996, he became a Senior TV Systems Architect and in 1997 he was a Full Professor with the Faculty of Computer Engineering, University of Mannheim, Mannheim, Germany. In Mannheim, he was heading the Chair on Digital Circuitry and Simulation with the emphasis on video systems. From 2000 to 2007, he was with LogicaCMG (now Logica), Eindhoven, as a Principal Consultant. In early 2008, he joined CycloMedia Technology, Utrecht, The Netherlands, as the Vice-President for video technology. Since 2000, he has been a Professor with the Faculty of Electrical Engineering, Eindhoven University of Technology, and leading a Chair on Video Coding and Architectures. He has written and co-authored over 200 papers on video coding, architectures, and their realization. Regularly, he is a teacher of the Philips Technical Training Center and for other post-academic courses.", "Dr. de With co-authored papers that received the IEEE CES Transactions Paper Award in 1995 and 2000, and the VCIP Best Paper Award in 2004. In 1996, he received the Company Invention Award. In 1997, Philips received the ITVA Award for his contributions to the DV Standard. He is a Program Committee Member of the IEEE CES, ICIP and VCIP, a Board Member of the IEEE Benelux Chapters for Information Theory and Consumer Electronics, a Co-Editor of the historical book of this community, a former Scientific Board Member of LogicaCMG, Scientific Advisor to Philips Research, and of the Dutch Imaging School ASCII, IEEE ISCE, and board member of various working groups."]}}],"keywords": [{"type": "IEEE Keywords", "kwd": ["Pixel", "Rendering (computer graphics)", "Cameras", "Interpolation", "Biomedical imaging", "Three dimensional displays", "Receivers"]}, {"type": "INSPEC: Controlled Indexing", "kwd": ["visual perception", "biomedical optical imaging", "image texture", "interpolation", "medical image processing", "optical information processing", "stereo image processing"]}, {"type": "INSPEC: Non-Controlled Indexing", "kwd": ["camera", "medical images", "autostereoscopic display", "multiview transmission", "bandwidth limited channel", "volume rendering algorithm", "interpolation algorithm", "texture representation", "depth data representation", "synthetic model"]}, {"type": "Author Keywords ", "kwd": ["view interpolation", "3-D displays", "biomedical imaging", "depth image based rendering (DIBR)", "rendering quality"]}],"citations":[{"ieee-citations":[{"authors":["B. Battin","G. Valette","J. Lehuraux","Y. Remion","L. Lucas"],"article name":"A premixed autostereoscopic OptiX-based volume rendering","Journal Name":"3D Imaging (IC3D) 2015 International Conference on","vol":"none","pp.": "1-5","Year": "3","ISSN":"none","ISBN":"none"},{"authors":["Chung-Hsun Huang","Chao-Yang Chang"],"article name":"An area and power efficient adder-based stepwise linear interpolation for digital signal processing","Journal Name":"Consumer Electronics IEEE Transactions on","vol.": "62","pp.": "69-75","Year": "2016","ISSN": "0098-3063","ISBN":"none"},{"authors":["ppel","ller","Thomas Wiegand"],"article name":"Filling Disocclusions in Extrapolated Virtual Views Using Hybrid Texture Synthesis","Journal Name":"Broadcasting IEEE Transactions on","vol.": "62","pp.": "457-469","Year": "2016","ISSN": "0018-9316","ISBN":"none"},{"authors":["Luat Do","German Bravo","Svitlana Zinger","Peter H.N. De With"],"article name":"GPU-accelerated real-time free-viewpoint DIBR for 3DTV","Journal Name":"Consumer Electronics IEEE Transactions on","vol.": "58","pp.":"none","Year": "2012","ISSN": "0098-3063","ISBN":"none"},{"authors":["Yizhou Fan","Nobuki Yoda","Takeo Igarashi","Hongbing Ma"],"article name":"Path-based image sequence interpolation guided by feature points","Journal Name":"Image Processing (ICIP) 2016 IEEE International Conference on","vol":"none","pp.": "569-573","Year": "2016","ISSN": "2381-8549","ISBN":"none"},{"authors":["Sunghwan Choi","Bumsub Ham","Kwanghoon Sohn"],"article name":"Space-Time Hole Filling With Random Walks in View Extrapolation for 3D Video","Journal Name":"Image Processing IEEE Transactions on","vol.": "22","pp.": "2429-2441","Year": "2013","ISSN": "1057-7149","ISBN":"none"}]},{"nonieee-citations":[{"authors":["Daniel Ruijters","Svitlana Zinger","Luat Do","Peter H.N. de With"],"article name":"Latency optimization for autostereoscopic volumetric visualization in image-guided interventions","Journal Name":"Neurocomputing","vol.": "144","pp.": "119","Year": "2014","ISSN": "09252312","ISBN":"none"},{"authors":["XIUJUAN LIU","HONG JIANG","YUEDONG LANG","HONGBO WANG","NA SUN"],"article name":"A novel stereoscopic projection display system for CT images of fractures","Journal Name":"Experimental and Therapeutic Medicine","vol.": "5","pp.": "1677","Year": "2013","ISSN": "1792-0981","ISBN":"none"},{"authors":["Huu Noi Doan","Beomsu Kim","Min-Cheol Hong"],"Article Name":"none","Journal Name":"Lecture Notes in Computer Science","vol.": "9315","pp.": "598","Year": "2015","ISSN": "0302-9743","ISBN": "978-3-319-24077-0"},{"authors":["Young-Ho Seo","Yoon-Hyuk Lee","Ja-Myung Koo","Dong-Wook Kim"],"article name":"Intermediate View Image and its Digital Hologram Generation for an Virtual Arbitrary View-Point Hologram Service","Journal Name":"The Journal of the Korean Institute of Information and Communication Engineering","vol.": "17","pp.": "15","Year": "2013","ISSN": "2234-4772","ISBN":"none"},{"authors":["Zhongyun Hua","Shuang Yi","Yicong Zhou"],"article name":"Medical image encryption using high-speed scrambling and pixel adaptive diffusion","Journal Name":"Signal Processing","vol.": "144","pp.": "134","Year": "2018","ISSN": "01651684","ISBN":"none"}]}]}